{
  "dog": {
    "content": "Although last year may have been more “ruff” than usual for Dog people, pun intended, this year should bring a change of fortune. And no one deserves it more than the loyal, valiant, courageous Dog. You are any man’s or woman’s best friend for sure. That’s because you are honest and faithful to a fault, and certainly someone who always stands up for injustice. You are also lively, lovable, and completely sincere. Those who get to know you will know exactly where they stand with you at all times. At the same time, though, you can be moody sometimes. Your sensitive nature is wonderful when you pick up vibes and feel empathy for others, but at times you can be overly sensitive, often picking up troubles from others and taking insignificant things to heart, which leads to you bruising easily. But this year, with a positive change of fortune, your stronger qualities will emerge and will lead you to success.\n\nThis Rat year can be a year of challenges, achievements, evolvement, and success. In other words, dear Dog, a little bit of everything, which will keep you on your toes at all times. This can be a very stable year for you, with some very good opportunities for bringing in more money or even for experiencing some sort of a lucrative windfall. But any opportunities that come your way in this regard this year must be seized immediately, and you must take charge from the start. Luckily, yours is a very decisive sign, which will help with this aspect in 2020. If you don’t act quickly, or if you fall into a pattern of putting things off, this could become a year filled with regrets rather than satisfaction, but that is easily avoidable by acting promptly and not leaving things unaddressed and unhandled, and your natural tendency to act will help you with that.\n\nBecause Rat energy is an indicator of money coming in for the Dog, there may be many chances and many ways to acquire it. As long as you do not become greedy, and if you don’t waste what comes to you, this pattern should continue for you throughout the whole year. Although your usual work life may not change very much this year, through negotiations, you may ensure certain conditions that could lead to great things in the future. And any dreams you have been harboring apart from your usual career could take off and flourish in the coming year as well. One very nice perk related to your job or career this year could come through the people you meet and connect with. You could cross paths with at least one new person who will seem like a soulmate right off the bat. This could be a romantic connection, but it could just as easily be a friendship that will stand the test of time. This person could become someone who understands you on a different level and someone you’d be able to confide in and lean on in any tough situation you might find yourself.\n\nYours is the ultimate sign of family, Dog. And this year will be no exception. The closeness you feel toward certain family members will be very much rewarded this year. Last year, you may have felt neglected or cast aside by certain people that you care about, but that should all change this year, which will bring you a great sense of peace and contentment. The only possible flare-ups could occur because of misunderstandings. But this may be primarily one certain person who has always had issues with communication. If you are patient and direct, though, you should be able to work all of this out. News from a very close family member about an unexpected change could come as a huge surprise, but the more you learn about it, the more you will agree that it is an excellent idea. Be supportive.\n\nYour love life may not have been very satisfying last year, dear Dog. This may have been very unsettling and unhappy for you, because you are someone who is most happy when you are in a committed loyal relationship with someone you know you can count on. This year, things are destined to improve for you where love is concerned. At first, if you are single – perhaps early in the year – you may set your sights on someone who isn’t the best for you. You may become more preoccupied with winning this person over rather than with figuring out if this person is right for you or not. But before you know it, someone new and very, very special could come along, and you will notice instantly the difference between an illusion and the real thing. For those of you who are attached, this can be a sublimely wonderful year. You may be able to feel the ideal of the perfect relationship with your mate, getting along, communicating well, and enjoying a sizzling romance. Yes, 2020 is building up to be a very good year for Dog in the love department indeed.\n\nThe Dog people will have their day in 2020, and if you flow with the challenges, celebrate the achievements, and generally appreciate all that life blesses you with, the good vibrations will continue throughout this year. Your talents should be noticed by people who can help you evolve, shine, and help you make connections where you can best utilize your gifts this year. Your prospects for greater prosperity and abundance are magnified this year, which is especially good news for you since yours is a sign that is very concerned with security. So, overall, despite a few small challenges and lessons to learn here and there, this can be a wonderfully enjoyable and fulfilling year for Dog people."
  },
  "dragon": {
    "content": "With your nobility and your mystery, Dragon, you are the stuff of legends. You are powerful, brave and courageous, and so you inspire awe and you attract many admirers. Despite your larger-than-life persona, you can be quite a down-to-earth person with a big heart. You are born in a year of a mythical beast, and yours is one of the most revered of the signs. You have a good sense of humor unless someone is mocking you in some way, in which case you can be quite fierce. Self-esteem is usually not an issue with Dragon people. In this Rat year, dear Dragon, you can flourish if you vow to work harder, bring yourself more down-to-earth, and be more direct and persistent in your efforts.\n\nPeople born in a Dragon year are considered to be among the luckiest. Perhaps because you often feel so lucky, you tend to be driven more by passion and imagination than by ambition. Although you do desire the richer aspects of life, you often drop ventures in mid-stream when something else strikes your fancy. If you do not work in a field that allows you to use your creativity and to dwell in your own imagination for much of the day, you may find yourself quite unhappy, bored, and unsatisfied. Many Dragon people are drawn to fields such as architecture, art, and the sale of antiques for example, because you can appreciate and you treasure the fine workmanship and the passion that goes into a creative project. Despite an inclination to sometimes flit from one thing to another, you do have occasional big successes that keep you going. Your natural good luck, many times, plays a nontrivial role in this. If you do work in a corporate role, despite feeling you aren’t quite cut out for it, you may fairly quickly wind up in a role of authority, because there is a natural dignity and royal bearing to you that others take very seriously. This year, you may have the goal of beginning a new business or a money-making venture that could involve international travel or dealing with parties from other regions or countries. You will be in your element with this because your uniqueness and certain mystique will compel others to pay attention.\n\nYou can also be quite compelling in matters of love. You are something of an enigma, but a divine, magnetic charming enigma. Both men and women may swoon over your natural charm. You do like to make your own rules, which can sometimes cause you trouble in your love life. This year, if you want your romantic relationships to be more content, you will need to work on being more flexible and compromising when the situation calls for it, which may happen for you several times this year as a test of your willingness to change. Some people are drawn to your intelligence, while others are sometimes intimidated by it. To attract the right person, you have to find someone who finds your mental acuity to be stimulating and appealing on every level. You are a passionate lover and someone who may play the field for some time before settling down – and many Dragon people do not settle down until later in life. If you are single, you may choose to romance with many admirers this year, but there could be one special someone who will stand out. This person may play hard to get, but that’s a game you love. If you are attached, your love life could become red-hot, creating a higher level of synchronicity between you and your partner. If you travel, you should consider including your partner in your plans.\n\nYou can sometimes get highly critical, to an extent where it may be perceived as tactless, which may be surprising since otherwise you tend to be mellow tempered and quite emphatic. You hate injustice and will swoop in to save the day if someone is being treated unfairly. This year, you may choose to involve yourself in some kind of a charitable pursuit. This will be something that is truly coming from the heart, rather than as a means to make good connections or to meet interesting people – although both of these could come through this activity. This should be something you will greatly enjoy, and it may become a lifelong devotion that continues to bring you great fulfillment. Pursuits like this could also offer you myriad opportunities to step aside and allow others to lead now and then so that you can build trust and allegiance with others.\n\nWhere family is concerned, there may be a particular family member who has always seemed like a nemesis to you. This person has always seen you as conceited and self-absorbed, and perhaps you have been to some extent when around this individual. When someone rubs you the wrong way, you make it very clear, and you don’t bring out your best, nicest self or your best behavior. This year, try to work on building a stronger bond with this person despite everything, as they will be a part of your life for the foreseeable future because of related alliances. This will give you the chance to relax more when in the company of the people that you both associate with.\n\nThis year can be breezy and carefree for you if you try to go with the flow more than you have in the past, Dragon. You must also be careful about becoming overconfident, because you have a chance to build a humbler reputation in 2020 - one that will draw other interesting people into your world. If you can devote time to working on special projects and can manage to remain dedicated and driven, you could bring an especially big goal to fruition. When you share your magic, it can be mesmerizing, and this year that quality is especially enhanced for you. It won’t be hard to make this a wonderful, memorable year."
  },
  "general": {
    "year_sign": "Rat",
    "year_element": "Metal",
    "content": "Welcome to the Year of the White Metal Rat – a year that will be marked with new beginnings and renewals, exciting opportunities, love, romance and extraordinary potential for financial gain.  Although each sign may be affected in unique ways by the Rat energy, it should generally be a good and prosperous year for all signs.\n\nPersonal success is enhanced this year, as this is the perfect time for laying foundations and evolving toward your highest self. Even though hard work will be required to reach the topmost levels of success, all dreams and goals will receive extra blessings and extra assistance. For many people, this could be the year when a hobby or an interest can be successfully transformed into a money-making venture and those who pursue financial gain through businesses or activities they love will be especially lucky.\n\nThe Rat is a sign of opulence and is considered to be the protector and the bearer of prosperity. Rats love bright and shiny things, so dressing for success and always putting on the best show possible is advised when you are reaching for a dream during a Rat year. Even though the Rat loves luxury, they work very hard for what they have, and they can often be frugal with certain things. So, accordingly, while obtaining some luxury items would align with this year’s energy, indiscriminate spending this year is not advised.\n\nFor those who are hoping for big achievements this year, keep in mind that a Rat would advise you to do some very careful planning. A strong strategy is the best way to begin any venture this year. Having a good foundation for anything you do is far more conducive to success, because it strengthens confidence in a positive outcome.\n\nThis is an excellent year to pull out those big dreams that have been set aside and bring them out to the light and infuse them with new energy and creativity. The Rat is known for its resiliency and innovativeness, so reviving a project that has great meaning to you may be an especially rewarding task in 2020. Plus, you stand a very good chance of taking your dream all the way to its logical conclusion.\n\nThis year, bearing the stamp of the metal element adds certain nuances to this year’s energy. The Metal Rat is strong, both physically and emotionally, so improving one’s physical fitness and emotional well-being is highly recommended this year. The Metal Rat is also quite eloquent and tasteful, so these characteristics can be developed in anyone and can enhance personal success as well. The white color of this metal rat year is further indicative of success and prosperity."
  },
  "horse": {
    "content": "It is hard to resist the dramatic image of a beautiful equine galloping across the landscape or kicking up its heels in a lush green field. Like the Horse that represents your year, you are beautiful, graceful, and powerful. Your magnetic charm is absolutely captivating. You are often found on center stage, metaphorically or otherwise, commanding the attention of a rapt audience. You can banter with the best of them, engaging in lively conversation with anyone from any walk of life. Horses are herd animals, and you too are someone who loves your social life and of course, your close friends. If it were possible, you would never say no to a party invitation. Although you are intelligent, your confidence may not match your wit because you tend to rely on others in a challenge, which may be part of your “herd” mentality. This year, working on becoming more independent and surer of yourself will enable you to eventually manifest your wildest dreams.\n\nMost Horse people are quite popular, and in this Rat year, you will be especially so. You may find your inbox deluged with invitations, and you may attract attention in every area of your life. You should find yourself to be kinder and more rational than usual, and your straightforward nature will be highly appreciated. Although you work well with others, you are not someone who likes taking orders. This year, there will be many chances – both personal and professional – to call the shots and lead the way. Your honesty and your easygoing nature will win you over many friends and admirers this year, while your wit and sense of humor will keep people drawn to you. This is a perfect year to work at being more patient and less self-centered. You may find many outlets for thinking of others and helping them out, which will boost your sense of being a good Samaritan and finding pride in that role. In fact, this can be a year of tremendous growth in that regard for you.\n\nYou are someone who runs at full speed after the things you want in life, including love, your ambitions, and your dreams. But you are also a fight-or-flight type, and when you become afraid, you may run off quickly and be very hesitant to return. Often, your fears are magnified by your imagination. This is a very good year to work on being more stable in that way and facing your fears rather than fleeing from them. Because you have great stamina, you are better able than most people to keep trying and trying until you have what you want, and this is a trait that will serve you well in the Rat year. Because you are highly intuitive, you will be able to sniff out opportunities in the wind and follow them quickly, leaving the competition in your dust. People born in the year of the Horse tend to be quite outspoken, which often can help you get what you want. But this year, you are advised to be more cunning than outspoken, hiding what you feel until just the right moment. This will enhance your success in the year ahead. You may experience a lot of jealousy as opportunities come flowing to you, but if you deal with these by being calm, kind, and generous rather than kicking out at someone, you will secure your good reputation.\n\nIn love, you are quite a desirable prospect. Your sign - the horse is the symbol of freedom though, and so it takes a lot to put a proverbial rope around your neck and saddle you up. It takes a very powerful feeling of love for you to want to settle down. But your beauty, your free spirit, and your natural charm are all elements that many will fall for this year, and you shall have romantic admirers everywhere you go. After all, who wouldn’t want to gallop off into the sunset with the likes of you? Just be sure to be discerning in who you choose to spend your time with, and how you express yourself. If you are single, and you are only in a relationship for a fling, be straightforward about it – or you could draw justified ire from those who feel they were misled. You may want to play the field much of the year unless you happen upon someone who truly captures your fancy. If you are attached, you may struggle with jealousy – either you or your mate may be jealous. But this may be based on the looks others send your way rather than on any real breach of trust. Work it out calmly and kindly and all should be just fine.\n\nYour family is important to you. You are sentimental and deeply emotional, and nothing brings these traits out more in you than your family. When things are going good with them you are at your happiest. And when things aren’t going so great, you tend to get caught up in despair. Тhis year, luckily for you, family matters will be very positive, and relationships should be quite strong and enjoyable. There could be a clash with family around the middle of the year when someone expresses their dislike of your mate or romantic prospect, but you should be able to convey your reasons for choosing that relationship. A younger family member might want to join you in business or enter a field you know a lot about, and you may have the chance to take on a mentorship role, which would be a valuable experience for you. You tend to be less grounded at times because of your strong independent streak, and having someone rely on you will serve as a kind of balance. By the end of the year, some success that will also benefit your loved ones could come to you.\n\nThis Rat year can be an excellent year for you, Horse. If you delve into more stable pursuits and remain more grounded than usual, you will begin to discover qualities made possible through that experience that you have not recognized in the past. This year can be one of many personal and professional achievements, and it can be an excellent year for you socially as well. Be more generous of giving yourself to your loved ones. Your time and your attention are treasured by them. And, there are incredible blessings to you as well when you know you have a strong foundation in your family to lean on."
  },
  "monkey": {
    "content": "If you have ever visited a zoo, you have probably noticed that the Monkey house is always wild with activity, and even in captivity, these fun-loving creatures can find many ways to entertain and enjoy themselves. If you are born in the year of the Monkey, you too are blessed with the insight and sense of humor to make the best of any situation, and the resources to enjoy life to the fullest. You are extremely clever and creative, and you are drawn to challenges because you love to engage in exercises that engage your intellect and your problem-solving abilities. Because you are a fast learner, you can excel at any task you choose to take on. In a Rat year, there is an enhanced appreciation for doers - for people who think on their feet and are crafty enough to take on each opportunity as it comes up, and you, dear Monkey certainly qualify. Just be sure that you don’t quit at a promising task because of boredom. This year holds many surprises for you, Monkey, and if you are in tune with your nature, 2020 should offer you an enjoyable ride.\n\nThe mischievous, naughty monkey should find that 2020 will offer a playground for their imagination. You should find that your best qualities will be in the spotlight this year. Your wit and intelligence can take you far if you don’t allow your propensity for silly hijinks to derail you. With your incredible memory and your affinity for challenging your mind, this year will be exceptionally appealing because of the many learning opportunities that come to you – some of which may offer immediate material gain. As long as you are honest about your learning and you don’t become arrogant or profess to know it all, you should be able to absorb valuable lessons that you can apply rather quickly. You are very resourceful, Monkey, and you happen to be very lucky at attracting money. This year, this penchant will be magnified with many chances to improve your financial situation. Your sense of humor and your love of the spotlight could put you in positions of power and influence this year simply because you draw so much attention, and someone who has the ability to help you out may come to admire your entertaining qualities. Yes, you do love to be the center of attention, but you have to balance that out by giving credit where credit is due, and by not hogging the spotlight at the wrong moments.\n\nIf you are in a leadership role at work or if you have your own business, your natural exuberance could draw in a new partner who is charmed by your wit and mesmerizing persona. You can be very mistrustful at times, and although it would be wise to check the new potential  partner thoroughly, don’t go overboard, or you may appear to be paranoid. You must also set aside your tendency to manipulate others in business matters this year, even though you may have the best of intentions. Allow everyone to participate equally while you lead the way, and you will get the best results. A venture that is surrounded by laughter, good humor, and well-being could become available to you in 2020, and this is something you can take on with a light-hearted attitude. If you do, you may find that it will grow big rather quickly, reaping many rewards that will bolster your future in multiple ways – including financially and socially. Someone you meet through work or business this year could turn out to be a lifelong business partner and/or a true personal friend, which could bring even greater enjoyment to your work and business opportunities.\n\nYou are not someone who tends to form many personal attachments that are too close, even among family. You are not the most trusting soul most of the time, but when you do let someone into your life, they are very special to you. This year, you may find your propensity for making close personal connections will be enhanced, which could add a new level of enjoyment to your personal life. There will be many opportunities to socialize, and with your wicked wit, you are on everyone’s invitation list. A family conflict could erupt this year, perhaps around mid-year, that you may not know how to handle. But if you observe others in similar situations, you will find a way to resolve this happily. You may also put off some family member or friend who wants to intervene in a business matter. But you are advised to at least discuss this in a fair and gracious way rather than cause hurt feelings.\n\nIn love and romance, Monkey, you are someone who likes to play the field, sometimes for a very long time, and many Monkey people settle down fairly later in life. Many Monkeys have issues with trust, but once you do trust someone, you recognize the value of loyalty and reliability and treat them like gold. When you are in love, you are steadfastly faithful. Maintaining that love is something you have to do consciously, always creating new ways to find romance in everyday life. If you are a single Monkey, you could meet someone this year who truly challenges you – which is really saying something! This is someone who will allow you to dazzle and shine in the ways you love, while still maintaining their own charisma. Although you probably won’t move into a permanent agreement right away, this bond should grow warm and strong throughout the year. If you are attached, there could be some conflict related to your tendency to exaggerate or to steal the spotlight, but this is something you can resolve by giving your mate more nurturing attention and by refining any tendencies in yourself that need addressing.\n\nWith your considerable wit and mesmerizing charm, this Rat year should serve you well, dear Monkey, for these are traits that will be favorited. If you work on allowing others to enjoy their own glory while relishing opportunities to do so, you will win over difficult people and make friends in high places in 2020. If you also work on being less erratic and less likely to flit from adventure to adventure, you can accomplish quite a lot this year. In every area of your life, Monkey, this can be an enjoyable, productive, and profitable year. You may even unknowingly teach a few in your crowd how to truly enjoy themselves, which is an important accomplishment in itself!"
  },
  "ox": {
    "content": "Steadfast, sturdy, hardworking, and honest, the stellar character of the Ox makes the person born in the year of the Ox a pillar of society. You are known to be reliable and authentic, and many consider you to be the one to turn to when support is needed, or to seek true friendship. You are naturally kind and understanding, and you rarely lose your temper. These qualities combined with your strength of character make you both an excellent leader and a trustworthy partner. In 2020, your upstanding personality, your work ethic, and your overall geniality will draw in many opportunities and numerous chances to succeed.\n\nThis year, you may find that someone may seek you out for an important partnership or shared venture. You are known to be an upstanding individual, and the above-mentioned qualities will put you on the short list for several big opportunities. You tend to make your most important decisions very slowly though, and that could become a hindrance to you this year. If you wait too long on certain opportunities, you may miss out, as there may be deadlines to adhere to and things to get done that just can’t wait. Try to find an organized way of making these decisions so that you can take advantage of every opportunity that comes your way. Since there may be something that is especially compelling to you, you may feel inclined to put on a show or behave in a way that is a bit more dazzling, but that really won’t be necessary. It is your low-key persona and your amiable nature that will be most appealing.\n\nYou may have a personal dream that you have always set aside because of other responsibilities. This year, it is essential that you pull this dream out from the back burner and start infusing it with new energy and hope. This is truly something that can be a big success this year if you devote even a small amount of time to it continuously. If you are in business for yourself, or if you are in some level of management working for someone else, you could land a big contract or bring in a big account, which will significantly impress others. This could be the beginning of a major positive transition in your career. A hobby could become a vocation this year if you choose to take that route. Do your research, but don’t keep putting it off because you are helping others chase their own dreams. You owe this to yourself. A role in your community may also be a possibility this year. This could mean anything from volunteer work for a favored charity, to running for some sort of a position in a public office. Although you are generally very hardy and you have a strong constitution, you do need to watch out for stress and how much you overwork this year, as these can negatively impact your well-being.\n\nThe Rat is one of your most compatible signs, and this will bode well for you this year in all areas of your life. The Rat appreciates your affinity to frugality, so by being very conscious of what you spend and invest and by remaining in charge of your financial affairs, you will be in the sweet spot and lucky breaks will surely come your way as the year unfolds. In love, you may find that this is a year that will be quite romantic for you and your partner, or in a courtship that is very important to you. If you are single and hoping to settle down with that special person, this could be the year for you to do just that. If you are attached, you should experience excellent communication and warm feelings with your partner, which will validate your bond and allow you to grow closer together.\n\nThere could be a big change in an important relationship this year that will have you perplexed and will leave you trying to figure out how to get back on track. This may be an old friendship or a relationship with someone akin to a sibling. But if you worry too much about this, you may overreact and create more tension. Just show that you care, that you are there for this person, and that you are willing to do whatever it takes to get things going well again. And when the time is right, it will happen naturally. This is nothing to worry about, and any odd behaviors are not due to you at all, but rather circumstances surrounding the individual. A windfall may come to you this year as well, although this is not a time to splurge. If you invest wisely – either in a tried and true source or in a business opportunity that is secure – this could end up being very fruitful.\n\nAll in all, Ox, this is a year of peace, happiness, and contentment with yourself and with the world around you. The year, the Rat energy will keep you working at what you love to do and will enhance any ventures you choose to take on. By continuing to be authentic to your nature and by following your heart, you will make all good choices. This year will give you the chance to rest on your laurels a bit and to take action on those opportunities and dreams that are most important to you. Savor the flavor of the year, and celebrate the calm and quiet energy of your life."
  },
  "pig": {
    "content": "You are a sweet realist, dear Pig, but this year you may keep your head in the clouds far more often than usual. That’s because there may be an almost magical tone to this Rat year right from the beginning. Your natural ambition and your devotion to your goals are very compatible with the Rat energy, and these and your other qualities will stand you in good stead in 2020. Also working in your favor, your constant sense of compassion and understanding of others, your devotion to helping others in need, and your keen sense of responsibility will ensure your place when good fortune comes to call. Overall, this can be a very good year for you.\n\nYour altruistic nature will be very appealing to people with influence this year who will observe your many kindnesses and your strong sense of duty to your obligations, and they will in turn feel the urge to help you in any way they can. This means that a variety of good opportunities will be enhanced by help from powerful sources. Although the Rat is not one of your strongest alliances where compatibility is concerned, there is definitely mutual respect. And respect can be even more important than other types of camaraderie in many situations in life. You can expect a plethora of options this year in most areas of your life – including business, money, investing, contractual agreements, romance, and much more.\n\nYou have a beautiful personality, Pig, and you draw others to you socially in your personal life all the time. This year, that lovely persona will also benefit you where business comes in. You may meet many people in 2020 who will want you on their team, and this is either in your chosen career or in your own enterprise. There could be the possibility of travel, either international or domestic, that will come to you in efforts to win over clients or to increase your skills. You are a very driven sign when you decide you want something, and your diligence in pursuing your goals will pay off handsomely this year. Anything you start and keep pursuing will most likely result in great success. You are someone who doesn’t just talk the talk – you are someone who walks the walk consistently. People love this about you because it means that you are someone who can be counted on. Your energy and enthusiasm will also earn great points for you in business matters this year.\n\nIn terms of love and romance, 2020 should be better for Pig people than for most other signs. Passion will ascend to new heights, and love in general will be fiery, potent, and thrilling. This year, even during melancholy moments, don’t hesitate to get out and about and make the most of your love life because you will not want to miss a moment of it. Do your best to create romantic moments in romantic settings, and don’t be afraid to express how you feel. Your deepest emotions and loyalties will be greatly rewarded this year. If you do your best to keep the lines of communication open and flowing, avoid anger, and choose heart-to-heart talks over lashing out, this can be an excellent year whether you are attached or single. If you are single, you may be looking for “the one” now. You could meet a very special someone on a blind date or in some other way that seems like serendipity. If you do meet the one, the romance could move very quickly. If you are attached, romancing your lover will bring wonderful rewards and perhaps a closer bond than you have ever known with your mate. Be sure to make time for frequent date nights and for stolen moments with a glass of wine and deep conversation.\n\nFriendships and family relationships should go very well for Pig people too in 2020. You should enjoy closer connections, greater communication, and many opportunities for fun times together. This year, you could also reconnect again with someone from your childhood. Even if you have not seen each other for quite some time, it will be as if you never skipped a beat, and you will have the chance to make this renewed relationship flourish. There could be travel associated with a friendship or a family connection – perhaps a reunion of some kind. If you do experience a rift of any kind with a friend or a relative this year, it will be easily solved with compassion and understanding, which are qualities you have in great abundance.\n\nGet ready for a fun-filled year, dear Pig. You are certainly deserving of the grand times that lie ahead. You may not have been expecting much improvement this year over last, but you can expect several surprices. In fact, this Rat year will be filled with plenty of pleasant surprises for Pig people in so many areas of your life. There will be chances to excel in what you do best in your work, to build a stellar reputation, to meet a variety of unique and exciting people, and to grow even closer to friends and family members. Don’t waste a moment of the auspicious vibrations the Rat energy is sending your way."
  },
  "rabbit": {
    "content": "You are peace-loving, kind, and quiet. Just like the Rabbit that is the symbol of your sign, you are a lover, not a fighter. Your tranquil nature inspires others to show their softer sides, and you invite a very harmonious vibration wherever you go. You are also very lucky, Rabbit, and in 2020, your fortunes will be further enhanced. Because of your quiet ways and your soft nature, people often underestimate how fast-moving and agile you can be in business and other dealings. This can be an advantage to you – especially this year – because your stealth and silence hide a very capable personality. Many Rabbit people bloom later in life taking strides slowly toward their goals. But when you reach the place you want to be, it is a place of comfort and luxury.\n\nThis year, dear Rabbit, the energy of the Rat will favor your gentle nature and your love of the finer things. You may find that people who offer excellent connections and the help you need will naturally turn up around you and gravitate towards you. It may even seem that whenever you feel cornered or in dire straits, someone or something will come along to save the day. Although you do easily draw in an easy, richer lifestyle, your true values lie with your home and family. This year, the chances you take will be to support and uphold your family’s lifestyle and happiness. Your efforts toward success and making dreams come true may center around your family and loved ones. You should involve them in the ventures you take on. Your perceptive nature and your considerate, thoughtful ways mean that others trust you easily, which can be very good for you when making business or other money-related decisions. You are an honest, honorable negotiator, and you may do your fair share of negotiating this year for others who know you have a knack for such things. The only thing that may frustrate you in 2020 will be the tendency of Rat energy to bring about harmless mischief which does not appeal to you. But if you remain patient and true to yourself, you will endure and cope with it just fine.\n\nIn love, this should be a satisfying, content year without much – if any – drama. Your relationships, in general, should be quite loving, strong and peaceful, and you may even begin to make some brand-new friendships that feel like those that have been around since childhood. You are someone who truly savors your relationships, and you are not afraid or hesitant to show the depth of your feelings and to do thoughtful, sweet things for your loved ones. Single Rabbit people may be quite content without seeking out a significant other this year, but you may find one anyway when you least expect it. If you do, you may want to take the relationship very slowly because you aren’t in a rush to commit, and that will be just fine. If you are attached, the allure of hearth and home will mean many warm and cozy nights shared with the person you trust the most in the world – in other words, a very endearing romance that stands the test of time.\n\nA strong and healthy constitution is your birthright, Rabbit, and this year you should find yourself in robust form. That does not mean that you shouldn’t continue to take good care of your health and your well-being – spiritually, physically, and emotionally – but you will feel quite vigorous and enthusiastic throughout the year. Still, this is a great year to begin a more advanced health and fitness campaign if that is something you have been thinking about. Your life should be quite even and calm in 2020 and it will give you the time you need to establish a good routine.\n\nYes, dear Rabbit, 2020 has the potential to be very fulfilling and extremely satisfying for you. If you maintain your gentle nature through meditation and the occasional self-indulgence, all should go well in virtually every area of your life. Remember not to be upset by small annoyances and to seek solace and solitude when you feel overwhelmed. You are very good at maintaining a happy home and engaging in pleasant socializing with others which contributes to your usual state of contentment. As long as the center of your world – which is your home and your family – is welcoming and warm, you are happy. This Rat year’s energies will elevate the hearth and family and should bring you a wealth of happiness and satisfaction in 2020."
  },
  "ram": {
    "content": "The gentle Sheep is as warm and as loving as his wooly coat. If you were born in the year of the Ram, you are among the most sensitive of all the signs. Most Ram people are a very sociable, preferring the company of friends and loved ones to spending time alone. You are also quite creative and may be quite gifted artistically. And where love is concerned, you are one of the most deliciously romantics of all of the signs. Your sense of style is unparalleled – and it is probably quite unique. Yet no matter how you do your hair or what you wear, you are always quite fashionable and a real standout. You may be a very spiritual person and perhaps drawn to the metaphysical too.\n\nThe Rat, generally speaking, is not one of the Ram’s most compatible influences. And there may be a few challenges for you this year, but that doesn’t mean you can’t have an excellent year nonetheless. Your focus will be on personal growth and on developing some of the strengths that the Rat embraces – and these are things that will ultimately make your life richer and happier. For example, this year, you should strive to be more ambitious and more proactive. If you don’t have a dream you wish would come true, then start dreaming – dream bigger and bolder. Any efforts you make at excelling at work, starting a business, perfecting your skills, and networking will be enhanced and blessed in 2020. That last component – networking – is something you should be especially good at because you are naturally sociable and very likable, so you can make many good connections this year. You are definitely someone who prefers to work at your own pace, which is never hurried, but this year you may want to work on being more efficient and productive so that you can get a lot more done more quickly. You are an emotionally vulnerable sign, so you prefer to be surrounded by people cheering you on and supporting you. That isn’t always possible, though, so working on being more independent will also be a magical tonic that will contribute to your success this year.\n\nWith work, business, and money, you can make great strides this year. If you apply the lessons you are learning, there is no limit to what you can accomplish in the months ahead. Do you hope to be promoted at work or make some other significant progress? That’s a great goal, and one you can potentially fulfill. Is a personal goal or more lucrative income on your to-do list? Check it off if you work ambitiously at making your life richer and draw greater abundance into your life. Want to start a business or try a side hustle? This is a great year for that too. In other words, whatever professional goals you set your mind to this year, it will be supported by the universe and the mercurial Rat energy. Through networking this year – either in work and business circles or through your social life – you stand to meet some pretty interesting people. These will be folks who can help you build and further your goals, so be sure not to duck out of networking events and other networking opportunities and to make a great impression whenever you venture out. You may choose to address a really big goal this year that others might have doubts about, but with dedication and the favorable energy this year, you can certainly do it.\n\nYour family is very important to you, and you appreciate their love and attention. The only problem that may arise this year related to family or friendship is your need for constant approval. When those you love and care for don’t approve of something you want to do, you might instantly give it up. Don’t go there this year. If there is something you feel drawn to, then get out there and grab it. The support will come to you in time if you show how serious you are about your goal and if you work hard to achieve it. Be your own cheering gallery if you must. Also, try not to rely on others for resources and instruction as you usually do. Go out and learn, discover, and research for yourself. There is much to be said for being a pioneer this year for you. Success or very significant progress in some very important venture is very possible by the end of this year.\n\nIn love, the Ram should have quite a warm and cozy year – as long as you are not gullible. Unfortunately, believing in others who have not proved their merit is an occasional weakness of yours. Try to be more discerning this year in who you put your trust, and you should be fine. This is especially true if you are a single Ram because although there will be many people around to meet and romance, you will need to be on your toes to figure out who among them you can trust. If you are careful, though, you could meet several very sweet people with definite possibilities for a wonderful romance. If you are attached, you and your sweetie should draw even closer together this year. If you have a common goal or an interest – it will cause you to spend more time together and learn to work together better in harmony. If you did not discover such mutual interest yet - this is definitely an avenue to concentrate on this year. Once you find the right thing, everything else will click naturally. \n\nDespite some friction from Rat energy in certain areas, this year can be very positive for you if you study the lessons sent to you and apply them to your daily life. Be more willing to get out and about and to stoke your ambitions with big dreams. Don’t be afraid to venture out alone on quests that are meaningful to you. And most of all, be as secure in yourself as possible, building up your confidence through those ventures that are most important to you, dear Ram."
  },
  "rat": {
    "content": "This is your year, charming Rat, and it will be a year when you will shine your brightest. All of your natural qualities will be enviably enhanced, making it even easier for you to attain happiness and any kind of success that you desire. You are clever, imaginative, and highly adaptive. Although you have a love of hearth and home, you also crave excitement at times and you love a good adventure as long as you have a cozy hideaway to retreat to. In 2020, you will be the star, drawing in all kinds of opportunities and attracting interesting people into your circle.\n\nYour creativity is one of your most noteworthy characteristics, Rat, and this year you will have many chances to show it off. This will be especially important to you at work or in business where your imaginative ideas can be put to good use for financial gain. Many of the people of your sign work in creative fields, but even if you don’t, you are sure to put your creativity to powerful use in whatever you do this year. In fact, matters involving your creative talents are especially favored. If you have been thinking of doing something independently this year – either launching a new career, starting a business, or engaging in a big project on your own – you could do very well with that this year. Just be sure to remain open to the suggestions and feedback from others so that you can stay centered and aware.\n\nThere may be many learning experiences available to the Rat this year, and you would be wise to take advantage of absolutely anything that you find interesting and compelling. Much of what comes to you will be preparing you for opportunities that are to come, so be mindful of where you imagine yourself in the months and years ahead. You may also find that success comes easiest through endeavors that start out as wild ideas that you can refine and transform into something practical. Don’t dismiss any dreams and ideas just because they seem too far-fetched, for this is a year when the impossible can become possible for you. The wide array of personalities you meet this year could also be instrumental in what you choose to pursue because new friends and acquaintances could open up new doors for you.\n\nThe only possible area of challenge this year could be family matters that you put off resolving last year. This year, you will have to face certain difficulties that only you can handle, and you may have the urge to push those off once again. However, if you do, there could be a snowball effect that could cause a lot of frustration. But if you deal with this responsibly and caringly, Rat, you should find that any outstanding matters that are related to family or friendships can be easily handled and can actually change relationships for the better this year. You may develop one or two new friendships that are very favorable for you in many ways – both personally and professionally. There will be at least one new individual who feels like a treasured old friend right off the bat. Be sure to nurture relationships like this and to stay connected, because there is the potential for great joy to come to you through this.\n\nFor Rat people, 2020 could be quite a sublime year where love is concerned. You find it easy to meet and mingle, but finding a soulmate can be a challenging thing for the Rat. You are very particular and sometimes can be quite finicky, and timing is extremely important to you. Even if you met someone very compatible and fitting at a time you didn’t feel was appropriate, you might not give the relationship the time and attention it deserved. However, this year everything should fall into place quite nicely for single Rat people, and you may meet someone you find intriguing and exciting, but who also satisfies that need you have to do your own thing and have your own space. For Rat people who have a significant other, there may be a communication issue at some point this year that will, at first, create some distance between the two of you. But once you realize the weight of this issue, you can work at becoming closer and heating up your relationship, which could almost magically restore and further enhance your connection, reminding you of the happy early days when you just met.\n\nYes, dear Rat, this is your year and this is the year to dazzle! It should be both personally and professionally fulfilling. It will bring you experiences that you will keep in your heart and treasure for years to come. You will find yourself evolving in wonderful ways that enhance your enjoyment of life, and you will feel appreciation and gratitude for the people in your life. This Rat year will be incredibly special for you, bringing you many chances to make your most important dreams come true."
  },
  "rooster": {
    "content": "Cock-a-doodle-doo! This year, Rooster, you will wake up and find that the world is at your feet. Your wonderfully appealing qualities are to be especially recognized and admired in this Rat year. Your wholesome, bright-eyed approach to life will win you fans all year long, and your zest and ambition will draw in a wide variety of excellent opportunities. You are quick-minded and independent, so you are an excellent leader. You are also quite warm, likable, punctual, and bright, which will enable you to make great friends and foster useful connections. You should concentrate on following through on the chances that come your way this year. Although the Rat is not one of your most compatible signs, the energy you exude is, in general, highly compatible with Rat energy, the overall goals and approach to achieving them is quite similar.\n\nThis year, Rooster, you will have myriad chances to strut your stuff, so be sure your plumage is perfectly preened, because you know what they say about first impressions. That reminder probably isn’t even necessary for you, since you are ready to go at a moment’s notice anytime, and there is very little that can ruffle your feathers. In 2020, your ineffable appeal will be even more obvious, winning over even the most difficult prospects in both your personal and professional life. Many people will see you as something of a lucky charm since your irresistible energy and charm are known to ward off bad vibrations. Remaining positive is important always, but it is especially important this year. With an upbeat outlook, you can conquer the world and any dreams that are fermenting in your bright mind. Many people of your sign are politicians, diplomats, and public speakers of one form or another because you are the consummate communicator – you are capable of expressing yourself passionately, clearly, and with empathy. This ability of yours will come in handy anywhere you go and with anything you do. \n\nThis year in your work life or with matters related to your financial success, you can have the world on a string. Your natural charm is amplified and is extra high, and those who gravitate to you will like you naturally and will want to stand in good favor with you. This means you will have many opportunities pushed your way. This can be a very good thing for you, Rooster, but you must take extra care this year to be on the lookout for ulterior motives. Someone who offers you something may want something big in return – and it may be something that you are not willing to give. You should use your pretty evolved intuition in such situations. A chance related to travel and the broader world may come to you this year. This could be a very appealing venture for you if you are cautious about timing and you are well-acquainted with the fine print. Don’t take anyone at their word; be sure to do your own research and to be sure of whatever you decide to take on. Also this year, be sure to keep your cards close to the vest, allowing others in legal and money matters to reveal their cards and intentions before you show what you got yourself. This will help keep you informed and see the truth behind the façade more easily.\n\nIn friendships and in family matters, this could be a stellar year. But as good as it could be, it could also be difficult with a handful of people that have not posed a problem for you in the past. There may be some jealousy to deal with. There might also be someone – probably a family member – who may want in on something you are involved in. If you can’t make that happen, don’t feel bad about it. Just explain yourself thoroughly and express your regret, but be sure to do what is best for you. There could be multiple weddings or other important family announcements this year, and each gathering you choose to attend should bring you great joy and excitement. You may even be able to reconcile a long-standing difference with someone you care about this year. Just be your jovial self, and make it known that you are open to making peace.\n\nIn love, Rooster, this could be a year of thrilling events that will enhance your love life and bring out the best in you and your partner. One of your lessons to learn this year will be strengthening your own patience. This may be tested where your love life is concerned. Someone you love may go off on tangents you do not understand, so you can’t debate intelligently when things are not clear. Take the time to learn as much as you can so that you can converse clearly on the subjects that interest your loved one, which will reinforce your bond. Being humble, not generally your forte, will be important to your romantic relationships this year. You are someone with high self-esteem. However, your supreme confidence can sometimes come across as arrogance, so you have to find an equitable balance this year when expressing yourself. Someone could be put off if you don’t remain more grounded and modest. If you are single, you could meet someone who is quite compelling to you. And while you may want to rush into a serious relationship, the other party may not be quite ready for that. Once again, your patience will be tested, but if you work on being more patient, you should find this person to be worth waiting for. If you are attached, this could be a fun year with many amazing opportunities to socialize with your partner and to experience many moments of light-hearted enjoyment.\n\nYes, dazzling Rooster, this Rat year can be a very productive one for you. Work on being more laid back, less boastful and more patient. At the same time, make sure not to hide your very best qualities too. Your warmth will come through if you choose to mentor or offer advice to someone who could use your instruction. Since patience is sometimes an issue for you, being less impatient in all areas of your life will reinforce your other good qualities. You must also try to be less finicky this year, delving more deeply into the projects you choose to take on, even during moments when they are somewhat boring. If you work on remaining upbeat and on polishing your reputation and the way people perceive you in areas that could use that, this can really be a year to crow about!"
  },
  "snake": {
    "content": "Sleek and sexy, the primal appeal of the Snake is obvious, but the mystery associated with people of this sign may be somewhat intimidating because the unknown is frightening for many people. But what many don’t notice about the Snake people at first glance, is your sympathetic, soft-spoken nature and your extraordinary sense of humor. These things soften the idea of who you are for those who take the time to get to know you. You can also be quite shy at times. Snake people are usually very, very smart and also often possess a gift for writing, painting, music and other arts. The appeal of your talents also draws those with a love of the arts into your life. Your biggest weakness may be your inclination to be suspicious and paranoid, but this is something that you can improve through building trust slowly with the people you want in your life.\n\nIn some ways, your energies may clash with the driving forces of the Rat year. But you are by no means cursed or destined to have a bad time because of it. In fact, this can be an excellent year for you in terms of spiritual growth, building a strong reputation, improving things you don’t like about yourself, breaking habits, and improving your relationships. This can also be a successful year for you if you can be diligent in your efforts to succeed and if you can make yourself more easily approachable. These things can be achieved by persistent effort and the desire to make your life the stuff of your dreams. Yours is a rather sophisticated sign, dear Snake, and you may see ordinary, everyday obligations as beneath you at times. This year, you will have to get down to business by addressing all aspects of the projects you take on so that you can build empathy and better understanding for others in your life. Yes, these are lessons – but they are valuable lessons that will ultimately make your life everything that you believe it should be.\n\nWhen it comes to romance, the Snake is indeed a charmer and a very passionate lover. Snake people can be fickle in love, because they are often drawn to lovers based on carnal instincts or superficial attractions, not always getting the chance to get to properly know their romantic prospects deep enough. This year, you will need to work on getting in touch with your deeper emotional side. If you succeed at this, Snake, you will instantly enrich your love life – and your life in general will be far happier as a result as well. For those of you who are single, you may be struck by an intense attraction to someone new – someone who knows how to handle you and can help you to reach deeper within yourself to relate on a more sensory and emotional level. This may be love, but it may still take you quite some time to admit it to yourself. You must move at your own pace, and if you keep learning and growing, this could eventually be the one you want to be with. If you are attached, you may have had issues in the past with not sharing and communicating as well as you should have. But this year is a year you could use for growth in this area. Work on building a stronger relationship in the realm of friendship and putting that before your passionate desires. If you can have a better and stronger bond with your mate, the sexual attraction will be that much greater.\n\nIn your career this year, you may enjoy a series of consecutive successes. There could also be a minor increase in responsibility, but because this won’t be huge and won’t move quickly, this will give you the chance to build stronger relationships and a greater level of trust. These will be instrumental in future success. If you do have big aspirations with your career or with a business of your own, you may find that a mentor will enter your life this year – someone with vast experience and the right personality to work with you successfully. With money, there should be adequate finances for you in 2020, but despite your love of living well, you will need to make sure to live within your means. If you don’t, you could experience financial troubles down the road. You may want to put off any big or luxurious purchases. Unless something is absolutely needed, be very careful with your budget.\n\nWith personal growth, your efforts to perfect yourself and reach for your higher purpose will be rewarded well this year. Working to eliminate bad habits and to develop good habits will also place you in good stead in this Rat year. Engaging in a charitable pursuit of some kind throughout the year can help you build a greater understanding of others and help you tap into the kindness that resides in your soul. If you do your absolute best to become the person you are deep down inside, you will win admirers and new friends, and you will have a greater appreciation of even the smallest things in life that have the potential to bring you greater joy.\n\nThis year is all about learning and evolving for you, dear Snake, and if you learn your lessons well, you will not only be improving your life in the present moment, but you will also be building a far stronger foundation for your future. Every lesson that is sent to you this year is priceless and incredibly valuable in the big picture. Striving to always be your best self will certainly lead to success in business, in personal and work relationships, and of course, in your love and romantic life."
  },
  "tiger": {
    "content": "Whether you are purring like a cub or roaring like a fierce creature of the jungle, you are always a charming blend of ferocity, sweetness, bravery and playfulness. You are a constant contradiction, and it is irresistible. Tiger people are born lucky, and you often occupy roles of authority because your quiet strength invites confidence and trust. It is a mixture that is often successful for you, and this year will be no exception. In fact, Tiger, this year could be one of your best among the last few years.\n\nYour natural good luck will come into play in many ways this year. If you remain alert and highly aware of your surroundings and the people who will populate your life, you will recognize good opportunities the moment they arrive, and you will be able to transform these opportunities into actions that will bring you positive achievements and results. By being so aware, you will use the Rat energy of this year to the maximum, maximizing success in many areas of your life. You have great fortitude, dear Tiger, and this will also serve you well in a Rat year. Your resourcefulness will be important too because you will find a way to gather any resources you may need, as well as the appropriate guidance for whatever situation you may find yourself in, successfully tackling all the challenges that dare appear in your way. You will need to curb your tendency to be impetuous, however, and you will have to be careful not to overindulge – because in a year when frugality and the conscientious use of your resources is emphasized, such tendencies could work against you. Doing what you know in your heart is best will all but guarantee a successful 2020.\n\nYou could have an extraordinary number of good opportunities this year where your career and financial pursuits are concerned. The greatest emphasis for making important connections related to these positives will be on your social connections, Tiger. You are socially desirable in every way. Your sex appeal is obvious, and you draw others into your sphere quite easily with your easy, sensual charm. However, you must keep in mind that in all of your interactions, you need to use great discretion and wisdom and not to cross any lines. Being foolish in any of these pursuits could cost you a big opportunity. Just be cautious how you employ your appeal and charms whether intentionally or unintentionally. \n\nThere is great potential for financial gain this year. You may even reach some specific ambitious goal you have had in mind for a long time. With diligence and persistence, you can cover a lot of ground in many areas this year while blazing trails and making many excellent connections along the way. But always remain aware of how lucky you are and do not take your good fortune for granted, for what the universe gives, it can easily take away. So don’t get too comfortable and actively keep looking for and taking advantage of new opportunities.\n\nThere is no doubt about it, Tiger, yours is a sexy sign. This year, your healthy and vigorous appetite for love and romance will be satisfyingly quenched. If you are single and on the prowl for a new love, you are likely to find someone who rocks your world. You may even find that you are attracting way too much attention, and you may have to turn away and discourage some potential suitors who would do anything for a few moments of your time. Be judicious in who you choose to spend time with, because you could attract the wrong kind of person if you aren’t careful. But if you concentrate on what you are looking for in a mate and you don’t get distracted, you can find a great candidate this year. Attached Tiger people will also have a fulfilling year of amorous attraction. Your partner will be even more drawn to you than usual, and vice versa. This is definitely a year for making magic and forming closer communion with the one you love. Your other relationships – friendships and family relationships – will be stronger this year due to greater clarity and communication in the way you express yourself. All in all, this could be a very positive and productive year where all of your relationships are concerned.\n\nThis year, be sure to remain humble and very aware of the good that has come into your life. Even if the blessings that you have received are small, you should be grateful for them. Although the Rat energy brings your own love of luxury and opulence into the light, you shouldn’t dwell too long or too specifically on tangible gain. Even though you will have several chances to pad your bank account and to live a more comfortable and even luxurious life, you need to pay close attention to being humanitarian and to expressing your kindness in every way that you can. Send loving vibrations out into the universe to show your gratitude for all of the good things that are flowing into your life this year. That way, you will be able to better enjoy the finer things life presents you with, but you will also gain a great sense of personal fulfillment from the goodness you exude and share with others."
  }
}