{
  "dog": {
    "content": "The Dog and the Rooster couldn't be more different from each other. Where the Rooster craves attention and the spotlight; the Dog seeks solitude and quiet. Where the Rooster is impressed by and appreciates money and luxuries, the Dog mostly prefers a low key serene home life with people he can love and trust. This Rooster year may be quite challenging for people born in the year of the Dog, but it can also be quite fulfilling and successful, and it can inspire the Dog to reach beyond former self-imposed limitations. For example, the Rooster energy can inspire the usually shy and self-effacing Dog to be more outgoing, more assertive, and more confident. Last year was probably slightly better for the Dog than few previous years had been, but 2017 has the potential to be even better.\n \nThe first thing you must keep in mind is to lift yourself up and to remain in a positive frame of mind. This is sometimes a challenge for Dog people, but hopefully last year you evolved to the point of recognizing that you are in control of your own mood and the words you speak, and the outcomes you hope for are largely within your own control. You will have good practice pretty early in the new year when a challenge pops up. This will not be a calamity, but it will require some awkward intervention on your part. Look at it practically, and deal with it practically, but don't allow your imagination to carry you off in a negative direction. Prove to yourself - and to everyone else - that you are in full charge of your emotions.\n \nThe Dog will have many small victories in the beginning of 2017. This will surely lift your spirits, but don't become complacent thinking that everything will be easy, and that you can just relax and let life roll along. You will need to use your determination and your imagination to keep your lucky streak going, and it will keep going if only you nurture it. Your love life is a good example, Dog. You will meet an array of interesting romantic prospects starting in March and maybe even sooner, if you are single. Since you are likely longing for a beautiful love affair that will last forever, this will give you hope. One by one, though, you may begin to see reasons why one person after another is not right for you. However, by June or July you could meet someone who is the answer to your dreams. This person could capture your heart quickly, and could become a big part of your life just as fast. If the feeling is mutual, you could wind up engaged and then married very quickly if you choose to do so. For attached Dogs, your romance with your significant other will be sweeter than ever. This will be a year that will pose challenges to you and when you receive support from your partner, you will start seeing new, deeper facets of this relationship. You know of course, that your partner will support you, but when you actually experience it, you will understand. Nurture this relationship with flowers, sweet nothings whispered, and all the attention and devotion you can muster. Your efforts will be rewarded in kind. \n \nBecause your family is such a huge part of your life, Dog, you are always caught up in the emotions that come from your family connections. When your loved ones are in good places, you are happy. When your loved ones are struggling, you struggle too. This could be said for most people, perhaps, but for you, it is magnified times ten. There were some high emotions happening in your family as 2016 ended, and it will continue sending waves into 2017, but only for a limited time. Then it will settle down, and good things will begin to happen. There will be an outstanding announcement around March that will make everyone happy and proud. Later in the year, around July, there will be another announcement, and it may involve you in at least a small way - that will inspire everyone and bring great joy to your family members. Throughout the year, there will be more good than anything, so always remember to be grateful for your blessings.\n \nYour work life may have had some concerns throughout 2016, Dog, and that may carry through into the first months of this year. You could become stressed, anxious, and worried about your future, especially financially. You may have some debt you would like to pay off, and you may be concerned about bringing money in. However, an outstanding development could occur around March. While money may not flow in instantly, this development will offer a future promise of improvement in your financials. This knowledge alone will help you to coast through happily until everything comes to fruition. This will probably be the result of some creative venture you poured your heart and soul into, and it will feel really great to finally see it bear its fruit, as well as very validating!\n \nAs long as you remain loyal, hard-working, self-driven; and do your best to reach beyond your previous self-imposed limitations, 2017 will be a spectacular year for you. You will gain recognition that you have long deserved, you will reap rewards for which you've paid the dues, and you will revel in finally being in the place you were meant to be."
  },
  "dragon": {
    "content": "Dragon year is considered to be the best year to be born into and while you are one of the luckiest signs, Dragon, you may have questioned that at times over the last year. There were moments when you felt anything but lucky. Still, you persevered - as you are known to do - and you came out ahead despite the obstacles you faced. The year 2017 is the year of the Rooster, and that means you will be favored in everything you do. As far as compatibility with the Rooster goes, you and the Rooster are perhaps one of the best matches possible. You have a deep understanding of each other. You are kindred spirits. How will that translate to your year in 2017? You could feel as if there are guardian angels watching over you. 2017 shall be a great year for you that will bring out the very best in you.\n \nOne of the things you have hopefully been working on to better yourself is your fire-breathing temper. You have learned to be calmer, quieter, and to move with grace and caution. While you are very passionate and emotional and you still have your fire-some tendencies, you have learned to approach opportunities with greater reserve. This will be good for you this year. The chances you encounter will require patience, fortitude, and discerning judgment. It is as if you have distilled your finer qualities down into a powerful potion that makes you capable of anything, and this year you will have the chance to use that potion to your greatest advantage.\n \nAs for your love life, Dragon, you may have struggled with issues related to control and idealized your views of what a relationship should be. That may have been difficult for you in 2016, and since it probably was not fully resolved last year you will struggle with it again this year if you don't choose to do something about it. You cannot always run the show, even though you may feel you are naturally the one to guide your relationships in the right direction. You have to work on compromising this year. After all, if you truly love someone, then you want them to be happy and have a say as well. Single dragons may meet someone this year who will challenge you on this front. This person you will meet will be very strong and well-spoken, and will be able to express to you what you've been doing wrong, and can guide you in how to adjust your ways. If you listen, this could be a very fulfilling relationship. It will likely move slowly into the next year without a major commitment, but if you continue to evolve, it could become permanent in 2018. For attached Dragons, you will have to learn to adapt to your partner's way of doing things and be more open to their ideas and feedback. If your partner has a strong personality, this will happen more quickly. But if it is up to you to regulate it, you will need to really want to change to make this happen. If you manage to pull that off, the rewards will be worth the effort.\n \nIn your work or your business, you are fierce, ambitious, driven, innovative, and sometimes even eccentric. There is something almost magical about you, and you have the potential to be anything you want to be. You are forward-thinking and visionary, and this is where the Rooster's influence over 2017 will have special effects in your life. You are a master of showmanship, and you will have several opportunities this year to show off your edgy, unusual, and outstanding ideas and ways of working. Others will learn from you in 2017. Just remember that you should only add drama when it is truly called for, and to fade into the scenery when you are planning your next moves.\n \nFamily relationships may be put to the test. You may have ended last year in a power struggle with someone who is a strong member of your family. You two either butt heads often or to the contrary - normally you get along very well but you had an unexpected fallout. In any case, your relationship may have become very conflicted. Since this is someone who is important to you - or at least important to people who are important to you - you will need to find a way to make this relationship work.\n \nThere will be many lessons in compromise for you this year, Dragon - in love, in family relationships, and in business. If you try to maintain a fine balance between honoring your strong, decisive, powerful personality and being more graceful, reserved, and thoughtful, you can make great strides in every area of life. You are in a growing phase, but you will also have many chances at deep enrichment and abundance in 2017."
  },
  "general": {
    "content": "Welcome to 2017, the year of the Fire Rooster - and what a year it will be! Meticulous, punctual, entertaining and extremely well-organized, the flamboyant Rooster has it all. A rooster in the barnyard will strut, preen, and generally attract as much attention as possible, and people born in the year of the Rooster are very much the same! Just as their namesake crows at the crack of dawn, Rooster people believe that the early bird gets the worm, and this philosophy drives much of their personality - and much of the mood of the year ahead.\n \nRoosters are productive and disciplined, but they also know how to have fun, and that blend of qualities will mark the tone of 2017 for all signs. When you add the element of Fire into the mix, you have the potential for a year that is energized and auspicious, and is marked by inner warmth and insight. The year ahead will be all about order, productivity, ambition, and prosperity for those who choose to see their dreams through to the end.\n \nIn 2017, triumph and success can be achieved through patience, determination, and hard work. People who work in the fields of administration - both public and private, the military, and the police force will be especially favored this year. With a great emphasis on working diligently, this is a year when questionable shortcuts like some of the \"get-rich-quick\" schemes are probably a waste of time, and opportunities that appear too good to be true, probably are. Brilliant, sweeping success is often a hallmark of a Rooster year, but usually only for those who have already been working hard for a long time and have paid their dues. Those who fit this description may finally realize their dreams after putting in a lot of time and effort.\n \nIn 2017, as in most Rooster years, there could be quite a few unusual sensational events. There may be unorthodox new celebrities who will wind up in the headlines, but their careers are usually like shooting stars that light up the night and then disappear quickly. There may be a lot of new trends focused on appearance and prestige, but they will also fade pretty quickly as all fads do. While there will likely be a lot to talk about in this Rooster year, the foundation of it is actually quite solid and sensible. For those who are willing to pour their heart and soul into whatever they want out of life, they will be rewarded with the resources and the luck they need to succeed. This year those with a good sense of humor will be favored, as will those who aren't afraid of the spotlight or of speaking their mind. So for those folks of any sign who are willing to stand up and be counted, this can be an excellent year.",
    "year_element": "Fire",
    "year_sign": "Rooster"
  },
  "horse": {
    "content": "You are the free spirit of the zodiac, Horse. You represent freedom, passion, and an unbridled love of life. Like a wild Mustang, Horse people are perpetually in motion. That doesn't necessarily mean that you are restless; it just means that you are someone who must always be engaged in doing something you love, or finding a way to survive. During this Rooster year, you will be able to show off your greatest talents and assets, and you will certainly have the right opportunities to do so. When it comes to work - you are a workhorse, which is something the Rooster admires, and the influence of this year will spur you on to some of your bigger dreams. You can't just run wild though; you need to strategize and finesse your plans.\n \nYou are also a gregarious and outgoing person, and so this year your ability to network and socialize could help you to make connections to some pretty important and/or influential people. Sometimes you tend to be flirtatious and ungrounded, but the Rooster's influence this year will calm you and help you to be more reserved and conservative when it's important to be that way. Even though you will have to approach new people and new opportunities in a more laid-back way, you shouldn't try to tame your wild spirit because that wild spirit can be very appealing in some of the situations you would find yourself in. While it may seem difficult to balance your wild side with a more grounded approach to life, it will come easier as you get used to it. Because you are someone who must keep moving, you sometimes move in the wrong direction just to keep going. The Rooster's influence this year will help you modify that tendency in 2017.\n \nLast year, you may have worked hard at being more focused on your goals, and because none of us is getting any younger, having a plan for today and for the future is always a wise way to go. While you do need to be flexible, of course, you also have to be more inclined to strategize. Having a plan may not be something you are used to, but as you become more adept at planning, you will see that it makes your life easier, more purposeful, and more open to possibility.\n \nMany people born in the year of the Horse have had rather tumultuous love lives. That is partly because the idea of being committed to one person can seem oppressive or claustrophobic to them. Horse people take their freedom seriously, and the thought of having to answer to someone may seem too restrictive. At the same time, you make a wonderful partner when you are with someone who shares your sense of humor and your interests. You are fun to be with, and you enjoy the camaraderie that can come from someone who understands you. Your love life this year may be very different from ever before. If you're single, you could feel even less inclined to seek out someone who could offer a lasting relationship. But you may wind up flirting with someone who is able to make you suddenly feel inclined to settle down. This person will have a free spirit as well, but will be more tuned to domesticity while also allowing you to be your true self. This could evolve into a long-term committed relationship. If you're attached, you may struggle with your relationship in the early part of the year. You may think that the person you are involved with doesn't understand you well enough, or puts too much pressure on you to conform to their expectations. But if you stick it out and work through it, you can express your need for more freedom, and you could wind up making your relationship stronger.\n \nWith regards to your family life, someone in your immediate family circle may have been pressuring you to be more ambitious and more focused. The changes you have made in yourself will be quite pleasing to this person, and you may begin to see this relative as someone who can mentor you. You'd be wise to listen to this person's advice because it could propel you toward a big dream that you hadn't dared to attempt in the past. Your career could also become very strong this year. You will need to work at laying a foundation by determining your destination, and once you feel more secure in your chosen career path, you will begin to move ahead quickly. The further you go, the faster you will go, and that will certainly appeal to you and will drive you to progress even faster.\n \nThis year will be like a meandering path for you, Horse. You have an innate ability to sense danger, but you also have the ability to sense opportunity. Once you gear yourself that way, you will be more tuned in to the prosperity and abundance that you would love to attain. Stay true to your wild spirit, but work at grounding yourself in 2017. This will have a stabilizing affect on your love life, your work life, and really every other aspect of your life."
  },
  "monkey": {
    "content": "You may still be exhausted from all the fun and frivolity you experienced last year, Monkey. By the end of the year, you were probably ready to slow down and adjust to a more carefree pace. In 2017, the pace will be considerably slower, but that's not a bad thing. You hopefully got your fill of the craziness for a while, and now you are ready to settle down and concentrate on your future. Don't worry - that doesn't mean you won't have plenty of fun too. However, your primary focus this year will be on working toward what you want, and proving yourself.\n \nIf you want the universe to shine on you this year, Monkey, keep in mind that you can reap wonderful rewards by emulating Rooster traits, such as hard work, showmanship, loyalty, commitment, family values, and impeccable grooming. You are shrewd enough to know how to capitalize on the chance to mold yourself into precisely what the universe wants of you. If you do, good karma will shower down upon you. And while there are wondrous blessings to be scooped up, Monkey, you need to make the most of this auspicious period. You had many chances last year to right wrongs and to heal rifts, and hopefully you took advantage of those opportunities. If you did, then you will be all the more centered and strong as the year begins, and you will have the support of family and friends to empower you. You need to allow this trend to continue because it will always benefit you throughout your life.\n \nYou are someone who is easily tempted, Monkey, because your curiosity often wins out. You are naturally inclined to explore the things that mystify you or intrigue you because you love the challenge those things present to you. You will need to be on guard this year. Too much indulgence in curious occurrences could distract you from your more important missions. One such occurrence could involve a family member, and you could wind up leading this person into a troublesome situation that will be over their head. Be careful at every turn not to take bigger risks than you can handle, and certainly avoid leading loved ones into anything that they are not equipped to deal with. This could backfire on you in a big way. You must continue to use your intuition to guide you rather than listening to the overly adventurous advice from the little \"devil\" that sits on your shoulder and tends to occasionally stir things up by whispering in your ear. When you are able to discern the difference between your sixth sense and this \"devil\" on your shoulder, you will be far more disciplined, more in charge of your life, and therefore much more successful.\n \nYour love life could really bloom this year, Monkey. People born in the year of the Monkey tend to play the field when it comes to romance, and tend to settle down and marry later in life. You like to know what's out there, and you don't like to be tied down prematurely. You don't like someone who will be pushy, who will impose restrictions on you, or who will ask you too many questions. When someone pushes you, you tend to run. If you haven't settled down yet, it may be because you haven't yet met someone who will love you wholeheartedly, but who won't try to manipulate you in any way whether on purpose or not. If single, you could meet someone who is a free spirit around August, but be careful what you wish for. While there may not be any limits put on you, you won't be able to impose limits either, and this could lead you to feel jealous and lacking control. But if you give this person the same freedoms you expect in return without getting jealous, it could work. If you are attached, you could experience issues of control with your partner. It could be the same old argument about limitations, and you need to convey to this person kindly and calmly that while you intend to be faithful, you don't want to be fenced in. If you can mutually agree to give each other the space and the nurturing you each require, your love could grow stronger this year.\n \nIn business, you may be eager to move ahead quickly, but your success may evolve slowly. You can't rush this, unfortunately, and if you try, you could be seen as reckless or undeserving of promotions or opportunities. You need to be patient, to pay your dues, to be willing to learn, and to show discipline and commitment if you are to succeed in the big way you aspire to. An extraordinary opportunity could be offered to you through a connection you made many years ago, and it will come seemingly out of the blue just about when the second half of the year starts. If you choose to accept it, just make sure that every element of the deal is clearly spelled out so that there are no surprises or misunderstandings, and so that everyone understands their role.\n \nDo you want a successful 2017, Monkey? Of course you do, and it is within your power to have exactly what you want. However, to do so, you will need to exercise great discipline and loyalty to your goals. Everyone must grow up - even you - the playful Monkey. Maturity means understanding that you have to conform to certain rules, but that you can also have fun and engage in harmless mischief when it doesn't interfere with your path. You are in a good place now, Monkey. You are on the precipice of a new beginning and a happy future. Summon your courage and commit yourself to the ideals and the dreams that mean so much to you."
  },
  "ox": {
    "content": "Last year may have had many ups and downs for you. It was a Monkey year, and possibly not the most auspicious one for your sign. However, dear Ox, your tireless work ethic, your stalwart determination, your reliable nature, and your trustworthy code are all qualities that will be honored much higher and rewarded much better during this Rooster year. That means that if you stay true to your nature - and you surely should - you can have a year that is successful both personally and professionally. You may be having a hard time shrugging off the disappointments you faced last year because it comes easy for you to blame yourself, but blame is pointless. The odds were stacked against you in some areas of your life, but the tables are turning now. You must let go of old regrets and look ahead with optimism and enthusiasm.\n\nYou are excellent at networking and maintaining connections because you love the social aspect of that dynamic. You have hopefully stayed in touch and nurtured some of the more powerful connections you've made over the last few years because you will be able to put them to good use in 2017. If you already have a game plan for your work life or your own business, all the better, because there will be many chances for advancement and expansion. But even if you don't, you can use your recent experience to put together a plan that will help you navigate through the opportunities that will be coming to you soon.\n\nYou probably made progress with some of your goals last year, but it may not have been all you envisioned and hoped for, and it probably didn't measure up to your expectations, which were pretty high. This year, however, it will seem that your trajectory is moving very quickly, and you will move ahead by leaps and bounds. When you compare the struggles you faced last year with the rapid progress you will make this year, it will seem like you did far less work for far more gain. Being such a hard worker, it will almost seem like getting something for nothing, but keep in mind that you have already put in a lot of the ground work and you've paid your dues.\n\nYour social life in 2016 could have been somewhat unsatisfying, partly because you were stressed and exhausted from many of the other issues that you had to deal with. Your personal life could also suffer because your work life was quite saturated and you were struggling. You may have carried some of that leftover anxiety into this year, but it will quickly dispel once you see how well things are working out for you. When you start to feel more relaxed, your social life and your romantic life will begin to pick up and become more enjoyable too. You will start this year in a serious work mode, but there will likely be several nice invitations that will help to keep you socially active, which is a good thing. Your work life and your personal life will feed off each other. Your work success will produce good vibes, which in turn, will create good energy for your social life.\n\nIf you are a single Ox, a good friend may introduce you to someone special, and that person could quickly become very important in your life. Although you may also meet many potential love interests at your various social activities, that one person will stand out from all the rest, and you won't want to spend time with any other possible partner. Although this relationship won't progress at lightning speed, it could feel fast for you. For most already attached people born in the year of the Ox, you can expect a reawakening and recognition that this person is the single most important person to you in the world, and your love life will heat up considerably.\n\nIf you stay true to your hard-working nature, your naturally honest approach to life, your ambitious dedication to your goals, and your reliably consistent approach to life, this year's Rooster energy will create the perfect environment for you to thrive and to experience great success and personal fulfillment."
  },
  "pig": {
    "content": "You are generous to a fault, Pig, and you may have been taken advantage of more than once in 2016. That's because you are so trusting and so certain of the benevolence of mankind that you always tend to give the benefit of the doubt, and you trust until there is a reason not to trust any longer, and then you sometimes trust some more. That's not a bad way to be, despite the fact that it occasionally backfires on you. Even so, when you are hurt, you hurt deeply. You may have had an incident that hurt you toward the end of last year, and you may still be singing the blues. But that won't last long. Once you get into the swing of this new year, the moods will change palpably. It may be a cliche to start a new year with a fresh page, but this actually could be the very best thing you could do for yourself this year. \n \nThis is a Rooster year, and you do have many traits and qualities the Rooster admires. You are stable, sincere, hard-working, determined, and you value your friendships highly. All of these aspects will benefit you in 2017. As soon as the year begins, you will feel your mood grow more vibrant and happy, and you will be ready to take on the world. Right from the starting gate, there will be opportunities that will thrill you because of how incredibly perfect they are for you, and how much they match your interests and your goals. With only a few smaller bumps and emotional bruises to deal with, the vast majority of 2017 will be to your liking, Pig. You are generally far more down-to-earth than the flamboyant Rooster, but you will take more of an interest in your appearance this year than usual. That may be because you are in a celebratory mood most of the time, and you will want to dive into the spirit of it.\n \nBecause you value your friends and your family members so wholeheartedly, they are, likewise, always going to be there for you. If you ever need help, support, advice, or guidance this year, they will rush to your rescue and help you save the day. Not that you need saving very often, Pig - you are incredibly capable of handling any challenges you face, but it is nice to have a backup when you're feeling challenged, even if it's just for moral support. And your family and friendships will be a great source of pleasure, joy, and comfort all year long. You may choose to take on some new career ventures and you will have your own personal cheering gallery to encourage you. A long-time personal friend may enlist your assistance around April to explore an interesting opportunity that has the potential to grow into something pretty big, and this could be quite exciting. And while you may start out just as a mentor and guide, you could soon become deeply involved yourself. This could be a life-changing beginning, Pig.\n\nPeople born in the year of the Pig tend to be die-hard romantics. When you meet the person of your dreams, it is often commitment for life. We can't always control the outcome of a romance, however, and when a relationship doesn't work out, you tend to pine away because you are at your best when you are in a committed situation. If you are single now, it is probably because some union did not work out, which means you are likely looking again. It might be best, however, to give yourself some time for introspection rather than jumping right into something else. That way you will make a more balanced choice. You sometimes jump into things because you have a longing for love, but that can cloud your judgment at times. If you are patient with yourself, you will find someone later in the year who could fulfill your dreams of the perfect happily-ever-after ending. For attached Pigs, your love life should go along swimmingly this year. If your partner is as devoted to the relationship as you are, it will be especially rewarding with many chances to share alone time together in romantic places. Indulge to your heart's content!\n \nJust as you are true, loyal, and committed in your personal relationships, you are as true, loyal, and committed in your work. You excel in careers that require deep commitment, lots of study, and a profound sense of compassion and empathy. If you haven't found just the right career yet, Pig, this year could be the year to do that as you will have the chance to explore many possibilities. If you postponed schooling, this would be a good year to consider continuing and furthering your education. With the abundance of paid and free online classes for almost any topic and professional niche, and with the flexible schedule it provides, it has never been easier to learn new things. If you are in school, you may want to take an unexpected class or change your path or to learn more about an area that intrigues you. Whatever you do, however, you will be able to lay a rich foundation for the future of your career, and success will surely follow. If you are in business for yourself, or if you have a powerful role working for someone else, a close friend or family member may come to you for a networking connection. Be very careful about making any promises to this person. You must first assess whether this person will be able to live up to your ideals and will honor your work ethic. If you aren't sure of this, offer guidance, but don't put your own career at risk by putting your reputation on the line for that person.\n \nThis year is set to be extremely rewarding - both personally and professionally. You should enjoy outstanding relationships, a rewarding love life, time to indulge in many of your own personal interests, and you will have good luck with many of the other things that are meaningful and important to you. You may feel that in the recent few years you were not as lucky, or in other words, not as predispositioned for success. Luck will be with you in full force this year. All you need to do is to be ready to take advantage of every opportunity that comes your way. The key to being truly happy this year is to live in the moment, and you are certainly good at that."
  },
  "rabbit": {
    "content": "You can be quiet and shy and reserved, Rabbit, just like the gentle forest animal ruling the year you were born into. Last year, the energy of the Monkey has often forced you out of your comfort zone and inspired you to be more social and more courageous. You can still be timid because that is part of your nature, but you have learned to be more outgoing than you were before. This year, the influence of the Rooster will further encourage and inspire you to be more outgoing and less afraid to call attention to yourself when you have something to say or something to show off. This is good because these abilities will enhance the chances for success in many areas of your life.\n \nYou are a home-oriented, warm, inviting person with many friends, Rabbit. Your family members adore you too, and you tend to be the one everyone comes to when they need advice or comfort. Last year you may have dried a lot of tears, encouraged many people to pursue their dreams and otherwise helped around with advice or actual action. This year, you will receive support, love and nurturing from everyone who loves you. This year should be all about you, and you shouldn't feel awkward accepting kindness from loved ones or even from strangers because you deserve it. In 2017, at every turn, there will be someone there to provide whatever you need - and it will be just the right person too. You would simply need to stop for a minute and look around and the right opportunity and/or person would show up. There will still be those who will show up at your door with a need for soothing and a good motivating speech, but this year you will be the center of attention most of the time. That may not be a spot you're comfortable with, but it will do you good to soak up all that love and attention, Rabbit.\n \nWhen it comes to your romantic life, Rabbit, you can expect the same lovely attention, admiration, and nurture that you have always given. You tend to attract takers at times because they can sense your giving nature, and they can see that you would give anything for someone you love. This year, however - if you are unattached - you can expect to draw a completely different kind of person into your life. This will be someone who will be as giving as you, and will go above and beyond to make you happy. If you are in the right place for a lasting relationship, this could be a very good person to grow old with. For Rabbits who have a significant other, you could find that your mate is suddenly and increasingly more attentive, and this will be a lasting affect that will cause your relationship to grow closer, stronger, more beautiful and enjoyable in every way. Keep in mind though, that you should continue to keep the fire burning to maintain this happy state. If by chance your significant other is not very attentive, use your creativity to find ways to bring your lover closer and to reignite the flame.\n \nYou are a very sensitive soul, and very empathic to the people around you. That's why when someone comes to you with a problem that brings them to tears, it may affect you in a powerful way. Don't allow issues like this to drag you down. If you wish to help, do so with a light heart and an optimistic outlook because this will be something that you can help this person to resolve in a perfect way. If you stress over it too, you will only drag down your own emotional balance, and you won't be as effective at helping the other person. But if you think about it happily, as though you are certain of a good outcome, you will draw good energy to you and you will find a solution very quickly.\n \nThere could be a few hurdles to leap over in a family matter this year, but that's not a major feat for you. Like the symbol of your year, you have the ability to leap over obstacles with power and grace and land gently on the other side. Someone in your family could have an important announcement around June, and this will be something that will set your own heart aflutter and make you feel incredibly happy. This event - which could be as big as a new baby or an impending marriage - will bring great joy to you and yours for the rest of the year.\n \nIn your career or your business, Rabbit, the magic of the Rooster's influence will make you bolder and braver when it comes to trying new things, breaking through old limitations, and soaring to new creative heights. You will feel more confident in yourself and in your ideas, and it will show. For any important endeavors, summon your courage and your showmanship and don't be afraid to show off what you've got. Your talents will be in the spotlight, and you will have plenty to be proud of. This could be a financially abundant year for you if you aren't afraid to step into the spotlight at the right moments."
  },
  "ram": {
    "content": "Despite your strength, your courage, and your impressive appearance, you are a surprisingly sensitive sign. You are very down-to-earth, but at the same time you are highly tuned in aesthetically. You love an elegant home, the arts, and you are inclined toward luxurious living. In this Rooster year, you will have many more opportunities to indulge in your love of the fine things. That could mean more chances to enjoy the arts, more money to make your life more luxurious, and more abundance in general. Since your work ethic is in line with that of the Rooster, you will be rewarded with the connections and resources you need to feather your nest in style.\n \nWhen you have something to say, Ram, you don't always feel articulate and you sometimes have trouble expressing yourself. In 2017, however, the Rooster will help you find your voice. If there is a cause you are passionate about, or something important you have to say in any area, the Rooster energy will empower you to do so. In fact, throughout this year, you will get a tremendous amount of experience in expressing yourself beautifully, and you will carry this with you into the future. This will help you build your confidence, and it will help you make your dreams come true in so many ways.\n \nIn 2016, you had a pretty balanced year, and you may have a sense of apprehension as you enter 2017. This is natural for you because most Ram people aren't fond of change. Someone might assume that a Ram would not do well in a Rooster year. After all, the Rooster has a great love of being in the spotlight, while you are mostly shy and retiring. But there is a balance there that will benefit you, and you will have many chances to step outside of your comfort zone in 2017, and prove to yourself that you can do things you never thought you could do. This will be a year of evolution for you, and as you evolve, you will recognize how special your talents are. When you begin to see how talented you are, you will feel more courageous and more empowered to make your dreams come true.\n \nYou will have a chance this year to fulfill a heartfelt goal. This will probably involve the use of a talent you have that you haven't shared with many people. You will feel more inspired to delve into this talent and to practice it, and you will then have the courage to begin showing your work to others. You can expect rave reviews, Ram, and you will discover that this could actually be a way for you to make money. Chances to do so using this talent are likely to materialize for you in the second half of the year.\n \nYou may have had some troubles in your love life in 2016, Ram, and depending on how they were handled, you either left the year feeling content, or you left it feeling like you'd been hit by a freight train. Either way, the early part of the year will give you multiple chances to heal any rifts, and to get your love life back on track. For most single Rams, the road to love will be long and meandering this year. You may have a few things to learn about yourself before you can choose a proper mate. You tend to be drawn to external beauty, but as you know, it is only skin deep. While everyone seeks a person they find attractive, you have to learn that beauty is as beauty does. While what's inside someone is very important to you, you tend to assign qualities to attractive people based on your first impressions. Once you begin to look deeper, you will find someone to love forever. For attached Rams, this will be a warm and loving year for your union as long as you appreciate your mate, and you show it.\n \nYour family relationships are rich with promise this year, Ram. You should enjoy wonderful times and make many happy memories with your loved ones in 2017. There could even be a few surprises that include amazing accomplishments, births or marriages in mid-year, and a reunion with someone special that you haven't seen in ages. Make a point of staying connected to those you feel closest to because it is easy to drift apart and to lose track of loved ones in this fast-paced world. If you feel inspired to do so, why not try to plan a family reunion that will allow you to catch up with everyone and share all of your news. This will be a great year to spread the love!\n \nThis year offers you good friendships, strong family relationships, chances to express yourself, and opportunities to indulge in your favorite interests. There is amazing potential here for a fabulous year with many personal and professional rewards. Work at polishing your self-expression and being more comfortable exploring whatever is new and interesting to you. The Rooster energy will give you the edge you need to be courageous and devoted to your dreams in 2017, so make the most of It, Ram!"
  },
  "rat": {
    "content": "The Rat and the Rooster are very different creatures, but that doesn't mean that a Rat can't thrive in a Rooster year. Hopefully, you emerged from last year feeling strong and confident. Hopefully you devoted time to perfecting your natural talents, and you began to realize what you want the most out of your life. If you are feeling ambitious and ready to take on the world, this Rooster year will favor you because ambition, drive and success are the key elements. Like the Rooster, you have big dreams for your life, and that is a great place to start.\n\nYou are a fast thinker with a lot of energy, and you are certainly shrewd. If you want to succeed in 2017, however, you will need to make sure that everything you do is above-board, because the Rooster influence demands honesty, fairness, and justice. Any sleight of hand or underhanded schemes are prone to backfire. You have incredible physical and mental energy, Rat. You are always thinking and you find it hard to sit still. If you can channel that incredible energy in a positive way as you work toward your goals, you will have many auspicious opportunities. If a chance to get ahead creates a moral dilemma, then avoid it at all costs. Always choose the high road or you may wind up regretting it.\n\nAlthough you are very gregarious and the life of the party at times, you tend to be clannish, preferring to stick to the social groups that you have already established. Thanks to the influence of the Rooster, this year you are encouraged to step out more into social situations that may take you out of your comfort zone. Try to emulate the flamboyant Rooster. Accept invitations you might not otherwise accept, and step into new social situations with confidence and bravado. It may be challenging at first, but it will help you to branch out and meet new and different people. You will also be able to make exciting new connections that could help you out in your quest for success.\n\nIf last year seemed to be slow-moving or even stagnant where your finances were concerned, this year will offer you many opportunities to increase your financial status and improve your material life. As long as you continue to work hard, to work honestly, and to stay true to your goals, you will have auspicious good fortune at every turn throughout this year.\n\nAlthough you will be very caught up in your ambitious goals and dreams this year, you should make a point of making time for love and romance because those things are always important, and they will always enhance every other area of your life as well. If you have been involved in a relationship for quite some time, you need to recognize that this too needs your nurturing and attention. If possible, involve your lover in your plans and let your partner contribute in whatever way they can - even if it's just in offering you feedback or support. For those Rats who are unattached, you may be so immersed in your goals that you will avoid chances to meet that someone special. But if you purposely take the time to get out and socialize in places where you could meet someone who shares your interests and your values, you may just encounter someone who will motivate and inspire you. Don't ignore your love life because it will enrich your life in ways that material pleasures can never do.\n\nIf you honor your dreams and work hard to deal with whatever challenges you face, and if you deal with everyone you meet in an honorable way, you can make at least a few of your dreams come true this year. If you balance your ambition by also nurturing your personal relationships, you will have a year that is filled with achievement, joy, and a sense of fulfillment that you may not have experienced for a long time."
  },
  "rooster": {
    "content": "You do love having a place in the spotlight, Rooster, and this year will offer you plenty of time to shine like the dazzling star you are. You are the early bird - always the first to reach for an opportunity - and your assertive style in pursuing your goals helped you to build a lot of momentum last year in many areas of your life. Because 2016 was a Fire Monkey year, you hopefully learned to loosen up on your regimented ways a bit, to be more carefree, and to enjoy life more. In the year of the Rooster, there will be abundance and opportunity, but it won't all be easy. You will need to call on your organizational skills and your ability to manage complex situations; and you will also need to tap into the spirit of fun within you to be as successful as you can be.\n \nYou dealt with a lot of frantic energy last year. You normally prefer more measured situations where you can control and predict what's happening. But that was good practice for you. You have become more flexible and better at compromising when necessary. Although you are very oriented toward appearances and you always will be, you have learned to look deeper into people and situations before you begin to evaluate. You have many talents, Rooster, but you have a need to be constantly praised in order to feel validated and appreciated. This year, you will need to work on being happier without the constant support of someone else, and to look inward for fulfillment.\n \nIn love, the Rooster tends to be drawn to dramatic partners who will share the spotlight. Even though you have learned to look for more substance than flash, you are still attracted to head-turning, flamboyant, exciting partners who help to fulfill your need to be noticed. If you are already with someone who's a bit more understated, or maybe someone like that has come along recently﹘or will soon﹘ who doesn't quite fit your usual style, you should take another look. On the outside, this person may be rather unassuming in their dress and style, and they may even be somewhat shy and reserved. However, Rooster, this person may be dazzling in other ways. You may find this person to be quite intriguing intellectually or because of some amazing talent they possess. If this is a new relationship, it could take off very quickly and could become very serious and committed very soon. You may even be looking at marriage plans by the end of the year. If this is someone you are already in a relationship with, you will find things to be dazzled by and proud of as 2017 progresses. You will learn more about your partner - even if you have been together for many years. Your discoveries about this person could lead to a rekindling of your passion for each other, heightening your romantic life significantly.\n \nIn your career, Rooster - whether you have your own business or you work for someone else - you tend to wear many hats. Your talents are numerous and varied, and you love the excitement of pulling off amazing feats. You love the challenge of moving from one goal to the next and mastering various aspects of your work. You will find yourself feeling extraordinarily motivated this year, and the force will be with you. In all areas of business, you will have the magic touch, turning small opportunities into huge successes, and turning disappointments into possibilities. Whatever you wind up doing though, you will almost certainly see an increase in your income. You may choose to reinvest whatever extra you earn back into your work so that you can grow your business or advance your education. Be sure to pay extra attention to your financial records, Rooster. Not only should you check to make sure that there are no mistakes or forgotten entries, but you must also make sure that no one is misusing funds or embezzling, as there may be a risk of that this year. Stay on top of your efforts - something you do naturally anyway - and you could wind up significantly advancing your financials this year.\n \nAs far as family is concerned. In 2017, you will notice a far more harmonious ambience with respect to family matters. Even though there may have been a rift among family members last year, or some kind of an issue that caused division among you and your closest family, there is a good chance that these conflicts can be rectified early in 2017. You just need to pay attention and use the chances and opportunities to bring your family closer together. In fact, you may find yourself enjoying your family more than you ever have before. If you run some sort of business or are planning to pursue some sort of financial venture, there could be a temptation to bring someone you are especially close to into your business, or you may choose to make some kind of an investment together. Just make sure that you both have a clear understanding of what you're taking on so you can avoid any issues in the future.\n \nThe hardest thing for you to do in 2017 is to maintain an even tone and to work hard even when you are not in the spotlight, Rooster. You will need to get better at working under the radar and appreciating the quieter moments of life. If you can do that, there are endless possibilities in every area of your life. You should also be thrilled with the many chances you will have to increase your financial security, and perhaps even advance to a new level of financial stability. This year you can learn to shine from within, and that may be one of the greatest gifts you will ever receive."
  },
  "snake": {
    "content": "The intellectual Snake is cool, detached, and charmingly seductive. When paired in life, you and the Rooster get along splendidly. The Rooster appreciates your efficiency, your intelligence, and your punctuality. When you make a promise, you keep it, and while that's important to most signs, it is especially valued by the Rooster. You are good with money, and this year will bring you many chances to increase your wealth. Your sophisticated nature makes you a natural when it comes to networking and making business deals. You are polished, articulate, and professional, and those qualities will help you stand out against any competition in 2017. Many things came full circle for you last year after a lot of strategizing and intense effort. This year you could coast along successfully if you chose to, but you will likely prefer to keep working hard and further improve your \"balance sheet\". This Rooster year is a great time for that as Rooster appreciates and values hard work.\n \nLast year you were probably better at blending your work life and your personal life than ever before, and as a result, you may have experienced greater harmony than you have in a long time. You can keep that vibe going, Snake, if you continue to take the time to balance out all of your priorities. Harmony is not something you chase; harmony is a framework where you live your life. A strong personal life will enhance your work life, and vice versa.\n \nIn the overall mood of a Rooster year, you may have a tendency to be prouder and more full of yourself, perhaps even cocky, but you will need to curb that tendency. If you get overconfident and cocky, you could create some conflict between yourself and those who may have power over your career. Likewise, if you take your personal relationships for granted, it may throw your work life out of whack. Maintaining balance this year is all it will take to remain serene and satisfied.\n \nSometime around mid-year, you are likely to receive an offer or an invitation that you may not find appealing. This could be because it seems too good to be true, or because it seems too overwhelming. But don't look at this just on its face. Make sure to investigate this chance fully because it could bring something you need very much at just the right time. Likewise, there may also be a chance around this same time to make an introduction that you don't see as very important, but the person involved could make an excellent connection for you.\n \nThe love life of a person born in the year of the Snake is quite intoxicating. The Snake is romantic, attractive, sexy, and an excellent conversationalist. In other words, you are the perfect love interest. This means that you rarely have a shortage of admirers. However, finding the one that is perfect for you - and perfect in your eyes - can be very difficult. Snake people tend to have very high standards, and sometimes even the most striking, interesting, appealing people don't have enough of the right elements for you to stay interested. If you are a single Snake, during the first half of 2017, you may find yourself wondering about the one who got away, and you may choose to seek that person out. That could have an excellent result. If you choose to settle down this year, and if you can be more open in the qualities you seek, you could find someone to love. For attached Snakes, you may need to work at your relationship to reignite the spark. Keeping romance alive sometimes takes work, but if you want an exciting love life, it will be worth it. After all, you have to remember that being the very-selective Snake, you chose that person for a reason, and all you need to do is to remember that and cherish the things that made you fall for that person in the first place.\n \nWith your stunning appearance, your sizzling charisma, and your intriguing intellect at an all-time high, all eyes will be on you this year. You can pretty much write your own ticket for success in romance and in business. Once again, Snake, it is essential that you find that perfect balance between your personal life and your business life. Happiness will be easy to achieve in 2017 as long as you maintain your simmering ambition, but also infuse it with a greater sense of serenity."
  },
  "tiger": {
    "content": "You may have left 2016 in a somewhat restless state, Tiger, and you have probably carried that with you into this year. You are, by nature, often tense and impulsive. You are a fearless fighter, a powerful leader, and always ready for anything. At the same time, you are also warm-hearted, kind, and empathic. Last year, you should have acquired a deeper sense of gratitude for your gifts, and that would have enriched your appreciation for living in the moment. Last year, you may not have had as many exciting adventures as you would have liked, but hold on tight because this year will offer many challenging opportunities that you can sink your claws into. Because of the developments you experienced last year, you will have a better appreciation for each experience you encounter, which means you will not only be more successful; you will also feel more fulfilled.\n\nYour personal relationships were probably very steady and even during last year, Tiger, and that should be a source of comfort and reassurance for you now. You can count on the same people this year for feedback, encouragement, support, and the simple companionship that keeps you feeling in harmony with the world around you. There could be a new person who enters your life around May, and this person will be very different from the company you usually keep. This person is likely to be fiery like you, but also with a softer side. This relationship will begin with a spark of interest from both of you because you will share a passion for something, and it will slowly build to be quite strong and enjoyable, and it will be most likely platonic. This person is so significant because this individual could take on a role of spiritual guide or be something of a muse who inspires you creatively. Nurture this bond to keep it going strong.\n\nYou may have had many big and important opportunities to shine in your career last year, Tiger, and you must have enjoyed certain degree of success. Your momentum should have been pretty steady throughout the year until things slowed down towards the end of 2016. You have built a strong foundation for your career or your business, and now it's a matter of coming up with your signature brilliant ideas and then presenting them with great flamboyance. The influence of the Rooster will surely show you how to strut your stuff and pounce on every chance that comes along to show off your best work. You are good at tracking and pouncing on good opportunities, and this year that talent will come in quite handy! Stay tuned in to your instincts and you'll enjoy great success.\n\nThe same goes for your love life this year, Tiger. If you are single, there will be many options to engage socially that will put you in the company of some very intriguing and fascinating people who could be romantic prospects. If you stay active socially you will surely meet someone who will cause your heart to race. You have a tendency to be easily distracted where your love life is concerned, often scanning the room for attractive options even when you're with someone who you find interesting. This year, however, you may have more of a desire to create a permanent relationship, and that is certainly a possibility. \n\nIf you are attached, take every opportunity to create a romantic mood with your partner this year. That means romantic dinners, a sweet note on the car windshield, and other loving gestures that show your other half you are always thinking about them. You may not realize this, and it certainly wasn't intentional, but in the chaos of your intense life recently, you may have taken your love for granted. So it may seem like an obvious suggestion, but if you add more romance to your life on a regular basis, you'll have a wonderful passionate year.\n\nYour family may pose some challenges for you this year, Tiger - possibly because they disagree with choices you are making, perhaps in business. They may do their best to talk you out of something you believe in. Your natural response might be to write off whatever they are telling you because you have a very authoritative way about you, and you don't like to be told what to do. But if you listen to what they have to say - even if you don't agree with it on the surface - you could hear some very good advice that you can apply to your endeavors.\n \nYour leadership talents will be in full force this year, and you'll gain even more confidence in even your biggest and wildest dreams. Stay in touch with your intuition this year, Tiger - in every area of your life. Your natural animal instincts will guide you in the right direction and lead you through a year that is bound to be both exciting and extraordinarily satisfying."
  }
}
