{
  "aquarius": {
    "content": "Your charm is in your brilliance and your visionary mind, Aquarius. Although it takes the rare special person to truly understand you, you are seen by most people as unique and special. Over the last year, you came into your own in many ways. Although you have always been intuitive and insightful about other people, last year you developed a deeper understanding and insight into your own needs and motivations. This was -and is - and always will be - very important to you as you navigate your path to the future, and make decisions that will have lasting impacts. There will be many chances for you to shine this year, and your unique brand of inventiveness could be discovered by movers and shakers who can help to put some of your ideas into action. Don't get carried away by any one individual who promises the world, but can't offer proof of what they will offer you. Although there could be many chances at great success for you this year, Aquarius, you will need to be very discerning and even suspicious at times, because there are those who might try to take advantage of your trusting nature and the fact that you always try to find the best in others. You may experience a long period of great popularity between late winter and early spring, and that could have a positive and profound impact on your self-esteem and confidence. Stay focused, and don't be afraid to express even your wildest ideas to those who can help you turn dreams into reality.\n\nLove\nUnorthodox and interesting people often tend to gravitate to you, Aquarius, and that goes for your love life too. Last year, you may have met a variety of possible partners, although you may have been attracted to certain people simply because they were so unique. But once you got to know them in a romantic way, your interest may have waned, and you broke it off or did not pursue it. You are not someone who jumps into affairs of the heart easily, so taking your time to establish bonds is always a good thing. One or two of your admirers may have become good friends, and that could happen again this year too, Aquarius. This year you should really explore whether this is something that happens to you because it is your way of escaping vulnerability. If you are single, you may want to make a conscious effort to play the field, even though there could be one special person who will rise above the rest, transcending your expectations and inspiring great passion. Pursue this relationship, but not so passionately that you scare the other person off. An exclusive commitment at this point might be too much too soon. You can be intense at times, and not everyone can handle that. This person in particular may be somewhat reserved, so moving slowly will ingratiate you in a solid way. If you are attached, your union should have a smooth sailing, but you need to work on strengthening your bond by finding common interests and getting involved in these interests together. That could mean taking classes together, visiting museums and art galleries, travelling together, and so on. These types of pursuits will draw you closer to each other.\n\nFamily\nYou are a loyal and devoted family member who always makes it a point to stay in touch and connected to those you love. Ordinarily, you experience very steady bonds with your family members, and last year was probably no exception. This year, however, a conflicted situation could cause tempers to flare and problems to arise between you and another family member - perhaps a parent or a sibling. Although you are generally a very objective person, you may not be able to see the forest for the trees in this situation. It would be wise to step back and take some time for yourself, so that you can put things in perspective, and try to walk in the other person's shoes for a little while. You are quite good at that, being very empathic, so that may be the way to understand the other person's point of view. You can easily reconcile this conflict once you understand where the other person is coming from. This year, a family reunion or a large family gathering of some kind could pull in relatives you have never met, including one particular family member who you'll find quite interesting. Make a point of staying in touch with this person no matter how many miles there are between you. \n\nCareer\nYour entrepreneurial spirit is in high gear this year, Aquarius. Whether you have a business of your own or you work for someone else, this will be a year of huge transformation and great discoveries. This could mean that you will take charge of whatever you are working on, and lead a team to the pinnacle of success. It could also mean that you will discover or invent something, or come up with a new way of doing something that is a vast improvement over the old way. For this, Aquarius, you could receive some amazing kudos and recognition. This could lead to building a name for yourself that will cause other companies, clients, or colleagues to come calling, opening up many doors for you. Last year may have brought more than few disappointments in your work life, but this year will be completely different for you. You could find yourself learning at the foot of a distinguished master in your field, or you could wind up with some other kind of extraordinary opportunity. And as busy as you may be with your work-related pursuits, Aquarius, you will continue to come up with a long list of wild and wonderful ideas. Many of these will be just seeds for the future, so be sure to keep a journal and write everything down as it occurs to you. This is also a year to make sure you protect any unique inventions or ideas you come up with, so that no one can unfairly take advantage of you. This has the potential to be a landmark year for you, Aquarius, and one that could pave a path for huge success in the years to come."
  },
  "aries": {
    "content": "You are organized and regimented, but you are also spirited and fun-loving. You are ambitious and organized, but you are also playful and childlike at times. The powerful Ram - the symbol of your sign, is a curious, intelligent, and sometimes temperamental creature. Throughout last year, you had many opportunities to learn and grow, and the lessons you learned will be very useful to you in 2018. You have been on a steady course, keeping your eyes on the road ahead, and in the coming year, you will make many discoveries that will have you feeling grateful for even the most difficult lessons you have learned. \n\nLove\nRomantically speaking, 2017 may have been rather difficult for many Aries people. If you were one of them, you hopefully did not become bitter, but you used your experiences to grow and to appreciate the good that came from whatever happened. In recent years, you have been a more evolved version of yourself - more sensitive, more insightful, less moody, and more appreciative of the good things in your life. In 2018, these qualities will be magnified even more, and you could have a spectacular love life. Although your work is very important to you, your love life has become equally important, and you will likely devote a lot of your time and energy to making it work in whatever way is important to you. Your relationships in general have become richer and more meaningful to you, Aries, and that is especially the case with your love life right now. This will keep steadily developing throughout the year ahead. If you are a single Ram, you should be quite popular with romantic prospects, and although you typically take the dominant role, and you feel comfortable in that role, you will find that potential partners are seeking you out and not vice versa. However, you may be most interested in the one who seems to be playing hard to get. Pursue that one with all of your fervor, Aries, because while you think this person is playing hard to get, that person may just be trying to ascertain your level of seriousness. This could turn out to be something really special. If you are attached - especially if this is a new commitment - you will find that your bond grows richer and deeper this year in ways you had only imagined in the past. You may have to apologize once or twice (or perhaps more than that), because you are still attached to your old ways in some respects, but ultimately you will have a more meaningful connection to this person than you have ever had before.\n\nFamily\nYou may have experienced some frazzled family connections last year, Aries, but you have done well in communicating kindly and resolving whatever residual drama still existed in 2017. You would rather avoid conflict whenever possible, so you should be especially proud of yourself for making resolution a priority in your life. You know how valuable your family is to you, and you have done well in mediating problems and moving beyond old grudges. You may still be working on certain aspects of this, but in 2018, this will be much easier for you to do because you have grown considerably. Any outstanding conflicts may be the result of the other person's temperament rather than your own. And, as long as you have done your best to reach out and repair any broken bonds and burned bridges, you will just accept that it is the best you can do, and the rest is up to them. In the third quarter of the year, any outstanding issues should be resolved one way or the other. Maintain your caring attitude, and your meaningful family relationships will continue to grow strong.\n\nCareer\nYou hopefully made a lot of headway in your career last year, Aries, and this year you are starting off on a strong note. Although there may be periods where your work life will slow down just a bit, overall you should be feeling very ambitious and quite positive about your prospects. And your hard work, dedication to detail, skills of organization, and overall ambition and willingness to please will be noticed by higher-ups who will recommend you for advancement and increases in income wherever possible. If you are self-employed, this will similarly reflect on your business. Your work and dedication will bear fruit, and you should see various positive advancements in your business. This should be an excellent year for your career, Aries, with much notice of your skills, and much praise and appreciation for all of your efforts. Don't let this go to your head. Even though you have proven yourself time and again,you may have to keep proving yourself because there may be some ups and downs as the year progresses, but with overall trend being quite positive. Exciting things are happening - some of them behind the scenes or not necessarily apparent to you - but you will soon learn how valued you are, and you will have increasing responsibility and positive advancement throughout 2018."
  },
  "cancer": {
    "content": "You are coming ever closer to an important life dream, Moonchild. This dream brings to life all that is good and unique about you. You are an ethereal, sensitive being who is traditional, sentimental, spiritual, and wise in an old-soul kind of way. Last year, you may have thought that dream would come true, and you lived for that moment because the realization of it, was so much a part of your fabric, that to think otherwise might be unbearable. While it may not have come to fruition, the planets' alignment say that you are not to lose hope. The year ahead has much promise in store for you, and it will - in a sense - feel like coming full circle. The Crab, the symbol of your sign, has a tough outer shell. Like the Crab, you work toward the things you want in a sideways movement. You don't often say out loud what you want for fear of startling it away, or perhaps because you don't want others to know what you are chasing. In some ways, you can be as secretive as Scorpio, another water sign, but your reasons for remaining private are often very different. The dream you are chasing weaves many threads of your life together - romance, love, family, storytelling, creativity, and deeply spiritual personal fulfillment. It can happen this year for you, if you remain diligent in the chase. Last year you may have remained in your hard shell for a good part of the year because over the last few years, you have become a bit more cynical and fearful that good things were not in store for you. You turned yourself off in some ways, (despite keeping certain hopes burning), but as 2018 dawns, it's as if you are coming alive in full once again. This year, it is essential to force yourself to remain positive, even when it seems impossible. Embracing optimism is a choice, and one that you must make to have that ever-elusive dream manifest in your life this year.\n\nLove\nAhh, love. You are a sweet and loving creature, Moonchild - someone who puts love ahead of most other things. And yet, you often have troubles where your love life is concerned. That may be because you are so deeply passionate and emotional, so possessive of the one you love, and so imaginative, that all of those elements come together in a volatile and combustible way at times. This makes you both an ardent, interesting lover and one that many people just do not know how to deal with. You want your romantic partner to remember every significant date, defend you even when you are wrong, bring you poetry and flowers, and be just as romantically inclined as you are. That may be a hard thing to find, Moonchild, but this year, you may either find it or come very close. If you are attached, however, this means that there can be a new and fiery wave of passion brewing in your relationship. You do have the power to keep this going on and on, year after year, as long as you recognize its importance and keep feeding the fire. Make this a memorable year by making sure you give as much as you want in return, and by recognizing even the smallest things your lover does for you. If you are a single Cancer, and someone very special already appeared in your life last year, then romance should continue on. The same rules apply as if you were in a long-term, committed relationship, because this is what this relationship can evolve into if you persevere. Overall, 2018 has the potential to be a very romantic and deeply satisfying year for you.\n\nFamily\nFamily is - and always has been - and always will be - at the center of your heart, Moonchild. From the time you were a small child, you have craved a warm sense of family and the deep connections that you value so highly. Although last year you may have experienced some ups and downs with your family relationships, your family life hopefully became more balanced toward the end of the year. But as this year begins, it may seem that your family life is once again in a state of flux. When something is so important, tensions can be high, and that means you may be prone to misunderstandings. It may also mean that you expect so very much, and when the desire doesn't match perfectly with the reality, there can be challenges to deal with. It may be as simple as recognizing that your loved ones are only human, like you, and they can't read your mind or anticipate what you need from them. Good communication will be important this year if you want to maintain strong bonds and rebuild any burnt bridges between family members. A situation involving in-laws - either yours or those of a family member - may figure prominently in a complex drama in the summer months. Although this could produce tension for a while, it will be amicably resolved if no one takes themselves too seriously. Generally, family-wise, this year can be happy and abundant with close family gatherings.\n\nCareer\nThere may have been some drama within your career in 2017, Moonchild, and whenever there is insecurity at work, it can affect you quite significantly. You may have entered this year with the feeling that you are floundering and have lost a sense of direction, but this is simply a period of cooling off and figuring things out. You are worth so much more than certain people realized, and your talents and unique abilities were not being fully recognized either. This year, you may see a complete shift in your work life - either to a new setting or an entirely new career path. You may even do something for yourself that you have always wanted to do, and it will bring great joy and satisfaction. It may even be that turning point you had always hoped would come, and it may be in the area in which your life seems to come full circle. There is also very good potential of more money flowing into your life this year, Moonchild, and that is always something that's really important to you since financial stability does make you feel more secure - and when you feel secure, your true spirit shines through brilliantly. You can forge your own year this way, and come into your own by doing something that truly makes you happy, to the point where it may not even seem like work to you."
  },
  "capricorn": {
    "content": "No matter how old you get, you always maintain your youthful mind and your buoyant spirit. Like a young goat kicking up its heels at every opportunity, you retain a zest for life and passion for everything you become involved in. You are an innovator and a visionary, and not everyone gets where you are coming from, but that is just fine with you. The last year went very quickly for you in many ways because you enjoyed so much of what you were doing. Your leadership abilities were in full force, and others were eager to follow. That trend should continue into this year, with many turning to you for guidance, advice, and mentorship. Although you can be very independent, you should welcome the opportunity to serve and to teach others. You have been building a strong reputation in areas that are of significant importance to you, and this should also continue as many new paths open up and many chances entice you from the horizon. In 2018, you may experience somewhat greater stress than you've had in the past because the stakes will be pretty high in many of your ventures. You are usually rather laid-back and carefree, Capricorn, and you will need to tap into that capacity from time to time, and keep in mind that whatever troubles or struggles you face - this too shall pass. All in all, 2018 looks to be an excellent year.\n\nLove\nAlthough your work life often seems like play to you, your love life may occasionally seem like work. While business may come easily to you, Capricorn, romance often does not. That may be because while spending time with a romantic partner, you may be thinking a lot about business, as it tends to be a priority for you. You have softened somewhat in this regard, and dedicated more of your time to nurturing your romantic relationships, but if you don't continue to make this an active part of your relationship, you can easily slip back into your old ways. You sometimes slip and tend to be more ambitious about your career than your personal relationships in general. In 2017, you did learn more about balancing your work with your personal life, but as work got more complicated toward the end of the year, you may have refocused and made that your priority - but it is never too late to change! You have come to recognize how important romance is in your life, and how it can actually enhance everything else you do - including your work. Attached Capricorns may need to work a little harder in 2018 to get back on firm ground with their partner, but you can do it if you make it a part of your purpose. Planning romantic evenings alone or quick dates for coffee can do wonders for your bond. Single Capricorns may have met someone special late last year, but there could be a few squabbles early on in 2018. You will have to decide if this person is right for you or not, and be decisive in the next steps. If you haven't found anyone yet, spring could bring that special, meaningful bond.\n\nFamily\nYou have probably experienced a rather smooth and happy time with your family over the last year, Capricorn. In general, your relationships have become more balanced, and you have learned to make a point of remaining in touch, and sharing more about your life with others. You may have a wide array of very diverse people you are close to, and this is both interesting and distracting to you. You tend to have set ways of dealing with various aspects of your life, and dealing with different family members in differing ways is challenging for you - but it is also good for you. News from a distance may be intriguing, as it may come from a loved one from \"the old country\" or from someone who relocated to distant shores. This may inspire a desire to learn more about your ancestry, and to start exploring generations past. This might even lead to a new passion for genealogy or some related field. A family member you have grown closer to may come to you for some form of help that you are not quite comfortable with, such as a partnership of some kind, an investment, or a loan. Even if you don't want to help or go along with this, be sure to explain yourself gently and with compassion and understanding. You can refuse, help but maintain the sanctity of this bond if you tread carefully, Capricorn.\n \nCareer\nLast year may have ended with the beginning of a new venture that was both exciting and challenging. This will carry into 2018 in a big way, Capricorn, and you could not be more pleased. You have surrounded yourself - or you will surround yourself - with capable partners who understand your serious nature and your steady inclination for proceeding with care and strategy. You could form partnerships this year that are ideal for your temperament, and vice versa. This stands to be an excellent year for business people of your sign, and that is probably music to your ears. Although there is probably one main business venture that is occupying your thoughts for much of your time, there will be various other assorted opportunities that you'll want to explore or launch. At least one of these could bring great success if you are discerning in how you manage it. Maintaining your sense of humor and your carefree, laid-back attitude at work will enhance your promises for success, because although this will be a successful year overall, it may come with a few challenges. Steer clear of any opportunities that promise \"overnight success,\" no matter how promising they seem to be. This may go without saying as you tend to follow the adage \"it is better to be safe than sorry.\" Overall, positive career growth and success in many ventures are in store for you in 2018, Capricorn."
  },
  "gemini": {
    "content": "Your mercurial nature kept a lot of people guessing last year, Gemini. And that was probably fine with you. You don't like it when someone can figure you out completely, because you feel that it gives you an advantage. In many cases you are right, and you certainly had your share of wins last year as you moved from one profitable and/or rewarding thing to another. Your sign is symbolized by the Twins, which is representing internal struggles of different, often opposing forces pulling you in opposite directions. Your seeming ability to be in two places at once, metaphorically at least, is expressed through your great capability at multi-tasking, for which you are known. This year, that talent will be magnified even more as you go off in many different directions with your personal interests and your business pursuits. While even the thought of this may be tiring to any other sign, this is something that energizes you and helps to maintain your dynamic vibration. Starting around February, there will be many chances for you to show off your ability to juggle multiple tasks successfully, and although this could bring you great rewards, it could cause your personal life to suffer on some level if you aren't careful. That's why the stars are encouraging you to be a bit more earthbound than usual in 2018, so that you can maintain a finer balance in your work and personal lives. Yes, this is possible, and as long as you try to slow yourself down and observe rather than just jumping into every opportunity that comes your way, you will do so successfully. What may be different about this year is as you force yourself to settle down a bit, Gemini, you will begin to feel like you are comfortable with a slower pace because it will cause you to see things you have never noticed before - within your family, your love life, and even in your career, which has taken much or most of your attention in years past.\n\nLove\nAh, love - you are like a bee to honey this year where your love life is concerned, Gemini. While last year your love life may have sat on the bench while you engaged in business, career and other monetary pursuits, this year it will take center stage much of the time. And in the past, you have been much like a bee, treating your love life like the flower you occasionally visit, only to fly away frequently seeking other pursuits. But with your more settled life this year, your love life will become far more important to you, and you will gain a richer level of enjoyment from it. For single Gemini people, this year could be very social, with many invitations coming your way that could lead you to a wide array of interesting romantic prospects. You could even meet someone quite intriguing on a business trip, or through a work meeting or convention. Although you may not be inclined toward getting serious right away, this is someone you will want to continue to get to know, and you may even feel the pangs of jealousy when you realize this person is as free as you are, and therefore able to meet others. Take your time and think long and hard before making any commitments. For attached Gemini people, there could be a demand on the home-front requesting that you spend more time there, and that won't be so difficult for you this year, as you are more inclined to be settled and content. Work on spending one-on-one time with your significant other, and you may find you have an ally who will give you not only warmth, but also strength.\n\nFamily\nAs with your love life, Gemini, there will be family matters that will direct your attention to hearth and home. There may be some issues with a younger family member that will need your time and attention, and getting involved will be good for everyone - including you. You will come to see that you can be quite good in situations where your nurturing is required, and this may be quite a discovery for you. A relative from afar - or from whom there has been an estrangement - may come back into your life because of a problem you both have to deal with. Rather than being a negative, this will allow you to become closer to family in general, and more involved as well. You may find great inspiration from spending more time around those who know you best and have known you the longest, because you happen to be someone who isn't always easy to get to know, so bonds like this are quite rare for you. Indulge and take pleasure in family this year, and you'll add rich dimension to your life.\n\nCareer\nYour career will be quite successful this year, Gemini. Now that we have dispensed with what is probably the most important aspect of your overall view of your work life, let's focus on the how and the why. As you settle into what has become a familiar routine and a comfortable standing in your work life, you will find that you are increasingly interested in other aspects of your work that you had barely thought about before. You may want to dig into other layers of your industry that didn't appeal to you so much in the past, except as they pertained to the bottom line. In other words, you will find yourself more engaged, rather than preoccupied with just the matters of success and making money. By April, a chance to dramatically increase your income could come through a new client, a new promotion, or even the chance to start your own business, which is something that you would excel at. Whatever opportunities come your way, seize them immediately, but don't rush ahead - try to savor each moment of the experience. By year's end, you will find that you are not only where you want to be career-wise, but you are enjoying your work more than ever."
  },
  "leo": {
    "content": "When a Leo walks into a room, it is like the sun coming out behind the clouds and making everything warmer and happier. You have that effect on people. You are naturally optimistic, you have a vibrant personality, and your dynamic presence sometimes seems larger than life. You make anything seem possible. You are bold and courageous and you roar loudly, just like the Lion, the symbol of your sign. Yet deep within, behind that powerful persona, you are sensitive and caring, and you love deeply. You have been coming into your own more and more over the past few years, Leo. You have come to understand what works for you and what doesn't on your life path. Your new and enlightened way of looking at the world means that many new frontiers are opening up for you, and you finally feel ready to venture forth and conquer all of your dreams. In the last year, you have roamed beyond the perimeters of your comfort zone, and you have discovered that you are capable of far more than you ever realized - even though your fans have known it all along. You have delved into exploration of your creativity more, and you have begun to polish many of your talents. That will be quite useful in 2018, as there should be many opportunities that will require the special skills and unique abilities that you possess. The stars are encouraging you to set your sights high this year, Leo, because you are capable of achieving lofty goals this year.\n\nLove\nYou have a passionate soul, Leo. It's as if you were born to be a lover. You have a way with words, and you take romance to the highest level. However, in your life in general, you are sometimes very sociable - but you are also sometimes very independent. Where your romantic life is concerned, this could cause certain troubles. You attract lovers who become accustomed to basking in the glow of your adoration. But during those times when you are feeling more independent, your attention wanes a bit and is drawn to other interests, and your lover may feel abandoned. As you have come more into your own in recent years, you have hopefully come to recognize this about yourself. This is not a reason to change your ways, just keep that in mind and adjust accordingly so that you can have a happy love life. If you encounter this issue in 2018, you can simply work at being more attentive to your significant other, even during those times when you are entranced by other pursuits in your work life or hobbies. In fact, Leo, people who have a significant other may be quite happy right now. As you have evolved, so has your relationship. You have come to understand what you need to keep things purring. And for those Leo people who are still looking for the one, this may be the year to go on the prowl in places where you have other interests. For example, if you enjoy fine wine, you might want to attend wine tastings, or even visit wineries. If you like to paint - an art class might be in order. By September, you may meet someone who you will find pretty dazzling.\n\nFamily\nYou are never happier than when you are surrounded by family, Leo. And yet, you are never un-happier than when you are surrounded by family. In other words, when things are going well, you take great pride in the loved ones in your family circle, but when squabbles arise, you can't help but wind up in the middle of it all most of the time. You endure all the headaches, you experience all the frustrations, and you are the one who always takes on the responsibility of fixing whatever goes wrong. Although you may have started out last year trying to remain neutral in family war zones, old habits die hard. You may have reconciled yourself to your old role, which probably brought you more than your fair share of drama later in the year. This year, the stars are suggesting that you try to step back, even when it is tempting to jump into the fray. Steer clear of family struggles by allowing the key players to figure it out for themselves. If you do, you will find that things go more smoothly, that everyone gets along better, and your time spent with family is far more enjoyable. By July of 2018, a big announcement connected to family - either a marriage or a business announcement - may offer cause for celebration. Make sure to make some time to savor this moment.\n\nCareer\nYou may have been rather conservative in your career pursuits last year, Leo. Hopefully this paid off quite well for you with some dignified new connections, some interesting learning experiences, and some chances to broaden your horizons. However, because of your more low-key approach to business last year, you may have avoided exploring one of your wilder ideas. Even so, Leo, that idea still beckons you, and 2018 will be an excellent time to start learning more about the possibilities. Anything like this that you begin this year will have an excellent chance of establishing traction and taking off in a big way, maybe even before the end of the year. You may also choose to explore some side interests that are more hobbies than work-related, which you can transform into business interests. It would be wise to do as much networking as possible this year as well. That could mean anything from joining professional organizations to attending seminars and connections whenever possible. This is a good year to learn and grow so that you can establish yourself as an authority in your chosen specialties. In 2018, things should be lining up for you so that you can gain and build powerful momentum in advancing and securing your reputation this year."
  },
  "libra": {
    "content": "As the keeper of the scales, Libra, you are someone who represents balance, fairness, and justice. You are more than likely the one who will first rush to the rescue of the underdog, and speak up for the disenfranchised. It can be a huge weight to bear, but you do so with grace, dignity, and fortitude. Over the last year, though, it may have become an even more difficult weigh to carry, with many seeking out your wisdom and help with issues connected to your core principles. You are always willing to assist those that need your help, but it does take a toll. There may have been numerous requests for your special kind of guidance in the last year, and as you enter this year, you may feel out of balance yourself. That is an odd and uncomfortable state for someone like you, Libra, but just as you have always been there to represent those who have been treated unfairly or been overburdened, there will be angelic souls who will come to your rescue whenever you need it, especially in the beginning of the year. You will find that early on, the feeling of being weighted down will dissipate, and you will begin to transcend any problems or struggles you have faced. And by March at the latest, you will have a completely new and brilliant outlook on your life. From there, it will get better and better, with fewer obligations and more fun. Friendships and romantic relationships will thrive, difficulties you dealt with in work-related matters will ease, and great possibilities will open up in every area of your life. This is a whole new year filled with remarkable chances to not just find your balance again, but to enjoy life to the fullest.\n\nLove\nLast year your love life was out of balance a bit, Libra. Although it was better than the previous year, you may have had to face certain issues that were quite challenging. Although there were fewer obstacles to overcome, those that existed were far more complex and conflicted. Because of these moments of strife, you may not have put as much of yourself into your love life in 2017, but this year, you will begin feeling renewed and ready to try again. In fact, romance will be filled with inspiration and possibility. If you are a single Libran, you may have met the love of your life at year's end, even though it may not have transformed into a commitment. If you kept the spark alive, however, it could begin to pick up speed and become far more serious this year. If you are single but did not meet a serious interest, there will be several possibilities for crossing paths with someone special in 2018. Be sure to say yes to any social invitations that come your way, and you never know who could come into your life. If you are attached, last year may have seen some neglect in your partnership, and you may have even turned to couple counseling, or at least thought about this option. But this year the desire and the opportunity to become closer to your partner will be very real and more easily attainable. This should be a year of much smoother sailing where your love life is concerned.\n\nFamily\nMany of the people who came to you with sad stories and in need of repair may have been family members, Libra. You have a special place for these people, so you put your all into trying to help. Because of your dedication and the extreme effort it required, you may have unintentionally become more distant from the very people you were trying to help. It isn't that you were resentful, you were just worn out from the process. This year, Libra, you will have the chance to renew and rebuild any bonds that were fractured or severed. Whenever these chances arise, the stars encourage you to reach out and try to do what you can to make things better. At times, it may take compromise, and you may have to swallow a grudge here and there to do it, but it will be worth it in the end. Whatever you give to your family relationships this year, you will receive gratitude and abundant love in return, making it very worth the effort. An older relative may seek you out this year in an effort to give back some of the time and kindness you extended in years past, and you should accept this effort graciously, even if it seems to put this person out a bit. What they give to you, will give them deep personal reward. The year ahead promises a mostly happy family experience.\n\nCareer\nAt times you are all business, Libra, because it is in your nature to take your life very seriously. You have integrity and commitment where all of your work efforts are concerned, whether you work for yourself or for someone else. Last year you may have had several chances at great success, and you dug in your heels and did the right thing every time. Some of these chances may have fallen through, but others offered you the success you sought. A few may still even be evolving, and if so, in 2018, you will see those projects rise to the top of the line and offer the fulfillment for a few of your big dreams. Although you may find that you have your hands full with work at any given moment (which is how you normally like it, by the way), you may find that an important work-related opportunity comes your way around August. Even though this was not something you were looking for, it may be quite appealing, and it may inspire you to put other things on the shelf temporarily while you explore it. Doing so would be good for you, as this could lead to substantial material and personal success. You are rising quickly this year, and influential people will be taking notice. Just be sure to incorporate time to get physical activity, to enjoy some indulgences, and to devote yourself to your ongoing well-being, so that you can keep everything more in balance this year, Libra."
  },
  "pisces": {
    "content": "Many Pisces people come into their own later in life. Although they may appear wise beyond their years and much like an old soul, their youthful way of looking at the world can mean they are daydreamers who move along life's path a bit more paced than others. You have many unique attributes - you are intuitive, exceedingly creative, wise beyond your years (usually in the advice you give to others, rather than to yourself), and greatly imaginative. Last year, you began to travel along a sturdier path. You began to evolve and became richer in common sense and logic, which at times in your life has been a struggle. Your creative nature is often at odds with the practical world that surrounds you. You would rather spend the day daydreaming by the window than putting your dreams into action. In 2017, you grew in this area, and you are now more determined to take fruitful, tangible steps to make your dreams real. In 2018, there will be many tests for you, but if you pass them successfully, they will become opportunities for you to manifest your dreams, Pisces. Make sure you take every opportunity you receive and run with it, because if you do, this could be an amazingly productive year for you. You must continue to build up your confidence by speaking up for yourself and your work, and allowing yourself to shine whenever the chance presents itself. Dedicate yourself to being the best you can be, and nothing can hold you back in 2018.\n\nLove\nYou are entering another year where love should be more blissful than blustery and more fulfilling than frustrating. Last year was hopefully a time when you experienced the deep happiness that a fulfilling love life can be after a few years of disharmony in that area of your life. However, 2017 may have ended with a difficult breakup, especially if you are not married. This may have left you to fear that there would never be a happy ending for you where romance is concerned. Because you are so sensitive, Pisces, love is an area that is often difficult for you to navigate. You want to please, but you have very high standards and ideals, and when the reality doesn't match your fantasy, you become sad and dejected, and you begin to quarrel. In the last year, you have taken a new perspective on love and learned more about the give-and-take of romantic relationships, making your expectations more realistic and therefore opening up the potential for greater satisfaction. For attached Pisces people, your relationship with your significant other has grown substantially over the last year, and will continue to do so in 2018. You may think about starting something new with your partner - examples include a business partnership or launching some sort of charitable organization that is close to your hearts. But whatever you do, Pisces, you should continue to enjoy the rewards of a grounded love with great passion to keep it fiery. For single Pisces people, remember that remaining alone early in the year will give you the chance to do some self-reflection, and figure out what you really want and need. By summer, you could meet someone who really gets you - perhaps by engaging in interests that are important to you, where you could meet someone who is right for you. \n\nFamily\nThe progress you made last year in growing closer to certain difficult family members may have become stilted in recent weeks. There may have been misunderstandings that neither of you have attempted to clear up, and that has left you feeling alone and sad about the backward progress. But this year, early on, you will have at least one big opportunity to set things right again, Pisces. As you grow more confident in yourself, the jealousy or resentment that has separated you from someone you love will begin to dissipate, then you will naturally progress toward each other again. The more effort you put into maintaining a good relationship with certain people this year, the closer you will become, and you could achieve lasting success if you are caring and thoughtful. You have been bolder and braver in allowing your light to shine in the world in recent months, Pisces, and this has given you a greater sense of self and purpose, which translates into better relationships in general, but especially in better family relationships. Any insecurities you had about family you suspected of looking down on you, or who thought of you as flaky or too much of a dreamer will disappear as you continue to gain self-esteem. A new baby or a new addition to the family through marriage will brighten the lives of most of your immediate family members, bringing all of you great joy. This is someone who will add nuance and dimension to the family structure that is already in place. If you continue to make a point of celebrating, nurturing, and honoring your family relationships, your family dynamic can become more harmonious throughout 2018.\n\nCareer\nYou may have had long - perhaps lifelong - struggles with finding your place in the work world, Pisces. You are very picky about what you want to do to bring in income, often to the point of going without rather than engaging in something you find tedious or frustrating. You have a very imaginative and creative soul, and when that part of yourself is not satisfied, you are not a fully happy person. That is why it is so important for you to find the kind of work that will fulfill your needs in this way. In recent years something you have been engaging in - perhaps the honing of some special talent of yours - has garnered more and more attention from others. You have received compliments from people you respect and admire, and this has made you feel even more confident in your abilities. This year, if you are looking for meaningful work, you may be able to apply what you have learned in some way to make a living from what was once just a hobby or an interest. If you do launch a new venture of this kind, you will need to be diligent in making this a structured work effort, or you risk going back to your day-dreamy ways, which won't offer you the financial sustenance you need. You may start out slowly, but if you persevere, you could transform this talent into a real moneymaker in the years ahead. If you do not choose to pursue one of your talents as a business this year, Pisces, you could be equally lucky in finding a position that does fulfill your creative desires, and that could bring you the financial security you also crave."
  },
  "sagittarius": {
    "content": "Your bow and arrow are aimed high this year, Archer, and you have every reason to be optimistic. The stars will light your path for any dream you choose to pursue. This is your year to explore, to forge new frontiers, to believe in yourself, and to manifest even your biggest, most outlandish dreams. Even though you may have faced a variety of challenges last year, it may seem as if someone flipped a switch and everything seems different in 2018. In 2018, you will be sensing a pathway that is ripe with opportunity, and a vibration that is powerfully positive. Even though it may have involved some struggle, you reinvented yourself last year. And although you may not believe you had anything to show for it at the time, the proof is finally here, and will shine through in one successful venture after another, if you so choose. Last year may have had certain successes, but some of them may have had a hollow ring because there was some level of dissatisfaction with yourself personally. If that was the case for you, this is your chance for an emotional makeover, when you can fully appreciate every good thing that comes your way. This is a good time to learn about breathing, meditation, visualization, affirmation, and self-hypnosis, because these self-improvement techniques could put you in the right place mentally to properly enjoy the bounty that is to come.\n\nLove\nYour love life this year can be especially lovely and robust, Sagittarius. As long as you can continue to apply the lessons you learned last year about being less rigid in your expectations and more open to flowing with the surrounding energies, this can be a very idyllic time in your love life. You have greater insight into yourself now, so you also have keener insight into other people. This will help you have greater empathy and compassion towards others, and that translates to a richer, more connected love life. For those Sagittarians who are in established relationships, you can reach a deeper sense of communion this year as you strive to understand what makes your partner tick - perhaps for the first time ever. If you can work toward building your future together, rather than as separate forces, this can be a dynamic year of positive change for you and your significant other. For single Sagittarians, this can be the year when you meet someone who truly gets you, and who you also understand on an almost intuitive level. This could happen at any time you feel ready to reach out, because soul mates only appear once you are ready for them.\n\nFamily\nAt times, Sagittarius, you have experienced fractured bonds with family members. You may even have a sense of being in competition with one or more of them - possibly siblings - because sometimes you see each other as a nemesis instead of someone who can potentially understand, protect, and love you like no one else ever can. Your outlook on relationships like this has shifted, though, and in 2018, you should be working on at least attempting to develop closer bonds with family members. You can be successful as long as others feel the same, but keep in mind, Sagittarius, that is equally about what you say and how you say it. Expressing your hopes with the desire for stronger family bonds will be the most successful way to reach others this year. One particular family member - someone with whom you had very little or no conflict whatsoever - has been growing closer to you. This connection can grow even stronger in 2018, and it will continue through the years bringing you great joy and satisfaction. A marriage announcement of someone you're not as close to, could come up before the end of summer. This may spur you to work on becoming closer and more connected to this person.\n\nCareer\nOver the last year, your work life may have become an extension of your social life as you made some fun and exciting connections with co-workers and others connected to your job. You may have even become more sociable with people who have a work association with your significant other, if you are attached. You have managed to smoothly blend work life with fun in a way that has made you the envy of others, and there is more of that to come in 2018, Sagittarius. Just be careful to tread carefully, and not to cross over any forbidden lines, or there could be trouble. In 2018, there could be many wonderful chances to increase your role at work and to broaden your skills and power. This could be a year when you ascend quite a few levels in one leap, so proceed with care and caution. You may have worked longer, harder hours over the last year, and that may continue into 2018, but with a bright outlook in mind, you will enjoy the time spent with work companions, and you will enjoy the work itself. They say that if you work at something you enjoy, you aren't really working at all, and that may be how it feels for you this year if you work on keeping the positive outlook throughout 2018. You can take on much bigger responsibilities with a positive approach, and the rewards will be proportional to the effort as well."
  },
  "scorpio": {
    "content": "In a sense, Scorpio, you bloomed last year. Although you treasure your privacy, and although you can be very secretive at times, you began to open up to others. First, you became more involved in the personal lives of those who are closest to you, and you shared more of what you are all about. Then you began to open up in general to others who came into your life. At first this may have been difficult and awkward, because you are used to keeping your distance. Ultimately, though, you have found this new level of intimacy rewarding. Although you probably began this process a while ago and continued it throughout 2017, in 2018, you will reap great rewards for your new openness and self-expression. Your relationships have become closer, so you now have bonds that you can rely on and lean on when you need to. You are no longer so inclined to hide what is troubling you, or to keep people at arm's length. Because of this, you have - and will continue to - meet some very interesting people in your everyday life. Since you are someone who appreciates the unique and extraordinary, this will bring special joy to your life. By late spring, you may encounter an unusual person who feels like a kindred spirit. This person may be highly acclaimed in some area that interests you, and you two could have a very special bond. Don't be afraid to get close to this person, because this could become a lifelong relationship, both personally and possibly even professionally.\n\nLove\nAs your general approach to relationships has broadened and flourished, so has your potential with romantic relationships, Scorpio. Where you were once distant and sometimes suspicious, you have become more willing to get closer and connected to those who attract you. Although this new level of intimacy increases the chance of getting burned, it also opens up a richer path to love and commitment. You are deeply attracted to interesting people who blend the spiritual and the physical, and who touch your soul in some way. This kind of union is hard to come by, but when someone special like this appears in your life now, you know how to savor and protect it. Although your heart may still be hard-won, when someone does bring you the fulfillment you seek, you are dedicated and passionate. If you are attached, your evolution of intimacy has enriched your love life with your partner, and you have grown from being passionate lovers to finding a deeply spiritual connection, and this can continue with the right nurturing and attention. If you are unattached, you may choose to play the field this year for a little while, but if you feel inclined toward a commitment, you will have numerous chances to meet someone later in the year. It may even start out as a relationship of another kind - such as through business, or as a casual friend-of-a-friend acquaintance, but it can transform quickly into romance if you so choose.\n\nFamily\nYou have, at times, struggled with family relationships. Although your modus operandi has typically been about keeping a distance, this may have been especially the case with family members. After all, those who know us the best have the greatest capacity to hurt us the most. And, even as you have grown more open over the last years in general, you have remained somewhat distant from at least certain members of your family, Scorpio. But that does not mean that all is lost where family is concerned. This year, someone in your family - perhaps someone at its core - may open up to you in an unexpected way. And as you grow closer to this person, you will recognize just how incredibly valuable close family relationships can be to you. They can offer a whole new dimension to personal relationships because of the lifetime connections. Although this may seem like common sense, it could feel like a revelation to you. There may be someone in your family - perhaps a parent - who has been especially difficult to bond with. But circumstances this year may throw you two together in a way like never before, which will open up the chance to grow closer. And although it may surprise you, you will find this bond to be unshakeable and remarkable hereafter.\n\nCareer\nA career-related pursuit that had been dragging along may suddenly begin to build momentum early this year. While this may astound you, because you may have been on the path to giving it up, you will find yourself once again immersed in your passion for this venture. If you do choose to continue, it would be wise to consult others who have greater experience in this area, for they can guide you to make the best choices as you move forward. By mid-year, this may become so successful that it could branch off into something even more lucrative and help you build a name for yourself in a related field. And just as this pursuit is taking off, another possible dream opportunity could fall at your doorstep, in a sense. This may come through an old friend, or maybe even a relative. But once you learn about it, you'll be able to think about little else. This dream holds so much promise that you may want to drop everything else to chase it - but don't do that, Scorpio. Although this does hold the potential it appears to hold, it can carry on in a parallel track with other things, but it won't require as much of your attention as you think until later in the year - maybe around August. Then you can devote much of your time to perfecting it."
  },
  "taurus": {
    "content": "On the surface, Taurus, you appear to be strong, unflinching, and stoic - just like the symbol of your sign. But beneath that tough surface beats the heart of a very sensitive, kind, and sentimental being. You are a pushover at times, and last year, you may have come to recognize this, and you may have withdrawn more into yourself because of it. Well, Taurus, 2018 is going to be your coming out party, because you will be feeling brighter, internally stronger, and more resilient than ever. You have embarked on a path of learning to say no when those requesting your assistance are taking you for granted, or in situations that held little meaning for you. Bravo! This is a sign that you have become a stronger individual internally, while still retaining your soft side. Last year may have been a tough one for you in some respects, because you had to look at some hard truths and figure out where you needed some improvement personally. You have looked at yourself and your life more realistically, and you have come to realize what is truly the most important to you. Because of this, personal relationships and your career should flourish in 2018 as you bring those lessons into the foreground and apply what you have learned. The year ahead will present some challenges when it comes to family and your love life, but you are very capable of dealing with them successfully because you have come to know yourself - and what is good for you - so much better. Continue along this path in 2018, Taurus, and there will be nothing that can stop you from attaining the success you so rightly deserve.\n\nLove\nThroughout your life, Taurus, you have experienced many ups and downs in love and romance. One minute it seems that you are flying high where your romantic relationships are concerned, and then the next moment, everything seems difficult and upsetting. This was likely just the luck of the draw in a way, rather than anything you did wrong. In 2018, you should find that your romantic life begins on more of an even keel, and is generally enjoyable rather than contentious or unreliable - whether you are single or attached. You are more self-aware now, and that will serve you well in many ways - not just in your love life - but there should be a notable improvement in romance. Many Taurus people who were single may have found very important love interests last year, and if you were one of the lucky ones, a special relationship could continue into this year and beyond, and perhaps even forever. If you have been attached for some time, your ability to better express yourself has either made your bond stronger, or has revealed that you may want to move on to something new. Hopefully you are experiencing a strengthened union that will make all areas of your life better this year. If you are single, you are now quite ready to meet someone special, and around mid-year, you may either discover that a new person is the one, or you could meet someone who is perfect for you. But even though you may feel inclined to fall into something more serious, you should take a step back, and take your time to think over such a decision in a very logical way. If you move slowly and really get to know someone, your love life can thrive.\n\nFamily\nLast year, Taurus, you may have gotten over-involved in certain family issues that you probably should have steered away from. This was not necessarily your fault. You were probably drawn in by someone pleading for your assistance most of the time, and you do have a hard time saying no in situations like this. However, the adage \"once bitten, twice shy\" may apply this year whenever someone tries to lure you into a family matter that is sticky and complicated. You would be wise to listen to that little voice that can lead you away from trouble. However, a family member may come to you around February or March with a matter not connected to family, and you could be an excellent mentor in this situation, so consider saying yes and helping out. News about a wedding or a birth may come in the summer, Taurus, and this will be pretty exciting news. You may even have a role in this somehow, which could bring great joy. And where there was some conflict in a family area, you will find much greater kindness and acceptance, which will make you feel so much happiness throughout the year.\n\nCareer\nLast year may have been quite busy for you where your career was concerned, Taurus, and your work may have brought you more than your fair share of strife and worry. As you enter 2018, you could still be feeling that tense vibe, but that will dissipate early on. In fact, your career prospects look quite good for 2018, and that means you can relax and get comfortable in the role you occupy. Good things are happening behind the scenes for you now, and you should have some ideas where your career is going by late February when news of a change or promotion - or even a big change in your career is possible. You may not be feeling quite as ambitious as you felt last year, but that won't hurt you in the least. In fact, it will usher in a newfound sense of accomplishment, and bless you with an air of confidence that you may not have felt in the past. That will come in handy as you plan your future. For those Bulls hoping to begin a business of your own, you could find the ideal moment to start something around November of 2018. Anything you launch late in the year will begin with slow and steady progress, which will begin to increase by year's end. Much progress will be made this year, setting the stage for rapid advancement in the following year."
  },
  "virgo": {
    "content": "Many see Virgo people as shy and sweet, humble and understated. And while you can be all of those things, you also possess a steely strength beneath your surface. In 2017, you had numerous chances to raise your voice, proudly embrace your talents, and promote all of your wonderful qualities. If you did, and that underlying strength came shining through, this year will be ripe with opportunities that could make this a very successful and fulfilling year for you. Hopefully last year, you also stepped forward to sell your own ideas. You may even have one very special idea that transpired into a work in progress, and will be a focal point for you in 2018. You are always driven by goals of financial success, and this year promises to offer quite a large blank canvas on which you can \"paint\", bringing your dreams to life. On a personal note, the things you achieve this year will give you a wonderful new sense of emotional richness and pride. You have something important to prove to yourself, and if you continue to put your best foot forward and run with each opportunity that comes your way, you will do quite well. Success has been a continuing theme, and anything that has to do with financial security should continue to show progress in the year ahead. In fact, Virgo, many of the things you got started last year will continue to bloom this year, with a great number of projects progressing toward a successful outcome. Your personal relationships will bring you great satisfaction this year too, and you will have the chance to create many happy memories throughout the year.\n\nLove\nYou are sometimes shy about love, Virgo, but love is always an important theme in your life. Sometimes you are so humble, though, that you don't ask for what you want and need, and in a sense - in your love life - you could lead a life of quiet desperation. But it does not have to be that way. As you come into your own voice, in your life in general, this can also translate to your romantic life. Your love life may have been quite interesting last year, but this year, it has the chance to be especially fulfilling. The key to romantic happiness for you will be in saying out loud what you want, being committed to finding it, and not accepting less than what you want, need, and deserve. That isn't always easy for anyone, and it may be especially challenging for you at times, but you can do it. If you make this commitment to yourself, then your love life can flourish this year. For attached Virgo people, that will mean demanding what you deserve from your partner through clear communication, and offering the same in return. Doing so will help to make you even closer as friends, as well as romantic partners. For single Virgo people, the chance to meet someone special around May will mean galloping out of the starting gate with high expectations, and following through by accepting only the best for yourself. You deserve to be treated like a king or a queen, and that can come to be, if you decide not to accept anything less.\n\nFamily\nYou may have had your share of family squabbles last year, and then some. But as we usher in 2018, the whole tone is changing. Family members who are especially difficult may become more cooperative, and they may even begin to appreciate the anchoring point you have always been for the entire family. Not many family members can be the kind, fair and compassionate mediator that you have often been. Few can offer the insight and understanding that you have offered in family matters. Even when there are arguments, you can be the voice of reason that people will turn to. Although you may complain at times about being the one that everyone comes to during hardships, you also savor this role, and it brings you a great sense of satisfaction and fulfillment. That may be your role throughout life, and it will always be one that you will treasure. You may have the chance to offer special guidance to a younger family member, or a friend of the family, who comes to you seeking support and guidance. This will be a turning point for that person, and it could also offer you a turning point in your own life. What you give to this person will come back to you tenfold in good karma. Just do your best, and you can't go wrong.\n\nCareer\nThis could be a spectacular year for your work life, Virgo. Even though last year should have been reasonably good, and although you learned a lot and grew a lot in your career, this year could be one for the record books. Your job may change in some way - you could change roles within your present workplace, you could rise to a higher position, you could even move out of your industry and into something new. But whatever changes occur, they will be sweetly satisfying, and most likely they will also be quite rewarding. Around June there could be a huge opportunity to increase your income, and to make connections that will offer you career security for years to come. You may have the chance to travel more this year on work-related business, which could satisfy your desire to explore the world a little bit. You might even meet a few new friends through this experience. If you are someone who has been dreaming about starting your own business, this would be a good year to give it a try. The stars are blessing any attempt you make to launch your own venture. You should find that the resources and assistance you need will somehow materialize at every step, so don't waste any time worrying. All in all, this could be an exceptionally thrilling year for you where your career is concerned."
  }
}
