{
  "aquarius": {
    "content": "Predictably unpredictable, you are always several steps ahead of everyone else, Aquarius. Your mind is intricate and complex, which makes you innovative and idea-oriented. You are a visionary able to see possibilities that most would not have the capacity to think of. And while you are a born humanitarian and quite sociable, you may come off as distant and detached. You are often submerged in your own world, which is quite an interesting place, to be honest. You love to converse on a broad range of topics with interesting people, and you can talk to absolutely anyone at their own level and thoroughly enjoy it. Your charisma sets you apart, for your magnetic nature is unlike the typical charm one might experience. You are extraordinarily unique, yet you fit in anywhere you go. You do appreciate the relationships that you cultivate, but you are not someone who can be fenced in because you love your freedom and you don’t like being restricted. Your pioneering nature cannot be contained. 2020 will have many opportunities in store for you. You will have the chance to uncover new horizons and take on new challenges. This can get overwhelming if you don’t pace yourself, so make sure to watch your pace and your health. Dedicating more time to physical activities would be a great idea – not only for your body but also for your soul and mind. Try to keep balance in 2020, and when you are looking back on everything at the end of 2020, you shall see how much you have accomplished.\n\n\nLove\n\nYou are an intense person, and in love, you can be quite charming and cavalier. In the courtship period of a relationship, there is much excitement. But as time goes on, your cerebral nature can make you come across as cold at times. It isn’t because you don’t experience deep emotions – it’s just that you are someone who navigates your way through life intellectually rather than emotionally. So, whenever there is an issue that your mate might deal with through conversation, you might deal with it in a more analytical way. But once the relationship is established and your ways are known and accepted, you can form incredibly deep and loving bonds. This year, romance could be quite richer and deeper than it has been in a long time, or maybe even ever. Attached Aquarians may discover something quite interesting about their mates that was not obvious before, and it could be quite intriguing and could intensify the heat of the passion that already exists. Fan that flame, and this will be the level of intensity that you will be able to maintain going forward. For single Aquarians, if you are looking for someone special, you could meet someone who inspires you because of their brilliant mind, which will keep you interested and intrigued. Even if you have plans to play the field this year, someone may touch your heart in such a way that you won’t be able to stop thinking about them. Remember to stay in touch with your emotions and to express yourself from that place in the best way that you can. Taking this approach would be the best thing for you in 2020.\n\n\nFamily\n\nFriendship is a strong component of your sign, Aquarius. You have loyal friends to whom you are devoted, and your family relationships are much the same. You have relationships with your loved ones that are akin to friendships – in that you don’t dwell on differences or look too far ahead or have expectations from the family that you would not have in a friendship relationship. This makes you easy to get along with and quite comfortable when spending time with family members. You are someone who is always striving for the greater good and working to make the world a better place, and yes, that does begin at home. You will fight for your loved ones’ well-being and be there to provide whatever they cannot provide for themselves. This makes you someone family members around you can rely on and therefore a strong link in your family. This year, a much younger person may turn to you as a mentor. This is the perfect role for you, Aquarius, because with you, there is never a generation gap. You understand the younger generations with no issues because you think without limits or cynicism. You are open to new and unconventional ideas, which is something that is highly appreciated by a young, questioning mind. Someone may want to include you in a family venture that could involve an investment. You may not want to be involved in this because it just doesn’t fit with your plans for this year. However, you may not want to hurt anyone’s feelings or offend anyone, and so you could take on the role of a guide since there will be a need for the kind of strategic thinking that comes so naturally to you. This can work out well if you explain your boundaries and draw every line very clearly. \n\n\nCareer\n\nWhatever you choose to do for a living, Aquarius, your ideal role will be one that is not fenced in in any way. You would not be happy confined to an office, sitting behind a desk all day – unless there is the chance to get up and move and explore and discover at various points in your work. You are a maverick thinker, and you don’t fit in just anywhere. You are at your best in a progressive environment that is in a state of constant flux where your original and often innovative ideas will be heard and taken seriously. Many people born under your sign will choose a career that “gives back” in some way because you do have a strong desire to leave the world better than you found it. This does not mean that you won’t be money-driven, it just means that you would prefer to make your living in a way that can also benefit others and the world. This year, your penchant for technology and science may come to the forefront as you explore opportunities in one or both of these fields. This could also mean an investment could be offered to you related to these fields, or this could come through someone who is a connection of this kind. Be careful about investing too early in the year, because better chances could come later on. There could be an idea you began thinking about in 2019 that you may begin working on seriously in 2020. Take this slowly, because if you become too preoccupied too soon, it could pull you away from some very important obligations."
  },
  "aries": {
    "content": "With your fierce and powerful persona, your fiery heart, and your intensely emotional aura, you may be too hot to handle for some, Aries. But that’s just fine as far as you are concerned, because only those who are in it for real and for the long haul are worthy of your time. You are a deeply loyal and honorable person – someone who may have friends that span all the way back to childhood. Those long-time bonds are important to you, as are all of your friendships and family relationships. Sometimes you are hard to read because you are so intense. Those who don’t know you may see your volcanic personality erupting from time to time and believe you to be a volatile individual, but actually you are almost always under control. And when you focus on what you want in life, you don’t give up until you achieve it. Yes, you do hold others to your high standards, but you are toughest on yourself by far. These qualities and that perfection will pay off for you this year as you strive to achieve new heights and reach for the best that life has to offer. \n\n\nLove\n\nLove and romance can be tricky for an Aries person, whether male or female. You feel so deeply, but you are capable of keeping your emotions under control and hiding those deep feelings for fear of being considered weak or vulnerable. So even though you love passionately, your tough exterior sometimes belies the warmth that is always in your heart. Whether attached or not, the last year may have been a bit rough on you. Attached Aries people may have become so focused on making something perfect that it may have come off as pressure or control. And single Aries people may have been somewhat distant over the last year by not sharing how you truly feel. But that period of your life is ending, and a new and more open time is coming for the people of your sign. This should evolve in all areas of your life, dear Aries, but it will be especially beneficial in your love life. If you are single, there may have been at least one romance that got out of hand last year, and that may have caused you to avoid trying to connect with anyone for some time. You may have taken or considered taking a hiatus from dating, but at the beginning of this year, you may find your interest renewed for finding love – which given all the factors, is very possible this year. All you have to do to begin your own love story is to get out there, believe in yourself, remain open, and show more of your vulnerable side. If you have a significant other, you may have had a rough patch or two with your lover. That may have created some distance between you that has been difficult to bridge, and you may not know how to approach a better connection. However, you should find that several events will serve to naturally draw you closer together so that you can repair your bond and grow even closer over the course of the year. \n\n\nFamily\n\nFamily is oh so important to you, Aries, but you expect that your family members will accept you as you are, and not as they want you to be. You have little patience for those relatives that hope to change you in some way, or that try to guide you and force their advice on you. You know what you are doing, and you don’t need anyone to intervene. If your family doesn’t understand that about you by now, then they never will.  Because one particular family member is a bit clingy and cloying in this way and sometimes tries to impress their opinions on you, this has been a challenging relationship. This year, though, there will be chances to forge a stronger and richer bond, but you must be open to it. Family theme and connections will be enhanced and elevated this year and that may come front and center for you for much of the year. This can result in more frequent familial get-togethers. With these kinds of occasions, it is easier to relax and be more accepting of those who you don’t always agree with, so be open to that. There may be an in-law or a family member on the periphery of your life who would love to get closer to you. You may have kept this person at a distance for some reason, but with the enhanced familial energy for you this year, you may be likely to allow yourself to grow closer to this individual this year. This could be both enlightening to you and could help strengthen bonds with other members of your family as well through the stronger bond with this person. \n\n\nCareer\n\nThere is no doubt about it, Aries, the people born under your sign are extremely dedicated and hard-working. Your work ethic is often a model for others, and because of that, you may often find yourself in the position of mentorship with those you work with and who look up to you. This year, you may draw in others who want to learn from you, and this could be as gratifying for you as it is for them. Last year may have had great moments of satisfaction, along with some insecure moments when you didn’t feel certain about anything where your career was concerned. This year should be far more stable with noteworthy praise of your performance both form higher-ups and from peers and customers. You will see a true reflection of how valued you are, and that will be most fulfilling. Once again, you need to tune in to the way you relate to people who are your subordinates. You have a tendency to come off fairly assertive and sometimes even forceful, and this can cause intimidation to someone who doesn’t know what a warm heart you have under all that exterior toughness. So, be very conscious of how you speak to others and how you are perceived by those you have authority over – and to whom you have responsibilities. There is a tremendous amount of good that you can accomplish this year in your work life if you pay attention to these things, so take time to build strong bonds with others and remain true to your ideals. "
  },
  "cancer": {
    "content": "Your warm and loving heart, your generous spirit, your sensitive soul, and your quiet charm are sometimes well hidden beneath a tough outer shell. Your roiling emotions are like the sea, deep and ever-changing, as are your many moods. You are an eccentric contradiction, Moonchild. You tend to cling to family and other people that are close to you, yet you are very independent at the same time. You are shy, but you leap into action with assertiveness and incredible tenacity, digging in your claws when something is really important to you. You are a dreamer, but you are a realist as well. You are deeply loyal, and when there is even the slightest perception that someone has betrayed or misled you, forgotten your birthday, or have been insensitive toward you in any way, you are wounded to the core, and you may find it hard to forgive. Although you can be petty, jealous, and possessive at times, you are always nurturing, protective, and fiercely devoted to those you love. You are other-worldly creative and imaginative. You are also highly intuitive. Part of your appeal is your enigmatic nature. And you are always a deep and abiding mystery at times – even to those who know you best. Your intuition will be heightened in 2020 and you should use that and your insights for self-development as well as working on your most important relationships this year. This should be the main aspect you should be concentrating on in 2020.\n\n\nLove\n\nYou are someone who takes love and romance very seriously, dear Moonchild. Love and affection is what drives you in many situations. Much of what you do in your life is propelled by love – whether love of another being or passion for pursuing a dream, there is love and passion at the core of everything you do. Your affections run deep and are everlasting. Once you fall in love with someone or something, that’s it. You don’t trivialize when it comes to that because you have the best kind of appreciation for love’s sacredness. Although you can be a bit fickle until you find the one person you want to spend your life with – and you may have an idea of what that person is like from a fairly young age – once you do find true love, you see it as being forever. Your loyal nature makes you a perfect partner, always giving and caring and nurturing your loved one. Sometimes, though, your tight connection with your partner can become cloying, so you need to watch out for that tendency. This year, if you are single, you may see yourself as being on a quest to find Ms. or Mr. Right. Is that possible you may wonder? Maybe. Possibly. That depends on where you are in your own personal journey. There will certainly be several potential romantic partners around you this year, but if you are not ready yet, you may not see them in the right light. But if you are ready, you should have numerous chances to meet someone very special. Just be careful not to rush in too quickly so that you know you are in love with “the one” rather than just being in love with the idea of love itself. If you are attached, there may be some distance between you and your significant other at the start of the year. You may not perceive this to be anything serious, and it probably isn’t. But it could be, if you don’t take the time and care to find ways to mend whatever is wrong and bond more closely. If you do, then there is no limit to how spectacular 2020 could turn out for you. \n\n\nFamily\n\nFamily is what makes your heart beat, Moonchild. You may just be the most family-oriented sign in all of the zodiac. You are the maternal/paternal sign, the center of the family and the foundation of the tradition within your own family. As a parent, you can be a bit too overprotective at times, but there is never a question that you have an all-consuming love for your children. As a member of your immediate family, you may well be at the center of it – the one that everyone turns to and counts on. And as a spouse, you are dedicated and loyal to the end. This year, as always, your family life will play a major role. Early in the year, you may be called in to referee a conflict between family members, but you will do it so lovingly, that they may believe it simply worked out by itself. In fact, there may be several times in the coming year where you will step in quietly and tear down barriers between those you love by showing them the way with your own example and your pure spirit. You may fall into the role of the leader over a big family decision around the middle of the year. This may not be a popular role at first, as there could be dissent among those involved.  However, you have the power to get everyone on the same page resulting in a happy ending. Later in the year, the holidays may be a bit different this year, with a different way of celebrating that could become a new and splendid tradition. \n\n\nCareer\n\nBecause you are so focused on taking good care of your loved ones, Moonchild, your career and all the ways you have to draw financial security into your life are very important to you and are the main point of your focus. Yes, you are money-oriented, but it isn’t about “things” to you – it is about the safety and peace of mind that being financially secure can buy. You do have an appreciation for beautiful things, and you do like to indulge in spending from time to time, but much of the time you can be frugal and very conscious of where your spending is going. This year, there is a chance at a windfall and some lucrative good fortune where finances are concerned coming into your life in a variety of ways. There may be an important project that will finally get off the ground. Even though this project has lingered with you for a very long time, it may suddenly take on a life of its own, and it could actually bring in the outrageously wonderful rewards you have always fantasized about. You may find yourself in the spotlight where your career or business is concerned later in the year when something you have worked on will capture the attention of someone higher up who has some phenomenal connections. If you handle this opportunity carefully, this could blossom into something bigger and brighter than you have ever imagined. With your tenacious spirit and your wild and fertile imagination, you can transform this chance into a lifelong source of fulfillment and financial prosperity."
  },
  "capricorn": {
    "content": "Fastidious is a word that could describe you well, Capricorn, and it is probably a word that you like very much. Yes, it could be seen as finicky and persnickety, but it also means that you set very high standards for yourself and for others – and what’s wrong with that? You don’t have to rely on anyone else to maintain your standards, for you are very resourceful and independent. You are very disciplined and also very patient, and this applies to both your professional and personal life. However, that does not mean you don’t make demands or push forward quickly when necessary. You are fiercely ambitious and driven, and you are highly self-motivated and self-sufficient. And while many of these qualities may make you seem intimidating and imposing, you are also extremely loyal, very stable, and very intuitive. And although you have a tendency to be reserved and to keep things bottled up, when you love someone you are faithful and dedicated. The coming year will test some of your qualities. Your ambition and motivation will be tested with some difficulties, but if you remain true to yourself, you will successfully overcome these and show yourself and everyone around you how difficulties can be conquered if you are the one taking on them.\n\n\nLove\n\nIt may take you a while to warm up to a potential new love prospect, Capricorn, but once you do, there are so many things to admire about you. Security is extremely important to you, and you seek out partners who can provide that feeling – and at the same time, you provide a sense of security in return. Your confidence and assertiveness can be a big turn-on for the right person, and your wonderfully inventive imagination is always coming up with new ways to be romantic. And best of all, you aren’t a clingy lover either. If your partner needs space, you are not only accepting of it, you commend it, for you like to have – and are appreciative of – your own space as well. This means that you are attracted to strong, independent personalities, and vice versa. Potential problems in your relationships may begin with your tendency to keep your feelings to yourself. Even when something is bothering you, you tend to bury it and not talk about it, which may be the worst thing you can do. This is, however, something you can overcome fairly easily if you consciously work on it. This year, you may come out of your shell and show more of your vibrant and fun side with a new lover if you are single, or with your cherished significant other if you are already attached. This may be a facet of you that arises only rarely, but your quirky, more interesting side will be overflowing this year, making you quite enchanting. For Capricorn people who have hesitated to take the plunge commitment-wise, you may come very close to that this year, perhaps even accepting or making a marriage proposal. For committed Capricorns, your love life could become spicier and more robust than it has ever been.\n\n\nFamily\n\nA feeling of constant security is very important to you, Capricorn, and you are smart enough and practical enough to recognize that there is no better source than family for this. These are the people who have known you forever and who have seen you at your best and at your worst – and yet they still accept you and love you unconditionally. This is quite appealing to you, so you are very careful to maintain the bonds you have and to never take them for granted. You are someone who will call to catch up frequently, even when your schedule is overloaded. Because you have a good heart and you are honest and loyal, a family member may come to you this year with the goal of getting feedback on an important life change they want to keep under wraps for the time being. You happen to be excellent at giving advice, and this trust will give you a wonderful feeling of belonging in the world and feeling trusted and appreciated. There may be a big change with a family member this year that you may have a hard time accepting at first. But if you try to see it from the perspective of what is good for this person, rather than what you want for them, you will come to accept and even admire this person’s decision.\n\n\nCareer\n\nYou are a natural-born leader, Capricorn. You are someone who is always in charge and able to oversee every aspect of what’s happening in the workplace. You are an employee who is always punctual and always coming up with new and better ways to do something. Your leadership qualities and your professionalism are highly respected, and many people of your sign often build very strong reputations quite early in their careers because of this strong work ethic. The strong work ethic combined with your ambitions will typically allow Capricorns to climb the ladder of success very quickly. Your realistic nature makes you quite capable of making good decisions. One thing you have to watch out for, however, is being too cautious and avoiding risks altogether. Sometimes a small risk is worth taking. This year, you may cross the friendship line and become involved in business with someone you see as a friend. This is not something you steer clear of, but you are very discerning in this way, and so you try to avoid this and rarely mix friendship with business. You know that your standards are so high that many will not live up to your expectations, so you prefer not to join forces in business with friends. When you do, you feel certain that it can work because friendship is very important to you, and you don’t want any bad choices to end a bond. There could be a significant change in your career in 2020. It can be a promotion or maybe a lateral move that you were thinking about for some time. This can also be something totally unexpected. It can be unnerving in the beginning, but once things settle, you will realize that this is a welcome change. You may also get a boost from someone you worked with a long time ago who recommends you highly. This can also be a very good year for you financially because of the choices you make early on in the year, so be discerning in financial decisions that you make at the beginning of 2020."
  },
  "gemini": {
    "content": "Quick-witted, fast on your feet, and a whirling dervish of seemingly impossible moves, you are a twirling, tilting tornado of energy when you are at your most active, which is most of the time. No, Gemini, not everyone understands you. You leave many in your dust. To those who do understand you, you are an amazing force of nature. But even those who “get” you, don’t fully understand everything about you. You can be an enigma, always leaving people guessing, which makes you quite beguiling in your own way. Despite your fast-moving mind and your energetic nature, you are actually quite easy-going and flexible. You are highly intelligent, but you can also be impulsive, indecisive, and even unreliable at times. Still, your fan club would describe you as a social butterfly who livens up any party and infuses any get-together with optimism and enthusiasm. You love to be the center of attention, and you can be nosy too – but your fun-loving nature eclipses any vices. For those who love an intellectual conversation, you can’t be beat. And one thing is for certain – you are never boring! In 2020 you should have a lot of energy and ambition to achieve new heights in your most important objectives. This could be the deciding year for you in several aspects. In 2020 you will start and build the foundation of some important projects and goals. If you invest and build a good foundation this year, you’d be able to enjoy the fruits of your labor going forward in the coming years for at least a few years.\n\n\nLove\n\nLife is a game to you at times, and sometimes you see your love life as a game as well. That does not mean that you don’t understand how important this aspect of your life can and should be. It is more about not taking your love life all that seriously all the time because you may fear that if you did, you could be deeply disappointed when things don’t work out the way you wanted and expected them to. But once you do recognize how much the right love partner can complete your life, you will insist on finding the right person. A Gemini will rarely settle for less than what they want because they know they will quickly become bored and restless with the wrong person. Before that special partner comes along, however, you Gemini may be quite a flirt, testing the romantic waters and having fun throughout the experience. When you settle down, it will hopefully be with someone who will keep you thinking, who will challenge you, and who can keep up with your constant movement and changes. When you are satisfied, you can be a faithful and loving partner, and life will always be exciting with you. Single Gemini people may have a year of ups and downs where love is concerned, but you need to see your trials as a learning experience. There may be some aspect of yourself that you need to refine, and you may need to zero in on what you are looking for before you draw in the right significant other. Take your time even though that may seem like a foreign concept to you. For those Gemini people who are already attached, this could be a year when you will flirt with each other as never before, making your interactions sexy and thrilling. You may decide to embark on a big change in your shared life as well this year, which can further enhance the tone of your exchanges and solidify your dynamic bond. \n\n\nFamily\n\nNo matter how old a Gemini person is, they are always young at heart. That’s why you often gravitate to younger family members and fit right in when you do. But you are very familial and family-oriented in general, especially enjoying the social gatherings during holidays and on other occasions. And with family and friends too, you are the life of the party – the one with the best jokes and stories, and the one who knows how to stir things up with titillating and sometimes drama-filled conversation. You do have a penchant for leaping from one topic of conversation to another, though, which may make it difficult for others to follow along. And you do occasionally get bored. It wouldn’t be unusual for you to simply take off and disappear if the company gets too stale, which may leave a family member or two irritated. And when there is a conflict between you and a family member, you typically won’t take it as seriously as the other party, but will let it go and move on so that others can as well. Your family life this year can be as active as you are. 2020 may bring many happy occasions where your family is involved. There may be, for example, a wave of weddings or babies being born – always something to celebrate. You may also find that one particular relative seems angry or jealous, and you may need to offer extra care and attention to get back in this person’s good graces. But with your charm, you surely will in no time if you really want to and set on that goal. \n\n\nCareer\n\nMany Gemini people don’t figure out what they want to be when they grow up until later in life. Some don’t know even then. That’s because those born as Geminis love to dabble in this and that, experiencing a wide swath of careers or businesses that interest them. Geminis find this kind of exploration invigorating and are especially drawn to work that stimulates their mind. When you find something that suits you, you are a powerhouse of energy and stamina, and you don’t give up. You dread the idea of getting stuck in a routine, so any Gemini with a nine-to-five job that requires them to be chained to a desk may be restless and unhappy.  If you can find a vocation that allows you to be spirited, always discovering something new and meeting a variety of people, then you are so much more likely to feel right at home. Material gain is important to you, but perhaps not as important as the work itself. You could experience some work success with an opportunity or two that comes through one or more of your social connections. However, one thing you need to be wary of this year is mixing business with pleasure to an extreme, something that you may enjoy doing. While you can use your gift for planning exciting adventures to your advantage, when entertaining clients for example, or doing something similar, too much of that this year could lead to trouble. If you maintain balance in all of your work-related activities, and make a conscious point of being organized consistently and a bit more traditional in your approach, then you can have a successful year doing what you want to do reaping all the benefits from it."
  },
  "leo": {
    "content": "Stealthy and clever, courageous and bold, you have a sure-footed way of prowling through life, dear Leo. And you are on the prowl much of the time – hunting out friendships, good times, interesting experiences, and so on. You have a lust for life, and it is extremely contagious. When you enter a room, you dazzle – bringing the sun with you. The party is always happier and more robust when you are there. You are warm-hearted and gregarious, generous and sympathetic, cheerful and always passionate. You can, at times, crave the spotlight a bit too much, sometimes pushing others out of the way so that you can shine on center stage, but to your defense, it must be said that the show is always worth it. Your self-confidence is rarely the subject of doubt to anyone who observes you, but you do occasionally feel insecure, even though you hide it well. When that happens, you become a sad kitten, deeply in need of some extra strokes and reassurance. But the brave lion always returns rather quickly, and your roar is like music to the ears of your admirers. \n\n\nLove\n\nYou are the king or queen of the jungle, and you are the king or the queen when it comes to love and romance as well. You treat your beloved like royalty, always generous and gracious, eloquently expressing the depth of your feelings. You are someone who is at your best when you have a partner by your side. You can do the single scene just fine, but you are truly at your best and at your happiest when you have a significant other with whom you can share your most precious and important moments. But, of course, not just anyone will do. Choosing the right partner for you is much like screening candidates to marry into a royal bloodline. This person has to be reasonable, smart and intelligent, but also be able to share the spotlight with you. That doesn’t mean your partner can’t be shyer or more reserved than you are; that would be fine. But they have to be able to understand and appreciate your stellar qualities, rather than being jealous or trying to steal the show from you. The year ahead should provide you with everything that is special about love and romance. This could be an excellent year for you whether you are attached or single. If you are single, you could meet someone very unique and special. If that happens, this kind of romance will move quickly for you, and you may find yourself contemplating a lifetime together in no time. If you are attached, it should be a blissful year. You may have several chances to enjoy some very special events and experiences that will draw you and your partner closer together and ignite the passion you have for each other in 2020. Ohh yes, a thrilling year for Leos in the love department indeed!\n\n\nFamily\n\nYour family is your heart, Leo. You passionately believe in those you love and you are there for them no matter what. You are fiercely protective and you embrace your loved ones with great care and sensitivity. But even though you love deeply, you are sometimes more involved with your own goings-on, so take great care to maintain an attentive presence so that no distance grows between you. But despite your independent nature, you will drop everything immediately if a loved one needs you. You are deeply proud of your ancestry, and you dig in and learn as much as you can about your history if the opportunity presents itself. You are also highly oriented to family tradition – this is important to you and is passed on to your younger generation with great care. Because your image is so important to you, it is also important to you that your loved ones carry themselves with grace and decorum. This year, there could be some volatile emotions happening. The source of this may be an ongoing disagreement. If you don’t take the time to listen to what others feel and think, this conflict will continue for quite some time. But if you show that you care about others’ feelings, Leo, you can resolve this rather easily. An announcement to a family or from family connected to some business may occur this year. It may require you or others to make a change so that you can prosper in a bigger way with work or business-related possibilities. As loyal as you are to family, no matter what challenges you face, there will be lots of happiness and rich emotions to carry you through. \n\n\nCareer\n\nYou are quite the optimist when it comes to your work or business. You seem to have endless energy, and when you find something you love, you pour your heart and soul into it rarely coming up for air, metaphorically speaking. And you do strive to be your own boss because you are a natural-born leader and you don’t see the need to take orders or direction from anyone else. Success is important to you, but what’s even more important is the enjoyment and social gratification you get out of whatever you do. Many people born under your sign choose work that fills this need, giving them the chance to interact with others and to show off in some way. You are something of a perfectionist with what you do, and it shows. Others are often impressed by your knowledge, skill and finesse. This year, work or business may initially get off to a slow start, perhaps causing a bit of boredom at first. But having any spare time to contemplate the opportunities that are all around you will inspire you to come up with something new and different to pursue this year. You may wish to explore an idea you have harbored for a long time, and if you do, it could take off rather quickly. There is money to be made this year, and you may easily exceed past years, financially speaking, and also when it comes to building your reputation. You could become the one to turn to for expertise in a certain field or specialty. Just be careful not to spend as passionately as you work, because this is a great year to get ahead and build a solid financial reserve. "
  },
  "libra": {
    "content": "Diplomacy, kindness, and a strong need for harmony and balance are at the foundation of the Libra personality. You have high moral ideals and would give the shirt off your back to even a stranger in need, but at the same time, you can be very self-indulgent. Even though you understand that beauty is only skin deep, you are aesthetically oriented and often impressed by attractive superficial qualities. You have a strong need for partnership and a large social world, but you can be very co-dependent. And while you may appear to be very independent, you secretly love to be coddled and nurtured. Some may see you as entitled, but your powerful sense of fairness and justice offers the polar-opposite view. You are an innovator and an idea person, but you sometimes stop there and rely on others to get your ideas off the ground. Still, your peaceful, loving ways and your endless charm make you a favorite friend and beloved family member.  \n\n\nLove\n\nYou are a hopeless romantic at heart, dear Libra, but sometimes your fantasy does not jive with the relationships you wind up involved in. Perhaps you have settled too quickly at times being in love with the idea of love and romance and imagining a potential suitor can eventually live up to your ideals. But it is better to take love more slowly to be sure you are well suited to your partner. When a relationship isn’t working well for you, you sometimes go overboard in trying to be fair, often treating yourself unfairly in the process. This year, your love life could go through some evolution. And while this learning experience could involve some growing pains, it will ultimately make you a better person, a better partner, and will help you find the balance you crave in a romantic relationship. Single Libras should be very cautious this year about not rushing into anything or proclaiming love at first sight. It can be hard to know if you are seeing someone in a true light when you’re wearing those romantically rose-colored glasses. Take it slow and steady if you meet someone who seems to have potential, and get to know them rather than adorning them with certain characteristics with your imagination. If you remain true to your standards, you can find a great love partner this year. If you are attached, be careful about the above-mentioned tendency to be more of a giver and not enough of a taker. All relationships involve give and take, but the balance may have been off for you with your significant other recently. This may not have been intentional on the part of your lover; it may simply have come about because of the trend you started. Recognize that you also love to be nurtured, and accept that from your mate. If you start to harmonize better in this way, your bond can reach great depths of passion this year. \n\n\nFamily\n\nYour warm-hearted guidance and astute advice is something that family members often turn to and rely on. You can be counted on to deliver insightful, honest, and pointed help with everyone’s problems, but sometimes your loved ones become too dependent on your help because it is given so generously and so freely. You love being needed, so there is that tendency again to do more than you should. Yes, it is easier to have someone else – namely you – solve a loved one’s problems, but you can’t do this each and every time. Reserve your involvement for those important times when someone is struggling and truly needs your help. There could be a very serious family matter concerning money or shared property this year. If you intervene in this, you could serve as the voice of reason in what could be a very complicated and conflicted matter. Your even tone and sense of justice will prevail if there are arguments among family members. Do your best with this, but don’t allow it to become stressful. A happy outcome for all is possible. Later in the year, you may find yourself torn between family members at holiday time with everyone wanting you to share their company. Since you can’t be in more than one place at the same time, why not consider inviting everyone to your place and start a new family tradition if that’s not something you are already doing. If you are - it’s time to remind everyone of that.\n\n\nCareer\n\nYou have, in the past, had a lot of big dreams that you became passionate about, launched, and then lost interest in. This year, your challenge will be to run with a project that has recently left the starting gate. You have many brilliant ideas, Libra, but sometimes your follow-through is questionable because you tend to get distracted and lost in new ideas. So, this could be an excellent opportunity to work on that and see how well it could pay off if you are committed to working it through to the end. Last year, there may have been a promotion that was not received that you felt you earned or some recognition that you thought you deserved that you did not receive, and the sting of that may still be there and may still hurt. This year, though, the reward for what you missed will come back magnified, and you will see that your experience was worth the trouble and that the time you invested in this was not for nothing since the payoff should be very rewarding. Don’t lose sight this year of a goal you came up with last year, only to set it aside because of a lack of time or a lack of interest on the part of a potential partner. This year, even if you have to approach this goal differently, you will have many chances to tap into the resources, guidance, and assistance that you need to take this all the way. This can be a very productive year for you with your career or business, and if you start out by recognizing both your strengths and weaknesses as honestly as you can, you can get to many significant achievements. "
  },
  "pisces": {
    "content": "Emotional, magical, intuitive, and kind – there are not enough positive adjectives to perfectly describe your mystical nature, Pisces. You are deeply compassionate and caring, and you make friends everywhere you go. You have probably had people tell you throughout your life that there is something about you that makes them feel instantly at ease. You are an immediate friend to strangers, someone who is capable of tapping into the true nature of someone and understanding what makes them tick. Your friends are from all walks of life because you are non-judgmental and open to a wide framework of interests and passions. At times, Pisces, you are overly trusting, and this inclination has probably gotten you into your fair share of trouble throughout your life. You are also a big dreamer and prone to being a bit unrealistic at times. Remaining grounded as you fantasize about the possibilities for your life will help you succeed at whatever you choose to do in 2020. \n\n\nLove\n\nYou are a hopeless romantic, Pisces. In a love relationship, you are nurturing, extremely generous, extremely loyal, and a very passionate lover. Because of your powerful intuition, you can feel what your partner feels without having to be told, which means that you are very supportive, loving, and giving, tuning in to exactly what is most needed at the moment. Because you are quite expressive, you are fabulous at showing affection and sharing your deepest thoughts and emotions. You are devoted to both your family and your friends, and whenever a loved one has a problem, they know you will be there to dry their tears, give them hope, and help out in any way that you can. This year, if you are attached, you may be dealing with a relationship that has been fractured in the past. Although this may have been broken off before, you may be intent on making it work and doing everything you can to ensure a happy ending. This has great potential because you should find that you and your lover are more on the same page than you have ever been before. If you are single, you may be struggling with letting go of an old relationship that brought you far too much aggravation or heartache. Take your time to heal, and don’t jump into anything serious too quickly. You need time to put things in the right perspective before you can move on to looking for the love of your life. \n\n\nFamily\n\nFamily is important to you. And just as you are with your friendships, you are devoted, caring and supportive. You are a strong communicator, Pisces, and you often wear your heart on your sleeve. With family, this is even more so because you don’t have the same boundaries as you might in a friendship. Sometimes, though, this can become problematic, because you say whatever is on your mind without editing it first, and that can lead to misunderstandings and conflicts. Sometimes you share too much too soon with family members, opening yourself up to judgment. And when you are judged, it affects you profoundly, often causing you to distance yourself from your critics. This year, there may be the continuance of an estrangement that happened some time ago. You still don’t see eye to eye with this individual, though you wish that it could be that way. Well, it can, Pisces, but it will certainly require some flexibility and some compromise on your part. The choice is yours. An impractical idea of yours may not go over well this year. But it is up to you whether to reveal this plan early on or wait until you have something to show for it. If you wait to reveal what you are hoping to do and get started, you will have validated yourself, and that credibility will inspire confidence from others. \n\n\nCareer\n\nBecause you are such a dreamy sign, Pisces, it is imperative that you choose an occupation where you can be creative. It better be a profession that you feel passionate about, or you will become sidetracked and uninterested – and you won’t put your all into it. Once you do find work that you love, you are dedicated, driven and determined to do your best by pouring all your effort into it. Money is not a driving force for you, and that means that you are not always compensation-driven in your career or budget-conscious in your business. But this also gives you the freedom to choose the work you do out of love and passion, rather than out of desire for monetary success. When you don’t have a passionate interest in whatever you are working on, it can be difficult for you to stay focused. This year, you should have a lovely share of enjoyable work to concentrate on. This could mean an extreme amount of creative freedom, which will keep you in your happy place most days. If you can develop a close bond with someone who is a source of this work, it could keep coming throughout the year. One very special assignment could test your imagination to the limits, giving you the freedom to be very adventurous in your creativity. This may even be award-level work that will win you admirers and great new opportunities."
  },
  "sagittarius": {
    "content": "Fierce Sagittarius, not only are you brave and overflowing with confidence, but you are also highly pragmatic and efficient as you take on the world. There isn’t much that can scare you, but even when there is a reason to be afraid, you charge forward anyway determined to master any challenges you may face. That’s not to say that you would get swept up in a pointless drama just to show the world who’s the boss. No, you are much more discerning and judicious than that. You choose your battles wisely, but when you do, you are in it to win – and you are not likely to back down. You are very straightforward and painfully honest, which can be intimidating to some. If someone who knows you well asks for your opinion, they know they will get the unvarnished truth. Some might call you tactless for this facet of your personality, but someone has to be the voice of reason, right? And you also happen to be quite philosophical and spiritual with a strong moral code and ethical nature that knows the difference between right and wrong. In 2020, you will have several chances to show those around you that having realistic, no-nonsense perception is not a bad thing and can actually be quite advantageous. An exciting year is ahead of you, Sagittarius.\n\n\nLove\n\nYou are a faithful and exciting partner in love and romance, Sagittarius, but getting to the point of a committed relationship can be a challenge for you. You are a naturally skeptical person, and someone has to prove themselves before you will fully take a chance on love, and even then, you may keep one eye open at all times just to see if you were right to completely trust this person. Once you do, though, you are a fun and delightful partner who has a way of making life interesting every single day. Because you are so forthright, and because you don’t wear your heart on your sleeve, some may perceive you to be cold. But when you love, you love deeply. This year attached Sagittarians can expect a very harmonious time when you are at your best, which then inspires your partner to be at their best. And when you are a part of any kind of good team, you are invincible. You can expect many romantic moments, and perhaps you may wish to plan an adventurous trip to someplace exotic. Or better yet, you may want to consider a cruise where you can have a lot of romantic one-on-one time while enjoying good food and drinks. If you are single, this could be a pretty thrilling year. If you are looking for love, you may have felt a spark for a certain acquaintance. This year, you may have the chance to get to know this person better, and it could bloom into deep affection and love. \n\n\nFamily\n\nYou are cheerful, upbeat, kind, and friendly. That’s why you make such a great host or hostess and why family holidays are often held at your place. Because one of your mantras is “live and let live,” you don’t often find yourself in the middle of family arguments as others might. You are very family-oriented, and you are often at the center of any big family decisions because of this and because of your practical nature. However, because you are so straightforward, your guidance and advice can sometimes be taken the wrong way. At the beginning of this year, you may be dealing with some fallout from an argument involving one or more family members. This could probably be easily resolved if everyone would just sit down and have an open conversation where everyone can calmly and openly voice their opinion. But there may be some stubbornness involved. Do your best to bring this topic into the light so that you can get everyone on the same page, or it could fester until it becomes a gaping chasm between you. A happy announcement could come around spring with some special honor connected to you. There may be a lot going on with a money matter that is related to a sibling or someone who is close to your age. Deal with this carefully, or there could be hard feelings that will carry through for the rest of the year. This is a sensitive issue, but with kindness and understanding, you can find a way out of it. At the end of the year, there could be something big to celebrate that everyone in the family will enjoy. \n\n\nCareer\n\nMoney and career are both very important to you. In fact, Sagittarius, at certain points in your life, these two things become your main driving force. You are extremely goal-oriented, and you work tirelessly to reach your objectives. Success may not always be easy for you to achieve since you can occasionally misjudge your moves because of overconfidence, but once you find your rhythm, you are unstoppable. You are a saver, and you manage your money pretty well most of the time. Therefore, once you set your sights on a certain lifestyle, you can certainly achieve it in time. This year, there may be many opportunities to get ahead, particularly in matters that involve acquiring new business or new clients. You may take on a lot more work this year that could bring about an expansion of your role and the possibility of being promoted if you work for someone else, or facilitate expansion of your business if you are on your own. You are very much about broadening your horizons this year, which will be good for you on many levels. You can achieve greater financial security, and you can also satisfy your love of adventure because some of what you do will be quite exciting. Just keep in mind that maintaining a strong family and social balance while you climb the ladder is also very important to your well-being and to your success. "
  },
  "scorpio": {
    "content": "You, Scorpio, are often referred to as the sexiest sign of the zodiac – but there is oh so much more to you! One of your most defining characteristics, and one that others may not even bring up, is your enduring strength and determination. So, if this is so symbolic of you, why wouldn’t it be the first thing anyone might notice? Because you are so private and so secretive that you don’t often share those personal things about you that would demonstrate that strength. Your magnetic charm is what stands out the most, perhaps because people tune in to that instantly. And to go along with that, you happen to be quite a passionate person too. At times, when you don’t keep yourself in check, your passions can lead to jealousy and possessiveness, but the older and more experienced you get, the more control you gain over those emotions. You are an interesting personality, Scorpio, and you draw in a wide range of people as friends and lovers. You are also intelligent, focused and intuitive, and these traits make you very good in whatever type of career or business you choose to go into. In fact, money, power, and success are driving forces in your life. Your unique blend of characteristics means that you can achieve success in whatever you choose to do with your life. In 2020 you would get many chances to work on these aspects and become a better version of yourself. 2020 can easily become a self-discovery year for you.\n\n\nLove\n\nDespite your sensual reputation, Scorpio, you are a faithful person. Yes, it is true that before you find “the one” you may play the field quite vigorously. But once you do find that one person that melts your heart, you are trustworthy, loyal, and faithful. Even though you have a strong commitment to your partner in love, you happen to be very independent, so you must always remind yourself to show the love you feel – and be expressive of it consistently. Your passion, your seductive charm, and your intensity mean that you probably have a very exciting love life, whether you are involved in a long-term romance or whether your connections are more casual at the moment. You can have a very satisfying romantic relationship if you keep working at it, despite your tendency to have trust issues. Once you do grow to trust someone, you need to remind yourself not to go looking for reasons not to trust this person. You may take a long time to open up in all of your relationships, including in love, but once you do, you form deep connections. And when you fall for someone, you fall hard. This year, if you are unattached and looking, you may have that experience. That is certainly something to look forward to because having a strong and satisfying relationship is very important to you. Take your time allowing this relationship to evolve, and enjoy the dance of courtship that you are so good at. However, at some point, there may be a call or a message from a former flame that didn’t work out all that well. Be clear in what you feel about that so there are no misunderstandings. If you are attached, there may be a family-related matter that could pull you and your partner in opposite directions this year. You may each be torn by some other faction of the family, but this can be reconciled with enough patience. Your loyal nature will guide you in how to handle this successfully. If you can overcome that hurdle, your romance should blossom beautifully this year. \n\n\nFamily\n\nNo matter what is going on in your family life, you are always dedicated to your loved ones, protecting them with great love and devotion. You are intensely loyal to family, and you abhor anyone who might have anything negative to say about a family member. That does not mean that you don’t occasionally find fault with family members or that you don’t experience disagreements. If anything, such arguments could be very intense because of your passionate nature. But when you remind yourself how important someone is to you, you are more easily able to forgive a relative than you would someone else. This year, there could be some sibling rivalry if you have a brother or a sister who has been jealous of you in the past. A significant achievement you make this year could cause trouble between you and a sibling, or perhaps someone else who is like a sibling to you. This may involve jealousy, but showing your love and how much you care can neutralize this conflict. Also this year, some family member who is very important and very close to you may return from a far-away location – perhaps moving back to the area where you now live. This could be wonderful and welcome news for you. An estranged relationship could be repaired this year if you are open to someone’s late apology. \n\n\nCareer\n\nYour natural personality combines many elements that make you perfectly suited for being professionally successful whether you choose to work for someone or do something on your own. Your creative mind enables you to come up with unique ideas that no one else would ever think of, and you are so diligent and driven to succeed that you have no trouble putting your ideas into action. You are someone who does not give up easily, Scorpio. Your natural resiliency means that you do not get discouraged by disappointments or failures – you just keep trying, again and again, if necessary. You are honest and professional, and anyone dealing with you on work or business-related matters recognizes this immediately, which brings great confidence to your relationships. You happen to be a very observant person as well, which means that you are always on top of what is working and what is not working so that you can constantly perfect and refine your approach. This year could bring substantial success with an idea you have been incubating for quite some time. You haven’t put it off because you were procrastinating – you have been designing it in your mind for a long time, and you are finally ready. And, Scorpio, the time is right. This may preoccupy many of your thoughts and much of your time this year, to the exclusion of other things. If you do have other obligations, you must find a way to keep them afloat while you pursue this, or you could cause yourself unnecessary difficulties in other areas of your life. You may also have the chance to invest in something that could be quite fruitful, though you may not be fully convinced that others involved are well-suited for what they are doing, and you may find that your personalities clash. However, you are good at setting that aside and recognizing that it’s just business. You can make leaps and bounds this year in your career or business, so start early and make the most of the dynamic energy that surrounds you. "
  },
  "taurus": {
    "content": "On the surface, you are tough and powerful. Some may even be intimidated by your commanding presence. Even without saying a word, you can often be perceived as someone who shouldn’t be challenged. But to those who know you, Taurus, you are a warm and fuzzy softy. You have a weakness for a sob story. If someone needs help, you are one of the first to show up and stand up for those you care about. You are reliable, practical, and exceedingly strong-willed. You are also quite loyal and highly ambitious. You tend to be very careful with your finances too, which may be why you are good at building your finances efficiently. And when combined with your powerful persistence, determination, and your big ambitions, you are someone who has the potential to be quite successful. Finding success is very important for the Taureans, and a materialistic tendency can get in the way of relationships. But if you keep things in perspective, you can have the best of both worlds. \n\n\nLove\n\nYou have an eye for beauty, dear Taurus, and you are often first attracted to a love interest based on their sometimes superficial appearance. This is true for many people, but you have an especially powerful attraction to beauty – so much so that it could even be described as one of your weaknesses. This strong allure has probably gotten you into trouble romantically speaking in the past, because you may have overlooked some undesirable qualities in a potential partner because you were dazzled and swayed by their beauty. When you find the right person though – by searching not just with your eyes but also, and most importantly, with your heart, you have the potential to have an incredibly rewarding love life. You are loyal, generous and nurturing, and these are desirable qualities that anyone would find appealing. This year, if you are attached, you may find yourself trying to form a closer bond with your mate. There may have been some struggles and some disagreement over the past year that created some distance between you. This is an uncomfortable feeling for you because you are at your most happy when your union is secure and harmonious, and when it is not, everything else in your world is affected by this. If you work at tuning in to your lover with tenderness and frequent expressions of your love, you can build back any bonds that were broken, and not just get back to where you were – but to soar even higher in your connection with your partner. For Taurus people who are single, you may have searched for the love of your life intensely last year, only to come up empty-handed. That may have been because there were some personal things that you needed to resolve before you could ascend to the peak. But this year, if you are in touch with your highest self, sending out vibes to the universe that you are ready for the perfect partner, you could draw in someone who will be extremely fitting. Just keep in mind that starting out slow would be the best course of action for you, rather than rushing in like a bull in a china shop. Take your time to be sure you are fueled by the fires of love and affection, rather than simply by the desire to find a connection.\n\n\nFamily\n\nYou may be known as the dependable one in your family, Taurus, and the one who will show up when no one else will when someone is in need. Because of this, family members may often gravitate to you first when there is a problem or a need for assistance. Naturally, there are authentic situations where a loved one needs your help, and you are happy to provide it. But then there are also times when there are relatives who will try to take advantage of you because of your generosity and dependability. Last year, that may have happened once too often, and you may be justifiably cynical now about helping as readily. This may have even extended to where you have avoided certain family members or avoided certain family gatherings. But enough of that! Your family is too important to you, and you can’t let a few bad apples spoil the whole barrel! You know how that goes, Taurus. This year, you have to overlook any negatives and embrace the many, many positives of your family life. Getting back into the swing of family involvement will bring great joy to your heart, and trying not to let the little annoyances drive you will, in turn, mean a significantly greater feeling of comfort and happiness in your life. Work on that. A younger relative who may see you as a mentor may rely on you heavily this year. Although you may not have a lot of spare time, doing what you can to guide this person can be very rewarding for both of you. \n\n\nCareer\n\nOver the last year, because of some possibly fractured family relationships or a general state of skepticism, you may have poured a lot more of yourself into your career or your business. That’s really saying something because you are very ambitious and driven as it is. Because of this, you may have made serious strides in your career  and/or started some amazing ventures that are still in need of your attention. This year, you may be more inclined to do things for yourself personally – not just spending time with family and friends, but also indulging in interests and hobbies, learning something new, and perhaps becoming involved in some creative ventures. You can have it all in this way in 2020 because you will find help where you need it and when you need it throughout the year, so things should run along very smoothly. At the end of the year, a very significant opportunity could come your way that will cause you to want to drop everything else and concentrate on that chance. This could be very good for you, but be sure that you don’t let your relationships slide – and don’t lose sight of those personal joys that make life worth living. You can achieve fantastic success late in the year if you play it right, and make sure that balance is always on your mind to keep it real."
  },
  "virgo": {
    "content": "To say that you are a perfectionist, Virgo, would not be a perfect enough description of you. That’s because there is so much more to you. Yes, you are highly analytical and a perfectionist, sometimes to an extreme, but that’s only because you are someone who believes in always putting your best foot forward – and what’s wrong with that? You can be opinionated and you have no trouble speaking your mind, but you are also willing to engage in an open conversation, and you are helpful to anyone who needs your assistance. You can be a bit nitpicky at times, but you are also extremely generous and giving of your time, your knowledge, and your resources. You have an excellent sense of humor, and you put people at ease with your genial manner. Even when you don’t agree with someone, your endearing warmth and charm mean that you can get along with pretty much anyone, even if you are on opposing sides of an argument. No matter how worldly you are, there is always an innocence and purity about you, which can be quite beguiling. This year, these qualities will come in handy and will allow you to advance in both your professional and personal goals.\n\n\nLove\n\nAt the core of love for Virgo is the perennial need to feel safe. Ironically, to find that sacred place, one must first be vulnerable – and Virgo people are not fond of feeling that way at all. You rarely express your deepest feelings, except when you have reached a certain level of trust and intimacy in a relationship, but the catch is that getting there can be a rocky path. You are just as methodical in approaching love as you are in the way you approach everything else in life. You may have a set way of seeking out or maintaining a love relationship, but you have to learn to be more open and flexible in your ways, or you could wind up alone for long periods of time. Trust comes fairly slowly to you, so any potential partner needs to be patient and reassuring in order to build your confidence and get you to open up. But once that happens, you are in it for the long haul. You are drawn to a connection that is safe, steady, and predictable. This year, single Virgo people may need to work more on opening up. You need to try to feel trusting even if it does not come naturally to you. You can trust until there is a reason not to trust, but that may be hard for you. If you can rise to the level of being more open and more giving and revealing of how you feel, you could meet a special someone by the end of the year. But you are not someone who moves quickly, so the relationship may need some time to stabilize in order to give you the sense of security and stability you crave. If you are attached, the same applies. You can improve your bond with your significant other this year by working at being vulnerable, sharing more of what you think and feel, and by being more flexible in the way you are in your relationship. But all of this is certainly possible, and the energies throughout 2020 will be helpful in that regard.\n\n\nFamily\n\nIn all of your relationships – including family and friends – you are often the one that others turn to first when there is a problem to be solved, as this is something at which you excel. This often opens up the way for a great bond of trust and reliability, and everyone appreciates knowing there is someone they can lean on. You are bound by tradition, enjoying the sense of family closeness and the same experiences year after year that keep you connected to those you love. You are highly dedicated and nurturing to your family, and you are the one who will always look after an elderly family member or a relative who needs care and attention. You are also inclined to have long-time friends who become like family over time. This year, there may be a big and exciting event connected to your family life. This could be something like a fun-filled and spectacular wedding or perhaps the birth of a new family member. There may also be some excitement connected to a family enterprise, which will thrill you to no end. The question of a change of residence may have a huge impact on your family life this year, and although there may be some conflict over this, it should all work out in a way that makes everyone happy – but this conclusion may take some time to resolve. Despite some tribulations that you may experience this year, overall, Virgo, this can be a very gratifying year for you where your family and home life is concerned. \n\n\nCareer\n\nAs anyone who knows you might guess, you have an impeccable work ethic. You are systematic and highly organized. You are practical and reasonable when it comes to risk-taking. You are hard-working and consistent, and with your analytical nature, you are great at assessing what needs to be done to safeguard success in any work-related situation. You are also quite good at figuring out the source of a problem and solving the problem. Because of your desire to do things your own way, you are probably happiest in a situation where you are in a management position or running your own thing. Because you may have a tendency to be frugal, you will never authorize impractical spending, so your work-related finances are always under control and properly managed, wasting nothing. The downside of this is that you may be perceived as cheap – but if you work on balancing this out and see that sometimes spending is essential to making forward motion in business, you will strike the right balance which will work out great in the end. This year, Virgo, you may have some opportunities come your way that are not conventional. This may give you cause for pause because you simply don’t like big risks. But if you analyze these carefully, you should see that these chances are generally pretty safe, and with the right framework, you can find imminent success. There may also be a question of an error in your budget, which probably didn’t happen under your watch. You may become suspicious, but odds are that you will find this was just a clerical error. Overall, you can make steady progress with consistent hard work, which you are surely capable of. However, you would do well to recognize that all work and no play too much of the time can drag you down and make you less productive in the long run – and that would be unacceptable to you!"
  }
}