{
  "name": "Apple Tree",
  "description": "As a fruit-bearing tree, the Apple Tree is symbolic of love, creativity, magic, youth, and immortality. Enticing and lovely to look at, Apple Tree people are able to cast love spells on others - sometimes unintentionally, when love isn't even on their minds. Given their leaning toward love in all of its splendor, Apple Tree people are usually very sensitive and sentimental, and love interests them both in theory and in practice. Even when they make a marriage of convenience, without feeling deep love for their partner, they rarely give up on romance. They are always faithful in love, both before and after marriage. And when they do meet their soul match, their marriage experience is divine.\n\nPhysically, Apple Tree people are often petite, with a smooth and youthful complexion. They are typically very easy on the eye. As attractive as they can be in appearance, their personalities are just as appealing. Charming and warm-hearted, these people are unselfish, guileless, and occasionally reckless - and therefore very easy to deceive. They are always eager to help others, and would share their last piece of bread with a stranger. However, despite all the above, they are not fools.\n\nApple Tree people tend to live in a moment, without preoccupying themselves with thoughts or fears of the future. Because they embrace the present, they may occasionally incur debts and then forget all about them.\n\nThis is a sign of daydreaming philosophers, whose only goal is to enjoy life - although they are not forceful and don't feel the need to convince others of their beliefs. At the same time, Apple Tree people are not light-headed. They are intelligent, savvy, logical, and very science-oriented. When interested in any specific field, this sign will research and read every single thing related to the matter. The amount of knowledge these people possess is enormous, yet they do not study or accumulate knowledge to impress anybody; they study purely to satisfy their curiosity.\n\nWith their unique leanings toward both science and mysticism, Apple Tree people are quite well-rounded. Scientific theories interest them just as much as good cuisine appeals to them. This sign prefers to enjoy life in the moment, rather than waiting for the afterlife and fantasizing about heaven. To them, heaven is in the here and now.\n\nIf there is any potentially troublesome aspect to Apple Tree people, it is that they crave variety in their emotional life. They find monotonous, flawless happiness rather tedious, despite their free-spirited personalities. When bored, people of this sign tend to complicate their lives and create unnecessary problems for themselves. Overall, though, Apple Tree people crave and create harmony, and generally believe in the goodness of mankind."
}