{
  "name": "Cedar",
  "alternative": "Kartas, Hackberry",
  "description": "The strong, magnificent Cedar has a revered history that dates back thousands of years. According to legend, its aromatic red wood was used in the construction of Noah's Ark, the Ark of the Covenant, and the cross on which Christ was crucified.  This stunning beautiful tree, with its unmistakable silhouette, is associated with healing, cleansing, and protection against evil. Cedar Tree people are also beautiful, but despite their attractive appearance it is not their beauty, but rather their strength of mind that impresses others.\n\nConfident and self-reliant, this sign can feel like home practically anywhere. Cedar people can adapt to any situation and find the perfect solution to even the toughest, most complex problem. Although Cedars feel no particular need to be admired, their dedication and hard work bring them plenty of admiration.\n\nMost signs are drawn to Cedar Tree people. They seek out the Cedar's advice, value its opinions, and feel privileged to do favors for Cedar people. And that's fine, because Cedars like to be in a spotlight. They believe that they have a right to have the last word in any given situation.\n\nCedar Tree people can be tyrants, but they are a very trusting kind. They will never bother to look over anyone's shoulder to see that something has been done exactly as demanded.  When dealing with others, Cedars often abuse their power, but they do so unintentionally. Because they are unfamiliar with modesty, shyness, and the lack of self-confidence, they may have many bullies. Even well past teen age, Cedars can hurt somebody's feelings or put someone down just to have a good chuckle. However, at the same time, Cedars are afraid to become an object of derision themselves. They will never forget anybody who has ever dared to make fun of them.\n\nCedar people are very self-assured, which is their greatest advantage and, at the same time, their greatest disadvantage. No matter how difficult the situation may be, Cedars never ask for help. In fact, they are great at finding trouble. Obstacles not only make Cedars stronger, they make them believe that they are unbeatable. Cedars are extreme optimists. They prefer to go with a flow because they always believe in a positive outcome. When Cedar Tree people take a matter into their own hands, they put all their energy and heart into it."
}