{
  "name": "Chestnut Tree",
  "description": "The nourishing fruit of the Chestnut Tree is symbolic of fertility, abundance, longevity, and invigoration. The Druids used the branches from this tree to craft handles and staffs, thinking that touching them would bring longevity and rejuvenation to the bearer.\n\nChestnut Tree people usually possess a unique and exquisite physical beauty, but they rarely use it to their advantage. They prefer an honest, straightforward approach and resent any sort of flirtation.\n\nChestnut people have great potential and enormous life energy, but unfortunately, they don't always use it wisely. From their early years Chestnuts develop a very strong sense of justice; however, they often let others manipulate them or they simply become victims of their own delusions. That is why, before fighting for somebody's rights, Chestnuts should be extra cautious and double check whether the battle is legitimate and worth fighting for.  Chestnuts live by the saying \"everything is fair in love and war.\"\n\nChestnuts use all of their resources to obtain their goals. They do not favor compromises. They prefer a much more straightforward approach. Because of their aggression, others may feel hostile towards Chestnuts.\n\nChestnuts don't trust people easily. They usually stick to their old and already proven friendships. They rarely change their jobs or life partners. Instead of seeking new relationships, Chestnuts prefer to improve the ones they already have.  Chestnuts usually have to go through an emotional rollercoaster of worries and disappointments. But a negative experience can scar them for life.\n\nChestnuts tend to keep their actions under control. They stick to their opinions. However, they are not stubborn. These are people of very high moral standards which they follow religiously.\n\nChestnuts need a solid material base, because their mood fully relies on their comfort. During their entire life, Chestnuts constantly need to feel loved. However, they only fall in love once. Their unreasonable demands mixed with the fear of losing their partner can complicate their love life a great deal.\n\nChestnuts are predisposed to philosophy. Their intellectual side is more developed than their senses. Chestnuts remain a mystery to others; only their close friends and family know how courageous, down-to-earth, and organized they are."
}