{
  "name": "Jasmine",
  "description": "The Jasmine bears richly fragrant flowers that bloom at night. They prefer warmer climates, as they can be fragile. Likewise, Jasmine people are very sociable, amiable, and easy going, but delicate at the same time. Their natural kindness and good spirit attracts people, because Jasmines are always happy to share their positive mood with others.  Only Jasmines' closest friends know how sensitive and fragile these people are. The rest of the world perceives Jasmine people as cheerful, carefree, and spoiled children of fortune.\n\nJasmines prefer to hide their worries deep down inside. When it comes to interacting with others, Jasmines have a natural and easy way about them. In reality, though, they carefully choose every single word that comes out of their mouth.\n\nJasmines long for harmony. They will do whatever it takes to maintain a peaceful environment. However, at home Jasmines turn into completely different people. They often mistake selfishness and indifference for independence.  In the worst case scenario, Jasmines will only turn to their family while in desperate need, which may alienate them on occasion.\n\nJasmines are very responsible people. They try not to put themselves in danger; they avoid rushed actions. They never blame others for their own mistakes. Jasmines are comfortable modeling their lives after stereotypes and highly value any kind of traditions. They use their parents' relationship as a model for their own marriage, even if their partner objects to this kind of example. Jasmines may fail as spouses, but they would always remain excellent parents. Children are their biggest joy in life, and their biggest hope. Many people born under the sign of Jasmine become pediatricians or school teachers.\n\nJasmines are not especially materialistic, but they always end up having enough money. They are true workaholics who are rewarded for their efforts.\n\nIn order to be happy, Jasmines need to learn to diminish their selfishness and work on their intuition. Although they are pessimists, deep down inside Jasmines know that everything will turn out alright.  If a Jasmine Tree person can find someone who can help them to become a little more optimistic and show them the true beauty of life, they will remain faithful to them for the rest of their life. "
}