{
  "name": "Linden",
  "alternative": "Lime Tree",
  "description": "Bees are drawn to the lovely Linden Tree, and the honey produced from this tree is considered exceptionally good. That's why the Linden was once considered sacred. This tree is symbolic of divine power and luck. Its heart-shaped leaves remind us that it also represents love. Linden people are very pleasant and amiable, and they are well aware how charming they are. They know how to impress and draw people's attention.  When it comes to others, they have great insight into personalities. At the same time, however, they are quite clueless about themselves.\n\nThe Linden Tree person's greatest desire is to live an easy, joyful, carefree, and luxurious life. They ultimately want to achieve a peaceful existence with the chance to simply be lazy. However, if they do achieve these goals, they may suddenly find themselves miserable.\n\nLinden people are often shy. They are pensive people with a tendency to worry for no reason. They rarely have any specific life goals, but when they do they will easily sacrifice their dreams for their loved ones. Linden Tree people are also very free-spirited. When dealing with an obstacle, they usually don't bother trying to overcome it. Instead they will take a detour, and along the way, they may forget where they were heading.\n\nTragically, Lindens can live their entire lives swept up in an utter feeling of sadness; the problem is that they may do nothing to help themselves climb out of this situation - though of course this trait can be changed. Linden people tend to have mood swings, and their feelings are unpredictable. Within a very short time period Lindens can go through a full spectrum of emotions, which can vary from despair to extreme contentment. All these qualities make it nearly impossible for others to understand Linden. Ironically, though, when it comes to interaction with the rest of the world, this sign can be very amiable and comforting.\n\nA Linden Tree person usually has no desire to become a leader.  He or she is more preoccupied with being likable, rather than focusing on becoming powerful. It is more fun for Lindens to establish a close friendship than to boss others around. Linden people are not always the most reliable, but they compensate for it with their niceness. When dealing with daily routine, Lindens are very practical. They enjoy coming up with new, untried solutions.\n\nLinden Tree people can be especially lucky in love if they can be more maternal than their partner. They like to feel responsible for their significant other. And although they have high self-esteem and great self-respect, they can be very suspicious and jealous, sometimes without any reason. "
}