{
  "name": "Mountain Ash",
  "alternative": "Rowan",
  "description": "The Mountain Ash is a slow-growing tree with dark green leaves that turn orange and purple in the fall. In the spring, tiny white flowers appear, followed by flame-red fruit that is beloved by birds. This ornamental tree's pleasant appearance is the perfect expression of the Mountain Ash person's charm and even-tempered nature. These people always seem to be in a good mood, which they happily share with the rest of the world. Along with their friendliness, Mountain Ashes possess an incredible talent for self-control. They can never bring themselves to bug others with their problems.\n\nMountain Ashes have both dignity and respect for others. They are independent and a bit self-centered, but they will never allow themselves to bring anybody down. They always know when they should give in, and when they should stand their ground.\n\nMountain Ash people tend to be \"over-thinkers\" who like to calculate every single step. They get very upset when something gets out of hand, as they tend to take all the blame when something does not go according to their plan.\n\nDespite their many positive traits, Mountain Ashes are not that easy to deal with. They make it hard for others to relax and feel comfortable around them.  Mountain Ash people lack simplicity. They will listen to a person and they will be very attentive, but will then bring up every single slip of the tongue, notice every imperfection, and point out every error. This sign detects every single flaw. They will forgive people for not being perfect, but they will never forget. A simple conversation may feel like a constant test. Even so, Mountain Ashes always try to find an explanation or an excuse for the failings of others.\n\nMountain Ash people seek ultimate beauty and they long for perfection. At the same time, they will never turn down a single soul simply because they are far from being ideal.  Mountain Ash people are honest, loyal, and very reliable.  Sometimes they are so naïve they let others manipulate them.\n\nPeople born under the sign of the Mountain Ash are extremely generous with their loved ones; they give it all, but they are very demanding in return.  Mountain Ashes will never cope with betrayal. Once disappointed, these people can never forgive.\n\nMountain Ashes like to set a goal for themselves that they may never accomplish, because they let their daily routine get in the way. As control freaks, they sometimes lose their grasp on the big picture because they get too preoccupied with what's going to happen tomorrow. Mountain Ashes are very demanding perfectionists, which scares some people away. But if they learn to relax and take it easy, they can achieve a lot."
}