{
  "name": "Nutwood",
  "description": "The Nutwood Tree is very adaptable. Its fruit can be cracked open and the seeds can be eaten. When the bark is burnt it creates a fine, black soot that can be mixed with oil and combed through the hair to darken it. And the wood of this tree burns exceptionally well as firewood. Likewise, the very interesting Nutwood Tree person has a nature that is quite contradictory.\n\nOn the one hand, this sign is honest, loyal, and very friendly, but can instantly turn into a self-centered egoist when they feel that someone is trying to infringe upon their rights. On top of that, Nutwoods tend to have all kinds of unusual whims that they may not even try to hide. At times they have extreme and unpredictable mood swings and can become instantly aggressive.\n\nNutwood Tree people can be quite unpredictable. One minute they are all lovey-dovey, and the next moment they can be cold and completely indifferent. This sign knows what buttons to push to manipulate the feelings of others.\n\nNutwoods truly enjoy being taken care of. They desperately need to be admired and even worshipped. When they don't get enough attention, Nutwoods may get frustrated and take it out on their loved ones. Also, they sometimes have a very jealous nature. They perceive each and every person as a potential competitor. All these traits make Nutwoods difficult and at times, unpleasant.  Nutwoods are often their own worst enemies; they tend to blow everything out of proportion and complicate their own lives. And, because their personality is unpleasant at times, they may not have a confidant to share their worries with.\n\nThe love life of the Nutwood person is also far from being smooth. Nutwoods like to dominate their partner, alternating meanness with endearment.  In order to find happiness in love, Nutwoods need to find somebody who will enjoy some level of suffering and be somewhat of a masochist.\n\nNutwoods are great strategists. While reasoning, they take into consideration the smallest details that other people may neglect. They can act quickly, but often they need time to think everything through.\n\nEven the modest Nutwoods want their lives to be rich and eventful. They are not afraid to take risks. Their inability to compromise makes them hard to deal with for some people, but Nutwoods don't care about that. They rely only on themselves, which can offend and alienate their loved ones, eventually driving them away. Those who appreciate their independent nature, however, will love them for what they are."
}