{
  "name": "Olive Tree",
  "description": "Throughout history the Olive Tree has played a significant role symbolically. Most famously, the olive branch is said to be an offering of peace. But the Olive also represents reward, victory, strength, purification, and fruitfulness.\n\nOlive Tree people are usually petite, and can be anything from very pretty to very unattractive. They love to bathe in the sun and they tend to feel sick and sad in cold weather. Olive Tree people have a very laidback, non-aggressive personality. They respect the needs and feelings of others.  The people of this sign may seem a bit indifferent, because they prefer not to get involved in other people's business. The truth is, Olive Trees are too considerate and tactful to be nosy. Often they don't offer their help because they feel that it may offend their friends and loved ones. When asked for help, this sign will gladly lend a hand.\n\nBecause of their amiable personality, Olive Trees are always loved and appreciated.  However, they choose not to have too many friends, partially because they are afraid that others may want to take advantage of them. Olive Tree people are good psychologists; they can easily put themselves into other people's shoes. They also make sure that everybody is treated fairly.\n\nOlive Tree people never give up, even in the most difficult situations. Instead of wasting their time on being sad and feeling sorry for themselves, they look for answers and solutions.\n\nEven though Olive Tree people may seem to be calm and easy-going, they are very passionate when it comes to love. Sometimes their affection grows into true dependence; but Olive trees are well aware of it and they try their best to avoid nagging and overburdening their partner with too much attention.\n\nOlive Tree people have very analytical minds; they spend all their time on self-education and they constantly keep learning new things. They usually achieve a lot in life. These people are very generous. They like to share everything they have: material things, their good mood, and their positive disposition."
}