{
  "name": "Willow",
  "description": "The hardy and flexible Willow bends without breaking. Its supple beauty is graceful and calming. Yet it is not Willows' looks that attract people; it is Willows' unique singularity that makes this sign stand out. Willow people are full of mystery and inexplicable charm, and that is the main reason why they are always surrounded by admirers.\n\nThe Willow Tree is usually associated with water, as it is often found in watery environments. Those creatures that typically surround water are thought to be more spiritually and psychically connected, and so many of the people born under this sign are highly intuitive, and they follow their intuition more than they would follow logic. The Willow Tree is a powerful sign, despite its fragile appearance.\n\nWillows are highly emotional and very responsive to physical sensations; they are very sensually oriented. They enjoy bathing in the sun, basking in the cool water, and inhaling exotic aromas. Willow Tree people are more inclined to trust their feelings than their logic. Although they seem to be gentle and defenseless, in reality they are tough and determined people. It may not always be obvious, but Willows are almost always pursuing a goal, which they tend to keep top-of-mind.\n\nWillow people are quite reserved; they don't like to order others around. At the same time, they can lose their tact unexpectedly and may say something they will regret later.  Remaining Willows' friend is not an easy task.  Willows don't accept compromises and never change their habits; even for the people they love the most.\n\nWhen it comes to asking for help Willows can be very persistent and straightforward; but as soon as their problem gets resolved, Willows would go right back into their dream state of mind. They will keep emotional distance with others as long as they are not in need. It may be very tempting to reach out and help a weak and dependent Willow; but it may turn out that Willow is only putting on a game. People of this sign are usually capable of dealing with their own problems, but what for? There are plenty of people willing to resolve Willow's issues!\n\nWillows despise dull, everyday feelings. They tend to blow things out of proportion; they tend to exaggerate every single emotion. Even if they don't admit it, Willow people are masochists. They yearn for heartache; they feed off the suffering; they thrive in separation. They would do anything to feel more alive."
}