{
  "description": "Cancer, the Moonchild, usually has a very conservative and home-loving nature. Like its mascot, the Crab, Cancer often likes to hide in its shell, finding inner comfort at home and making its house its most beloved fortress. Cancerians are very protective of their loved ones. They can be both shy and outgoing. They are very strong-willed and they like to get everything done in their own way. Cancerians need to learn to balance their emotions because they often tend to be overly sensitive and moody because they feel everything very deeply.\n\nOf all the signs, Cancer is probably one of the most devoted to family and family-like relationships. Cancer is sensitive and nostalgic and lives to enjoy family and friendship. Although there may be a lot of emotional drama when there is a Moonchild in the family, this person is usually someone that everyone turns to for a soft touch and kind encouragement. As a parent, Cancer is loving and devoted. And the parents of a Moonchild children are loved to the moon and back by them. As a sibling, these kids are often the mediators, smoothing over conflicts and bringing everyone together.\n\nThe Moonchild loves deeply and forever. Sensitive and sweet, this is someone who usually remembers every birthday, every anniversary, and every special occasion of any kind. Cancer is loyal, loving and sensitive to the needs of a significant other, but can be quite shy when it comes to public displays of affection. It may take a while for the Cancer to decide to marry, but once it happens it is usually for life.\n\nCancerians are often highly financially motivated and quite adept at maintaining a budget and getting ahead with savings. The Moonchild's career is very important because it is a way to achieve the security they yearn for - financially and personally. And this is also a dedicated employee who is trustworthy, hard-working, and eager to please. As a business owner, people born under this sign treat the business like part of the family, always nurturing it and staying on top of what it needs to remain successful.",
  "positive": "Kind, helpful and caring, sympathetic to need, domesticated, intuitive and protecting.",
  "negative": "Easily hurt, jealous and possessive, remains insulted, selfish and self centred, inward looking, overbearing, cranky and irritable."
}
