{
  "description": "Sagittarius is a noticeably restless sign with a deep love of traveling and exploring. Sagittarius people are open to anything new. This sign is all about expanding new dimensions of thought. They are perfectionists, but, just like their mascot the Centaur, who aims his arrow into the emptiness, Sagittarians may not always be sure what they are shooting at. Their mission to find perfection in everything could potentially cause this sign some disappointment, so they need to learn to be more carefree and not judge themselves so critically. Sagittarius's positive attitude and natural curiosity help to keep them going, and they rarely give up.\n\nSagittarians are always surrounded by family and friends - people of this sign love to laugh and enjoy deep conversations. Friends are almost always like family to the Archer. They maintain long relationships that often last forever and date back to childhood days. Sagittarians make excellent parents. They are energized and enthusiastic when it comes to involvement in their children's lives. They are devoted to their own parents, too - often planning family outings or hosting holiday gatherings. Siblings usually gravitate to this sign as well, because wherever Sagittarius is, life gets more exciting.\n\nSagittarians are fiercely protective of their independence. Many people of this sign marry later than average because they want to experience life to the fullest before settling down. When they do choose Mr. or Mrs. Right, though, they are good partners who place great emphasis on the happiness and well-being of their significant other. But even if they never marry, they tend to have long relationships that are marked by joy and good times.\n\nSagittarians usually approach their careers from a very practical perspective. They often know what they want to be when they grow up from a very early age. They choose careers that they believe will be secure, well-paying, and enjoyable too. After all, they will be working long and hard and they want to get the most out of their time and energy. Despite their pragmatism, Sagittarians can occasionally be risk-takers, investing in wild schemes they believe have merit. Many of the well-known entrepreneurs are Sagittarians. Their will power, paired with strong self-belief and keen intellect helps them succeed at any role be it as an employee or an entrepreneur. Ethics and morality are on the top of the list for Sagittarians when it comes to business with morality coming before wealth to them.",
  "positive": "Sensual, inspiring, spiritual, very happy, open and honest, doesn't hold grudges, full of enthusiasm, sees the best in others.",
  "negative": "Fears responsibility, impatient, a risk taker and gambler at heart, argumentative, has a lack of commitment, they believe in their talents and are highly disapproving of those who don't."
}
