{
  "description": "Because they are practical and reliable, Taureans place a very high value on stability and security (both material and emotional). Taurus people are very faithful and patient, but when they become angry, they can easily transform into an infuriated bull! Because they have a tendency to be too conservative, Taureans would be wise to learn to accept new ideas and adjust to new situations. And although Bulls can be extremely stubborn, it's that incredible determination that helps them to achieve their goals. The Taurean's kind heart, stable temperament, and constant devotion will always make their relationships very fruitful.\n\nSteady and sturdy, the Bull is often the one member of the family that everyone turns to when they need support or assistance. Taurus is kind and reliable, and always there when needed. As a parent, the Taurus is able to maintain a very even and low-key tone, which offers reassurance and stability to their children. The Taurean child relates to parental figures in much the same way - with consistent support and appreciation. A major difference comes in the sibling relationship, where there is often more of a competitive vibration - but when all is said and done, this is a loyal sign that cheers on and encourages siblings when they need a shoulder to cry on or inspiration to move forward.\n\nThe big strong bull can be shy and withdrawn when it comes to romance. Despite the appearance of bravado and self-confidence, Taurus people can be somewhat insecure when it comes to love. They are most drawn to outgoing people who make their feelings obvious. That way the Bull can feel self-assured of the other person's feelings. When Taurus marries, it is often for better or for worse. This is someone who will stick by a partner no matter what comes their way.\n\nAs in other areas of life, Taurus is very steady and reliable at work. This person is the one the boss can count on to get the job done. But because Taurus people lack confidence at times, they may not aim as high as possible, and often settle for less than what could be achieved. Taurus needs to constantly maintain the goal of high self-esteem to achieve a worthy role in the workplace.",
  "positive": "A conservative nature, reliable, faithful, calm persevering, patient, bright, smart, inventive, very loving, good at cooking and art.",
  "negative": "Obstinacy, embarrasses easily, lacks sensitivity, nothing to say, boring, slow to make progress, self indulgent."
}
