{
  "name": "Birch",
  "description": "The adaptable Birch is able to withstand very difficult conditions. This tree is often used to reforest areas that have been destroyed by fire. It is symbolic of purity, rebirth, cleansing, and healing.  People born under this sign are also very flexible and easy-going. They have very soothing personalities. Birch people are calm and tactful, and they are very considerate of other people's feelings. They never ask for anything and they never regret a thing.  They are consistent in their preferences, and they never seek out attention, but they always end up in the spotlight.\n\nEven though Birch people are soft and gentle, they will never allow anybody to take advantage of them. They may neglect some rules, but they know where to draw the line. Birch is capable of doing something shocking, but they will never do anything obscene.\n\nThis sign is quite indifferent when it comes to material security. Birches are not drawn to luxury or a glamorous way of living. They can find comfort in the simplest things. All that matters for Birch people is their job.  They need to work in a quiet and relaxing environment; otherwise they will feel rushed and pushed. They may seem to be a bit lazy, but they can easily make themselves do whatever needs to get done.\n\nBirch people are very sentimental, they are not afraid to express their feelings. They are happy in love, but their partner may underestimate the beauty of Birches' quiet and peaceful lifestyle. Birches are quick to get married; they don't need time to make sure that their feelings are true.  They tend to always make the right choice.\n\nBirch people have a very vivid imagination. They are very creative, when it comes to solving even the most ordinary problems. Birches possess many qualities that help them to achieve success. They are very talented beings with strong logical minds, and the extraordinary ability to accomplish any goal they set. Birch people may not have many friends.\n\nThe life of a Birch Tree person may seem to be a bit boring, but Birches are very talented when it comes to feeling happy, no matter what. They are capable of finding pleasure in the smallest and simplest things."
}