{
  "name": "Cypress Tree",
  "description": "Symbolically, the Cypress Tree stands for the role of sacrifice in life. Even though the characteristics that accompany this theme include mourning, death, and despair, this sign can also be symbolic of hope.\n\nLike the Cypress Tree that represents them, Cypress people are usually slender and strong, with a fine, unmistakable silhouette. Although their stature can be almost ordinary, there is something about them that is both stern and wild... like some wild creature from the wilderness that is untouched by civilization. At the same time, however, this sign can be very refined.\n\nKnown for being very adaptable, Cypress Tree people are generally quite low-maintenance and they can easily adjust to nearly anything. Because they can survive in any situation and even find happiness in it, they are usually very mature and independent from a very early age.  Usually quite happy with their lot in life, Cypress people don't crave success, nor do they hunger for money or recognition.  Their only goal is to be happy. They try to avoid problems and conflicts at all costs.\n\nCypress people have many interests. They adore taking long walks in summer, and they enjoy spotting all kinds of animals on their travels. They love to fish, and can spend countless hours just drifting and fishing by themselves. Even so, these people do not enjoy solitude, so they arrange their lives to be constantly surrounded by family and friends. Even though they have such a strong attachment to personal bonds, they are not sentimental. Cypress people can be a bit rude at times, but deep down they are sensitive. They are a study in contrasts: they can be harsh yet very calm at the same time. They radiate tranquility, and they can be quite pleasant.\n\nCypress Tree people are very fluid, in that they go with the flow rather than trying to organize everything precisely. They are dreamers, and their thoughts are often off wondering someplace else.  They are known for being adept at avoiding arguments, and others are drawn to their natural flexibility.\n\nCypress Tree people are absolutely loyal, remaining faithful to their friends, loved ones, and even their memories. They like to talk, and they can keep up with any kind of conversation. They spend their quiet and easy life among people they really care about."
}