{
  "name": "Elm Tree",
  "description": "The wood of the Elm Tree is dense and strong with a strong resistance to splitting, which may be why it is symbolic of strong will. It grows rapidly, and it becomes big, slender, and beautiful. Despite its inherent beauty, the Elm Tree can be very reserved, even though it easily attracts people.  Known for their simple, casual style, Elm Tree people are often quite sentimental and cannot bear to part with anything that holds a memory.\n\nEasygoing by nature, those of the Elm clan are very laid-back and they don't like complications in life. They are calm and even-tempered, and perhaps their only potentially negative trait is that they are sluggish. They also tend to like to preach to others, which can get to be quite annoying.\n\nDisarmingly generous, Elm Trees are open and straightforward. The people of this sign believe in good nature of all human beings, and therefore the endeavors they choose to get involved with are always of a noble nature. And although they are discreet, they secretly hope that sooner or later they will get much deserved acknowledgment.\n\nElm Tree people are very responsible; they are capable of achieving the impossible when it comes to supporting and protecting their loved ones. During those rare times when they don't succeed, they suffer from their own failures more than anybody else.\n\nWhen in love, Elm Tree people are very passionate and can in fact be fervid.  If a partner turns out to be a right person, Elm Tree people will create an amazing atmosphere where the love in their family will last for years and years.\n\nElm Trees prefer to be in charge because they hate to obey, and they are very skilled when it comes to managing others. Their demands on others are often as big as their love is.\n\nRegardless of their flaws, one should be very patient with this sign, because these devoted people are absolutely worth it! They are marked by a solid character, golden hands, a practical yet lively mind, and a strong sense of humor, which helps them to deal with any disappointments. Typically, the Elm Tree life is quite pleasant and stress free. "
}