{
  "name": "Fir Tree",
  "description": "The Fir Tree, an evergreen, was held in very high esteem by the Druid people. In the dead of winter, when the countryside was dull and grey and blanketed with snow, the Fir was one of those trees that brought color and life to the landscape with its very cold, austere beauty. The Fir is symbolic of friendship, resilience, perceptiveness, longevity, and honesty. Fir people are very sensory-oriented, and are drawn to dim lights and the aroma of perfumes.\n\nFir people love antique jewelry and other old things, and they enjoy being part of majestic celebrations. Despite this last attraction, and because they are capricious and not easy to live with; they often experience a strong sense of isolation and can feel lonely even among large groups of people. Those born under this proud and resolute sign do not give up until they achieve their goal. They are not likely to fall under anyone's influence; their discreet nature prohibits them from sharing their opinions and makes them seem rather gloomy at times – especially because they are rarely ever satisfied with what they have.\n\nFir people can be very demanding and hard to negotiate with. Knowing and understanding their true value, they always try to get the most out of life, and usually they manage to achieve it.\n\nIf a Fir Tree person ever falls in love, the experience shakes his or her world to its core. Their love can be truly unconditional. This sign is also very intellectual. Fir Tree people have very analytical minds that lean toward science, yet they don't always achieve significant success. Sometimes they end up working in some other area that has nothing to do with their interests or education. But whatever they do, they take their work seriously, and they can occasionally reach lofty heights in their work because of their scrupulousness and outstanding work ethic.\n\nWhen Fir Tree people have to choose between different options, they usually pick the most difficult path. That's because deep down they believe that it is their destiny to create difficult situations for themselves and for others. But whatever happens, Fir Trees are very noble, and one can fully rely on them. They remain optimistic through every endeavor, and never lose their faith. However, Fir Tree people usually neglect small things because they prefer to focus on the big picture instead."
}