{
  "name": "Hazel",
  "description": "Some people believe that eating the nuts from the hazel tree can create visions, greater awareness, and amazing insights into life. This unusual tree with its distinctive, curly branches is said to contain ancient knowledge. The Hazel represents creativity and imagination, and the Celtics held it in high regard as a source of artistic inspiration. Despite this unique tree's appearance and meaning, Hazel people are usually rather hard to notice at first glance. They prefer to keep it low key; they are calm, quiet, and overall, nearly invisible. However, if someone makes an effort to get to know them a little bit better, they will find Hazels to be very charming and full of virtue.\n\nHazel people don't get involved in conversations and rarely speak their mind but when they do, they draw the most unexpected and unconventional conclusions.  Hazels have their own opinion about everything. They can intuitively sum up a situation very easily.\n\nIn their youth, Hazels are sensitive and reserved. Later in life they acquire seemingly magic powers that allow them to masterfully manipulate others.  They become so skillful and adept at it that their ability remains completely obscure and unnoticeable to even those they manipulate.\n\nThere are two types of Hazel Tree people, and they are polar opposites:  the majority is warm-hearted, kind, and wise. At the same time, there are a few ill-minded villains who can destroy a person's life out of idle whim. These particular Hazels can be wrathful, irrational, and even cruel.\n\nWhen in love, Hazels will do whatever it takes to make their loved one happy. However, if they happen to fall out of love, their ex will become their number one enemy, and Hazels will make them pay for all the pleasure they once had. Hazel people don't need anybody in order to feel happy or to feel miserable. Sometimes emotionally unstable, this sign is torn by passions. They are their own best friends and their own worst enemies.\n\nHazels create their own mythology; they like to color the truth. Often times they lose track of their own mistruths, or go too far in their fantasies. These people are very careful to never disclose their own true thoughts; however, they are very good at reading others and they use this talent to their advantage.\n\nOddly, considering their amiable and warm persona, Hazel Tree people don't always care very deeply about humanity in general. Life with a Hazel Tree person can be tough, but it is never dull.\n\nHazels are usually fast learners. Their intuition is impeccable. They unfortunately lack natural, easy-to-express kindness and compassion for others, but if they can learn to develop their positive traits, they will find inner harmony and respect."
}