{
  "name": "Maple",
  "description": "The Maple is known as the luckiest of trees. It embodies a happy spirit because it represents very desirable qualities, such as success, wealth, and general prosperity. This is a very positive and constructive sign. It is only natural, then, that Maple people are always pleasant to be around because they are cheerful, joyful, and active. These dynamic people are quite adventurous and always seek out excitement.  Even when a Maple Tree person isn't the most gorgeous one in the room, he or she can easily compensate for it with an outrageous, interesting, and outstanding personality.\n\nMaples are known to be offbeat, extravagant, and even a bit bizarre. They are always aware of all the new trends, social customs, and the most recent discoveries in the world around them. On any given day they are involved or considering any number of interesting and exciting projects. However, they rarely implement any of their daring ideas. Maples prefer to watch others achieve their goals.\n\nMaple people have irrepressible energy; they are simply restless! They are interested in too many things at once. Sometimes Maples feel that if they stop even for a moment, they will miss out on something very important.  Despite their daring personalities, Maple people are not extremely courageous. The only reason they decides to take a risk is because Maples have a very low sense of danger.\n\nMaples are social butterflies; every day they make new connections.  Because of their warm and inviting nature, people trust them with all their secrets. They know that no matter what, this sign will never reproach them or disapprove of them.\n\nEven though Maples love to be the center of attention, they don't care what kind of impression they make on people or what kind of attention they garner.  They don't follow the rules, and they actually enjoy provoking others.\n\nAlthough a logical mind helps them to find solutions to the most difficult problems, Maples' path in life is never easy. They rarely achieve great success.\n\nMaple people don't need love to be happy. If they don't ever find a \"partner in crime\" they manage just fine on their own. This sign will never complain about an ill-fated life or shattered dreams. Maples have a way of learning to be content with what they already have.\n\nMaples can be quite cynical. They will notice someone's flaws, but never hold anything against that person. Maples have a many-sided personality; they are full of surprises, both good and unpleasant."
}