{
  "name": "Oak Tree",
  "description": "The mighty Oak Tree is known as the gateway to power. It represents endurance and nobility. Oak Tree people possess a great amount of strength, energy, and beauty, but they may completely lack any flexibility. They are well respected but rarely loved. Oak Tree people can be very brave, but their courage comes from their pride. They have difficulty forgiving any kind of weakness.\n\nOak Tree people take very good care of their health, because they don't want to become a burden. They will never ask for help, even when they are in need. They have extremely strong willpower and self-control. When they set a goal they are practically unstoppable.\n\nBecause of their lack of flexibility Oak Tree people gain many problems. They have no sense of compromise, as they simply don't consider diplomacy an option.  Oak Trees rely on their strength and they may prefer to force people into their way of thinking.\n\nThis sign is very independent. These people don't follow anybody's rules but their own.  At the same time, Oak Trees can learn to respect others. Despite their admiration for order, Oak Tree cannot get it straight when it comes to their love life.  They simply don't seem to be able to make a choice.  This sign is capable of dating several people at once, and even when they get married, Oak Trees' often keep seeing other people. They can hide it well though. Oak Tree people are very conservative. They don't like the idea of divorce, because it would bring certain undesirable changes to their otherwise orderly life.\n\nOak Tree people always keep in sight their ultimate goal. They are very ambitious and they work very hard to achieve what they want.  Oak Trees get preoccupied only with their own business; they don't care much about the problems of others.  The only people that concern them are their family members. Oak Trees help them as much as they can; they often support their family financially.\n\nOak Tree people never rely on good luck, they know what they want, they know how to get it, and they put their heart and soul into it."
}