{
  "name": "Pine Tree",
  "description": "Displaying rich, vibrant green all year long, the Pine is symbolic of creativity, life, longevity, hope, pity, boldness, the passing of time, and immortality. Pine Tree people fill a huge role, and they are beloved and admired for it. Beautiful or ugly, young or old, healthy or not, Pine Tree people always get noticed. Part of their appeal is that they are full of life and pay very close attention to every detail that can make their existence a little bit more comfortable. Pine Trees crave comfort and beautiful things and can create a very pleasant environment for themselves.\n\nPeople of this sign are very persistent and goal oriented. From a very early age they usually know what that they want, so they focus on working toward something they know will be practical for them. They are not fools and they don't like to waste their time on something not worthy of their attention. Surprisingly, Pine Tree people, with all their intelligence, do not have many - if any - deep interests. They are not always sophisticated or well-rounded. At the same time, if someone of this sign does have a rare interest in something, his or her knowledge in the field will be astoundingly deep and profound.\n\nPine Tree people are very picky and fickle. They don't have many friends, but every person they choose for their intimate circle will have noticeably unique qualities. Pine Tree people don't maintain many emotional ties, but the ones they have are extremely profound.\n\nFrom the outside, the life of a Pine Tree person may not seem very eventful, but everything that happens to them is very meaningful and significant. Pine Tree people are not fatalists. They don't trust in gods, but instead they rely only on themselves, and they are always eager to help others. These people are very ambitious. Once they set a goal, they are unstoppable.  When dealing with a problem, Pine Trees are accurate, thoughtful, and efficient, so even the toughest situation becomes a piece of cake when handled by this sign.\n\nPine Tree people are not very generous. They are generally preoccupied only with their own well being. It is highly unlikely that Pine Trees will give a lot of money to a charity or help out a friend in need.  Pine Tree people prefer structure and organization, yet they crave the feeling of being carefree.\n\nWhen Pine tree people fall in love, it flips their entire world upside down. They lose their ability to reason when they discover a whole new world of feelings. They have no problem relinquishing all material welfare in order to spend more time with their loved ones. Sadly, however, love doesn't always last for the Pine Tree person. Later in life, those born under this sign may look back on love relationships with sadness and nostalgia.  However, women born under Pine Tree sign are usually luckier in marriage than Pine Tree men."
}