{
  "name": "Poplar Tree",
  "description": "The popular tree is symbolic of the autumn equinox and of old age; it brings messages of hope, rebirth; and it assists those who have a gift for making predictions. Poplar Tree people are beautiful, slender, and elegant. They also happen to be true masters when it comes to creating trouble for themselves.  Part of that troublesome nature has to do with the fear of growing old. Because they are too self-conscious about getting older, they begin to obsess about aging when they are very young without realizing that their worries can make them old before their time.\n\nBecause the bendable Poplar is easily influenced by others, it is important that they surround themselves with positive people who can help them to constantly evolve their attitude. Poplar people should be extra careful when choosing friends because they will be suffering a great deal if forced to co-exist with random acquaintances. To avoid pessimism, this sign needs to breathe freely with the like-minded friends.\n\nPoplar Tree people are driven by love, and yet their love is very fragile; even the smallest things may cause them to fall apart. Poplars are very brave and courageous, which helps them to overcome any obstacles. No matter what is going on in their life, they always keep a straight face. To those who don't know them very well, the Poplar appears to be very cheerful and laid back. Realistically, though, they are often far too full of themselves, but they learn to hide it deep inside.\n\nPoplar people are not materialists, in fact, they are quite altruistic. They usually have their lives on track and yet they are always concerned about their future. Because this sign is too sensitive and independent, married life with a Poplar is full of tough love, as this sign is too sensitive and independent. Their weapon is indifference, and it's accompanied by a joke and a smirk. Poplars have a very refined mind, and they never lose their wits. Because they are highly critical and astute, many Poplars chose the field of medicine as their profession."
}