{
  "description": "As the first sign of the zodiac, Aries likes to be first in everything! A natural-born leader, the fearless Ram is able to get things going in an instant and is willing to try anything, although this sign sometimes takes on more than can be accomplished. Aries people are extremely dynamic and energetic, and they have to constantly keep busy. They are also a very charismatic sign, with the ability to easily attract others with their personal magnetism.\n\nAries people are often the most exciting among family members with their engaging charm and their daredevil personalities. They are frequently called up to resolve family problems because they have a knack for leadership and for getting everyone going in the same direction. As parents, they are protective but they can also be strict disciplinarians. Aries children are known to give their parents quite a few gray hairs! And with their siblings, they are competitive, but they love them deeply. In all of their relationships, Aries people are a force of dynamic energy.\n\nWhether male or female, Aries does not take no for an answer when it comes to romance. When they meet an attractive potential partner, Aries doesn't play games. They are straight shooters and won't play hard to get. Aries people tend to be aggressive at times, though, sometimes scaring off possible love interests. By cultivating a softer approach, Aries' true strength and fine character traits will be more noticeable. Many Aries people, therefore, tend to rush into relationships and they may experience more than one marriage throughout their lives.\n\nNothing can stop an ambitious Aries who is intent on achieving a career goal. This is a very driven sign. Along with the drive, Aries people will work hard to get what they want. Aries is not all about hard work though. Aries is also a dreamer. They tend to dream big too - they often reach straight for the stars. Nonetheless, their drive and hard work allow them to often get exactly what they're aiming for. In business, Aries is savvy and shrewd and often winds up living the high life. Many corporate leaders are born under this self-motivated sign.",
  "positive": "A natural leader, full of energy, helpful of others, very open, patient, a defender of the weak or vulnerable, will die for a loved one, does not give in easily.",
  "negative": "Needs to be in control, unaware of the feelings of others, does not listen, has jealous, intolerant, selfish tendencies and is a poor judge of character."
}
