{
  "description": "The stable, serious, and confident Capricorn is a natural goal setter who accomplishes a lot when working under definite guidelines. Capricorns above all love structure and order. They can be quite stubborn as well as determined, and ambitious. They can be very pessimistic, melancholic, and even unhappy so they should, on a regular basis, make a point of using positive affirmations and other empowering techniques to maintain a happy disposition. They need to learn that not everything is under their control and that it's fine from time to time to relax and to let go of their worries.\n\n    Capricorns are known for having very traditional values, and this comes through best in the way they deal with family. This sign is sincere and down-to-earth, and their relationships are equally low-key and comfortable. Capricorn parents are often somewhat old-fashioned, waiting up hours for their children to arrive home, and influencing and guiding their children long after they leave the nest. Parents treasure the Capricorn child because this is someone who is hard-working in school endeavors and is always reliable and trustworthy - even from a very young age. Sometimes with siblings, though, there is friction, as Capricorns can be jealous when attention is stolen from them. Still, Capricorn has a strong and abiding love for family.\n\nCapricorns can be hard-headed when it comes to romance. People of this sign often do not know when to leave well-enough alone, and will go to great lengths to try to mold or influence their significant others to be what they believe they should be, rather than accepting them as they are. This, in turn, results in conflict, and Capricorn does not do great dealing with friction in relationships. Capricorn should steer clear of being too rigid or inflexible, and should be open to compromise for the greater good. This sign has a fabulous potential for fulfilling relationships, and can achieve them through self-knowledge.\n\nCapricorns love to learn all aspects of whatever business they are in - whether they work for someone else or they are on their own. They frequently start at the bottom of the ladder and work their way up, so they can learn every nuance of their profession. Capricorns are very resourceful, detail- and deadline-oriented, and they tend to manage their finances very well. These traits lead them to be quite successful both financially and in terms of their professional reputations.",
  "positive": "A calculated risk taker, diligent, has realistic but high standards, a giver of good advice, cautious, scrupulous, a traditionalist, fearless.",
  "negative": "Fatalistic, dominated by inner fears, slow to forgive, egotistical, a slave driver and convinced their way is best."
}
