{
  "description": "As one of the most creative and ambitious signs, Leo has plenty to roar about! The Lion's considerable talents help them to succeed in nearly any endeavor they set their minds to. Leos love to be the center of attention, and they often are because they are so enthusiastic, courageous, loyal, and generous. Because the Lion is the king of the jungle animals, Leos often think of themselves as the king or queen of the universe! But they need to learn to tame their pride and to be less concerned about appearances. Leos love to give without asking first. That's because they always assume their \"gift\" is truly needed. As a natural born leader, Leo can become a great inspiration for others.\n\nFiercely loyal and protective of loved ones, the Lion is proudly devoted to each and every member of the family. This sign is often the leader when it comes to family matters. Strong, loving, and regal, this person is always conscious of making everyone proud. When the Leo has children, those children are treated like little kings and queens - often pampered to the point of being almost spoiled. And the parents of a Leo are often treated in much the same way because Leos tend to always want to maintain and be worthy of the pride the parents have in their child's achievements. With brothers and sisters, Leo is charming and likeable, but siblings may come to resent Leo's natural need to be in charge.\n\nLeo is also the King or the Queen when it comes to romance, often lavishing a lover with gifts of flowers, candy, home-cooked meals, or whatever appeals most the object of this person's affection. If a Leo is in love, there is no doubt about it because Leos more often than not wear their heart on their sleeve. And when you are loved by a Leo, you can rest assured that this regal beast will always be there to defend your honor and trumpet your achievements.\n\nAnyone who competes with a Leo in the workplace had better get out of the way because Leos are very competitive and they play to win. Very driven and very smart, Leo is always on the lookout for opportunities to get ahead. Leo is the natural leader of the pack and doesn't know the meaning of the word \"no\" when it comes to earning a position that is coveted. Many Leos choose to be in business for themselves because being the \"king of the jungle\" by their nature - they don't like to answer to anyone.\n",
  "positive": "Loyal and honest, house proud, lively, hospitable and generous, self sacrificing, responsible, takes others at face value, dignified and friendly.",
  "negative": "Uncaring, sulky, smug and boastful, a taker of undue credit, likes to keep up appearances, obstinate, arrogant, willful and cold hearted when hurt or upset."
}
