{
  "description": "Scorpio is one of the most profound and outwardly impressive signs of the zodiac, with a very intense emotional energy that makes them stand out among peers. Their personalities are truly magnetic, yet they can be volatile and unpredictable at times, like a volcano - but that's only because they experience deep passion. Like their namesake the Scorpion, Scorpios have sharp powers of self-defense, and when they feel cornered they will lash out. Sometimes they get carried away with their overwhelming feelings. Just like the mythological Phoenix, they burn themselves down and then they revive from the ashes. Scorpio is known for having a very strong imagination and keen intuition. To avoid a tendency toward jealousy, people of this sign need to remind themselves how much they have to offer.\n\nScorpio people have a strong, consistent, and lasting commitment to family. And that includes long-time friends who become like members of the family. Even though Scorpio may not see family members on a frequent basis, they can always get back on track quickly and make it seem like no time has lapsed. Scorpio people are strong and independent, and as a parent, those traits set an excellent example for their children. When they are children themselves, though, those same traits may drive their own parents crazy. In sibling relationships, Scorpio people make great confidantes because they know how to keep a secret.\n\nIt may be hard to win the heart of a Scorpio, but once you do, you have someone you can count on for life. People of this sign feel deeply and love passionately, and once someone does them wrong, it can be hard or, more likely, impossible to get back into their good graces. Scorpio is also known as the sexiest sign of the zodiac. They are very affectionate and giving lovers who believe in keeping the fire in a relationship, so if you have a Scorpio lover, get ready for a life of passion and excitement.\n\nWhen it comes to money and career, there is no deterring a Scorpio from meeting a goal. Scorpios are excellent at sticking to a budget, and they aren't afraid of working hard to achieve the financial status they seek. They have strong management skills, they rarely overspend or spend frivolously, and they have almost a sixth sense when it comes to seeking out good investments. Not surprisingly, having these traits, Scorpios are usually very good at managing projects both big and small.",
  "positive": "Secretive, self critical, a piercing nature, inquisitive, passionate, persistent and resolute, captivating, vigorous, loving, passionate, sensual, sympathetic and intense.",
  "negative": "Jealous, a moody changeable nature, suspicious, sadistic and secretive."
}
