{
  "description": "Virgo is the zodiac sign represented by a female. Virgos are therefore delicate and sensitive, yet, at the same time, they can be critical and picky. Virgos may appear cold as there is a tendency to hide emotions and suppress natural kindness, although deep down they are warm and loving. Virgos always pick a logical and practical approach to all aspects of life which contributes to many of them being quite successful and independent. Although Virgos may appear cold they feel deeply and are in fact very reliable in all of their relationships. They will be glad to lend you a helpful hand if you get past the mask. This makes Virgo a very desirable friend and mate.\n\nModest and understated, Virgo people have to take care to show those they love how they feel. These people don't like to make a scene, and so they are often quiet and even withdrawn when it comes to showing emotions. Still, their steadfast loyalty and their consistent attention are appreciated by those who love them. Virgo parents are attentive but not overly demonstrative when it comes to showing the love they deeply feel. With their own parents, they were often so humble that they felt uncomfortable with too much attention or praise. Virgo siblings usually enjoy pleasant if not distant relationships.\n\nStill waters run deep, and Virgo people are often very hard to read. That doesn't mean they don't have great wells of love to draw from - but their lovers are often left wondering how their paramour feels or what this person is thinking. Virgo is encouraged to express feelings more openly by being more demonstrative and affectionate. Learning to give and accept a higher level of nurturing will help the Virgo person enjoy more fulfilling relationships.\n\nMany Virgo people achieve great success in business, but it rarely happens overnight. They aren't susceptive to taking big risks or leaping for chancy opportunities. Their success is usually attained slowly and steadily and over a longer period of time. But once they do reach the level they aim for, their success remains consistent. Virgo people are excellent at managing finances, so they know where every dollar they earn is going, giving them the power to expand and explore when in business for themselves. They need to keep in mind, though, that it's good to splurge once in awhile and to make a point of seeking out the joy of life.",
  "positive": "Helpful and gentle with the helpless, empathetic and sympathetic, humane, health conscious, charming and witty, affectionate and dedicated.",
  "negative": "Critical of laziness in others, demanding, untidy, somewhat a hypochondriac, moody, eccentric and anxious."
}
