{
  "dog": {
    "content": "It is your year, Dog, and you are ready to shine. The energy of this year reflects your nature, and if you are true to yourself, you can have a supremely happy and successful year. You are straightforward, down-to-earth, reliable, and intrinsically honest. You value home and tradition, and you can even be considered a bit old-fashioned at times. This year will see a return to old-time values, and you will feel right at home with the changing cosmic environment, which means you will be well-suited to take advantage of any breaks and opportunities that come your way - and there will be quite a few. In the past year, you have become more assertive and sure of what you want, so not only will you have the good fortune to be in the right place at the right time on many occasions; you will also have the self-confidence and the drive to reach for it.\n\nAs you begin 2018, the main challenge you may face could be your outlook on life. You tend to be moody, and you may start the year in a somewhat dog-eared state of mind. It will be up to you to lift your own spirits, because when you get into a funk, you don't even recognize that others are trying to uplift you. You tend to suffer in your dark shell until you make the choice - and it absolutely is a choice - to see your life and your possibilities in a brighter, happier, more optimistic way. Make sure you do find a way to have a hopeful outlook, because there are so many good things in store for you this year. First, from the beginning of the year and onward, your romantic life is very promising. If you are single, you have met or will soon meet someone who really understands you and can communicate with you on the same \"frequency\", which is extremely important to you. This could become serious very quickly. If you are attached, your union has been growing stronger, as long as you have been attentive and nurturing. If you still have a few hurdles in your relationship, this is the perfect year to smooth things out and build a deeper bond.\n\nFamily is especially important to people born in the year of the Dog. You have connections that run very deep, and your very identity is extremely rooted in family, tradition, and in creating a warm and loving home life. Last year, you may have finally reached a happier place in any family relationships that were strained, and that continued until the last part of the year. But after that, there may have been some unexpected troubles between you and at least one other family member. But that can all be righted this year as long as you are open to forgiving, and being forgiven. In fact, you can expect very harmonious relationships in this, and other areas of your life, in 2018.\n\nIn the things that are most important to you in terms of your identity and the way you see yourself in the world, you may have experienced several rough patches throughout 2017. You may not have achieved the things you hoped to achieve and for which you had very high hopes. That could have left you feeling disillusioned, and even hopeless in certain solitary moments. And although your pain and sense of powerlessness was real, it will slowly change in 2018. Little tidbits of hope will keep you going, but then by spring, something absolutely spectacular could happen that will catapult you over the stage of being hopeful to being a true believer that good things are meant, and will happen for you.\n\nYour work life, which may be connected to the above thoughts, may have been somewhat rocky in recent months. Your professional life may have also been unfulfilling for quite some time. You are about to come into your own, and discover something that you have, in a sense, known all along. There is something in particular that you are meant to do, and it involves a talent you have known you had, but it hasn't had the chance to shine. This year it won't just shine - it can dazzle. This could bring you outstanding good fortune, and perhaps even some very welcome windfalls throughout the year. This means you will be able to claim something you have wanted for a long time. But despite favorable conditions, you would still need to work hard for that.\n\nOverall, this year stands to be excellent for you, Dog, as long as you work to keep your spirits up, and you strive for success without giving up. Your love life will offer some brilliant highlights, your true purpose will come into focus, and you will finally be able to fulfill it. This will bring you a great sense of inner peace, serenity, and security. Believe in yourself, and you will see that the world is yours."
  },
  "dragon": {
    "content": "You are a wellspring of creativity, imagination, and magnetic energy. You are drawn to the unusual and the interesting. Your sense of curiosity is legendary, and your energy is dynamic. You may be the most interesting, most unusual person any of your friends has ever met. A person born in the year of the Dragon is someone who can't be easily forgotten once you made your impression. You are an idealist with big ambitions, but you sometimes become so wound up in the idea of getting what you want, that you forget why you started chasing it in the first place. In this Dog year, however, you will learn to slow down, savor the moment, and match your ambitions more to what is right for you, than what will be impressive to others. Although you may continue to crave the spotlight, you may do so through more humanitarian pursuits this year, or for special interests that are close to your heart.\n\nYou may be feeling quite confident as you enter 2018, and that will help you build a solid foundation for success in the year ahead. But this year, Dragon, you may begin to define success differently than you have in the past. You will hopefully become truer and more aware of yourself and more aware of your true purpose on this planet, and that will evolve as the year progresses as you actually get to know yourself better. As you grow emotionally and spiritually, you will obtain a deeper understanding of what is truly important to you, and your aspirations will take on different forms.\n\nAs for your love life, many people of your sign worked on closer bonds with their significant other last year. You learned to be more in tune with your loved ones, and to be more considerate of their feelings. Likewise, you probably reaped the rewards through a closer bond that made each day sweeter. But maintaining that kind of connection takes continued attention and effort, but it is always worth the time and energy it requires. If you are a single Dragon, you may be playing the field as you enter 2018, but by mid-year, there may be one person who really stands out. You may even find yourself speechless in this person's presence at first because they have such a powerful effect over you. Proceed with caution, and make sure you show the best of yourself rather than slipping back into old ways.\n\nIn your career, this could be a very exciting year for you. There will be surprising opportunities that you mostly could only have dreamed of, and they will be perfectly tailored for you. Timing is everything, so if the chances that come to you are appealing, you must act right away. You must also pour yourself into everything you do, because although these opportunities may be challenging, they will be exceedingly rewarding. At some point mid-year - whether you are working for yourself or someone else - a conflict could arise in your work life. This may involve an authority figure or someone with the power to make or break your success in a certain area. Be diplomatic and learn to find something good in everyone. By adding a more personal touch to your exchanges with this person, you can have success. Toward the end of the year, a chance to expand your role at work may come to you, and with it, a chance to increase your income - perhaps dramatically.\n\nIn years past, your family life may have suffered because you did not pay it the attention it deserved. Over the last year, Dragon, you have come to see the incredible value of those important connections though, and hopefully you have worked at staying closer to those you love. This year, that should continue as you spend more time with loved ones, and get to know them on richer, deeper levels.\n\nThis year can be an excellent one for you, as long as you manage your temper and your passions, try not to indulge in pursuits that are not good for you, and continue to nurture your most important relationships. Your brilliance will shine in many areas of your life, and you can expect the recognition you have deserved for a long time. In many ways, it will seem as though many aspects are suddenly coming together to put you on the path you were meant to be on all along."
  },
  "general": {
    "year_sign": "Dog",
    "year_element": "Earth",
    "content": "It is joyfully anticipated that 2018 - the year of the Earth Dog, will be a kinder and gentler year for everyone. The Dog is the symbol of hearth and home, loyalty and dedication, family and friendship, justice and fairness, and also compassion. These qualities and many other noble traits will be the signature of 2018. That is not to say that there won't be trials and tribulations, because there always are, but this year will bring healing to those who work to maintain good balance, and who send good energy out into the world.\n\nIt is widely known that the Dog is man's best friend, and that is because he is both fierce and kind. He defends and protects, and also offers the warmth of friendship. This year will offer special blessings to those who fight for the underdog and protect the weaker and the underprivileged, who exhibit faithfulness and loyalty no matter the circumstances, and who offer friendship in its purest forms. The element of Earth means that there will be a return to the fundamental values and a greater richness of tradition.\n\nIn a Dog year, people will feel more inspired to invest greater faith - in family, in friends and strangers, in life in general, and especially in themselves. They will be called on to be better friends as well, and to be more tolerant, compassionate, and protective of the world we inhabit. Where recent years have been marked by divisiveness, harshness, and fear,\n2018 should begin a process that will create greater harmony and tranquility. Although there may be times of trouble and hostility, more and more people will become fed up and will strive to unite and seek a more harmonious existence that is free of fear and turbulence.\n\nThe dog is a creature who thrives knowing there will be a good meal waiting, a warm friend to comfort him, and a warm fire to lie by. In other words, the Dog craves security. In2018, there will be a current sweeping us back to the basics, with great focus on a stronger sense of comfort and security. Inherently important values like home life, family and basic comforts will be more emphasized. Children should be driven to interact more with family than to spend their free hours lingering over various gadgets and video games, and people should spend more time at home among friends and family. This is a year to build security, and many will benefit financially because of this overall tone of being more scrupulous and respectful about the family, financial security, and old-fashioned values."
  },
  "horse": {
    "content": "You aren't just good looking; you are beautiful - in your own way, of course. You aren't just well-liked; you are adored and beloved by those who truly know you. You aren't just good at what you do; when you are doing something you love, you always rise above and beyond to leave a lasting impression. All of these things describe you well if you are born in the year of the Horse, and in 2018, even more people will notice your unique beauty, your likeability, and your dedication to excellence. You have great compatibility with the Dog because you share similar values. In this Dog year, your light will shine even brighter than it has in recent years. The things that make you stand out and that make you very appealing will be illuminating, drawing new and interesting people into your world, and this glow will rekindle the attention of those who have fallen off your radar.\n\nMany people born in the Horse year are wanderers. You love living life at a gallop. You go off exploring independently because you are capable of living in the moment and enjoying the experience of discovery. You can be quite a social creature, and you enjoy being included in groups you find interesting. Sometimes you are not realistic in your adventures, but this year, you will need to be more serious in the quests you take on. Good opportunities will come to you this year - especially earlier in the year - but you will have to fight your free-spirited nature to anchor yourself to some of these chances if you want to succeed. Many Horse people choose careers as contractors in various fields because you like being able to change workplace locations often, and experience as much of the world as possible. But at least one opportunity this year will require you to stay put. Consider accepting it, because it can bring a new level of wealth and security.\n\nYour career can really take off this year, and you will build momentum quickly if you can remain grounded and serious. The same goes for your love life. In the past, you have been a bit too free-spirited for your lovers, and that may have been the source of many quarrels. But this year, you may feel a greater need for a deep connection that is intimate and very loving. To achieve that, you will need to devote yourself to maintaining the closeness you crave. If you do, this could be a blissful year for your love life.\n\nOver the last year, you have finally chiseled down your interests and discovered what is truly special about you as a unique individual. You have given up on pursuing flights of fancy, and you are now ready to dig in and go after those things in life that are specifically meant for you. This is about finding your purpose in life, and putting your signature on what you have chosen to pursue. You have become more grounded, yet you have maintained the carefree, wild spirit that makes you so intriguing to others who only wish they could be as free as you are.\n\nYou are a friend to many, Horse, but you rarely have \"best friends\" among your circle. You seem to be everyone's friend, and you are often very desirable as a party guest because of your attractiveness, your cleverness, and your wit. However, this year the influence of the Dog could have you feeling the need to develop relationships that are deeper and more personal, and that's a good thing. It will teach you to nurture and care for others in a way that will make your own life richer and more rewarding. This new-found desire will add dimension to other areas of your life as well, because it will help you to see things on levels you haven't considered in the past.\n\nThroughout 2018, there will always be something to look forward to. There will be numerous social invitations, new and unique opportunities to grow and to learn, and relationships that will enhance and uplift your life. By the fall of 2018, you could be in the throes of a deep bond that will bring greater joy to your life than you have ever known. Whether this is a romance or a friendship, it is a bond that will continue for many years to come, and could potentially last a lifetime. By year's end, a venture you began early in the year will begin to pay off, and will bring a deep sense of satisfaction and pride. Here's to an excellent year!"
  },
  "monkey": {
    "content": "Monkey, sometimes it seems as though you were born under a lucky star. In fact, many people born under your sign experience quite a bit of good fortune throughout their lives, though not everyone takes full advantage of it. In recent years, you may not have felt as lucky as you have in the past, but that may be because you were in the process of evolving. Because you have become more stable, and you haven't been up to your old tricks, you were able to be more settled, and you were able to learn and grow. That growth - which manifests itself in heightened maturity, serenity, and wisdom - will boost your ability to capitalize on the good fortune that comes your way this year, and in future years too.\n\nWe have all heard the adage \"monkey see, monkey do,\" and this year that would actually be quite a good idea. In this Dog year, emulating the path of the Dog would further enhance your new-found maturity and sophistication. Strive to be more empathic by reaching out to others in need. Try to work on being more loyal by anticipating what your loved ones will need. Work at being more in sync with the vibrations around you. All of these things can only further enhance your confidence and therefore your success. You can maintain your playful spirit, of course, because it is always positive to remain upbeat and to maintain your sense of humor.\n\nAlthough you may have attempted to stifle your natural curiosity in the last year or two, you still have an innate tendency to explore and discover. In the past, that has gotten you into some trouble at times. You may never be able to fully exorcise that aspect of your personality, Monkey, but you can transform it into something wholly positive instead of something that pushes you to push the envelope and wind up in places and situations where you should not be. Use your intuition and your common sense for guidance. Be more steadfast in learning where the boundaries are. Don't give up your sense of curiosity, but refine it so that it works for you instead of against you. If you can take the reins and lead yourself down a more cautious path, you can turn your natural curiosity into a wonderful asset. You will be even more innovative and excited about learning new things because your curiosity will bring more substantial rewards.\n\nHopefully your love life stabilized over the last year. Like other aspects of your life, your romantic experiences may have caused you some headaches and some heartaches in the past. But throughout 2017 you had many opportunities to create more solid bonds with romantic partners. If you are single, this more serious approach to romance will be a really good thing in 2018. Your charisma and your magnetism are extremely high, and coupled with your higher level of sophistication, this makes you quite an attractive and appealing partner. You will find that many love interests will seek you out, and although you will have quite a choice of possibilities, you will be more inclined to want to settle down, and that may be possible by the end of this year. If you are attached, your partnership has benefited greatly from your more serious approach to life. This will continue, and you will keep growing closer to the one you love throughout 2018.\n\nJust as with romance and everything else in your life, your work life will be enhanced because of an increased level of maturity and a more stable way of looking at the world around you. You get it now, Monkey. You understand more. You are more intuitive and more in touch with other people and with the world around you. In 2018, you will have numerous opportunities to keep improving yourself and your life - and many of those will also be reflected in financial possibilities. Your work life should be evenly successful throughout the year. And in all aspects of your life, 2018 will offer you a flowing stream of chances to be happy, stable and secure."
  },
  "ox": {
    "content": "You may appear to be quiet, reserved, and even withdrawn at times, but there is a brave spirit and a powerful well of strength and determination just below the surface. You are family-oriented, conservative, traditional, and faithful. You are someone who can be trusted. These wonderful virtues will serve you well in this Dog year. And the fact that this is an Earth Dog year - when such virtues are recognized and prized - means that you have the potential to soar to new heights, achieving quite a lot, and finding happiness at every turn.\n\nYour experiences were probably pretty steady over the last year, and if you were true to yourself, you did what was truly right for you at every opportunity. Hopefully you are feeling more confident of yourself and more secure and established now, because those are circumstances that bring out the best of you - and if so, then you are well-poised for the year ahead. In 2018, you will have many opportunities to shine. Don't let your naturally humble approach to life stop you from basking in the spotlight at the appropriate moments, because you could make more than a few dreams come true this year if you aren't afraid to be in the thick of it, to lead, and to ultimately shine.\n\nOver the last year, you may have become more social than what comes naturally for you. You may have met people who helped you to shed some of your inhibitions and inspired you to be more outgoing than you would have been otherwise. Those skills will be put to good use this year when you meet a wide range of new people. These people may come into your life from all angles - you may meet interesting folks at work, in your neighborhood, through friends and family - and also in some of the oddest ways. One or two of these people may become life-long friends and bring uniquely wonderful gifts to your life.\n\nYou may have made great progress last year in a slow and steady way, and because you were so careful, you have most likely maintained whatever success you achieved. That trend will continue in 2018, and your approach should be the same - slow, steady and dedicated. You must also maintain your natural kindness, politeness, consideration for others, and promote your peaceful nature at every opportunity. Never hesitate to stand up and speak your mind when your beliefs come up, because you can be a great teacher to others.\n\nYour relationships of all kinds have hopefully endured, and that must be a great source of satisfaction for you. This year, you may have to deal with some bumps in the road when it comes to relationships. Family matters may cause some conflict in your nuclear family, but there won't be anything you can't deal with. Your friendships may experience some ups and downs too, but these will bring great insight. Although some of your bonds may alter, it will all be for the better. Romantically, there may be things to work out between you and your significant other if you are attached, but as long as there is respect, you will be okay. For single Ox people, there could be someone special who will come to you when you least expect it.\n\nYour path ahead in 2018 is solid, bright, and far-reaching as it leads you toward your goals. Although there may be some steep stretches and some challenges along the way, these will build character and increase your confidence. Your nobility, your reliability, and your dignity will be noticed by people who count as you work your way toward success. And personally, those closest to you will have a richer sense of respect and love for you and for who you are.\n\nBe true to yourself throughout 2018, and be flexible in your plans. Remaining pliant and being willing to compromise will help you get what you want and need."
  },
  "pig": {
    "content": "People born in the year of the Pig are very, very compatible with the energy the Dog exudes, and this means that 2018 - the year of the Dog, will be a very good year for you. Your kindness, your generosity, and your natural faith in the world around you means that you bring enlightenment and peace to anyone in your presence. You are a deeply feeling, deeply loving, deeply emotional person. And although that means you sometimes suffer and worry a bit more, you also revel in higher highs and you live in a richer emotional landscape. All of that will enhance your experience this year, and contribute to the enjoyable ride this year can be.\n\nYou have a rich appetite for life, Pig, but that means that you sometimes overdo it in various ways. You may spend a lot, or indulge in pleasures that are fine in moderation but not very good for you on a larger scale. This year, you will benefit from toning down your indulgences, and focusing on those things that are truly meaningful that will reinforce the foundation your life is built upon. If you can be serious in this way, there will be opportunities that can help to enhance your security in many areas of your life - especially when it comes to your finances. Although many people born in the year of the Pig may enjoy prosperity, it can be fleeting because you tend to spend big too. In 2018, you would be wise to create a smart budget and stick to it. Considering working with a professional that can help you do that could be a good idea. Doing so will help you get into a groove of doing better fiscal decisions and maintaining smarter budgets, which will in turn make you feel safer and more confident. Being more in control in every area of your life is a good thing to focus on too, as this will only make opportunities more reachable, and problems more manageable.\n\nAlthough you are known to be devoted to family and friendships, last year may have left you feeling disappointed in someone who let you down. Although this may not have been on a grand scale in the big picture, it was something you were not used to and had not expected, and it may have left you feeling sad or confused about a certain relationship. That bond can be rebuilt this year if you can get over the resentment or fear that you may be feeling. This one particular person may have issues you know nothing about, and it is likely that this disappointment occurred because of that. In other family matters, you will find that 2018 brings longed-for reunions with family members you have not seen for some time, and there may be some exciting family news that will be shared by mid-year.\n\nIn romance, Pig people usually want to be one of those hand-holding, lovey-dovey, committed couples you see strolling along, ecstatic in each other's presence. Hopefully that is the case for you, because your romantic life is very important to you. If you are in a committed relationship, your union should be very solid and very rewarding, as long as you have chosen the right person - someone who complements your best characteristics, and who compensates for your weaknesses. If your romantic relationship is having issues, however, 2018 would present a few opportunities to either repair your bond, or to move forward on your own. But no matter what happens, people born in the year of the Pig typically have very satisfying love lives. If you are single, you could find yourself crossing paths with some very interesting people this year, and at least one special someone who will truly appreciate all that you have to offer. While this may not result in a committed relationship right away, if you are in it for the long haul, this could be very promising.\n\nAt work, Pig, you are the one that everyone counts on. No matter what your role, people at all levels come to you to hear your opinions, or simply gather around the water cooler for some friendly conversation. You are hard-working, honest, and you always strive to do your best. This means that many people of your sign have steady jobs they can count on, even in a challenging economy. Because you are so reliable, you are the worker that is often called on when others can't be counted on. You are someone who stays on top of things and watches for future trends, and someone who is always working to better yourself and benefit your employer or your business. This year, there will be chances for learning and expansion, with greater responsibility and opportunities to grow and rise to the place you want to be in your career. By the second half of 2018, you may have to make an important decision about your career. \n\nYou love your creature comforts, Pig, and this year promises to provide you with a cozy, warm and fuzzy, ideal life, as long as you maintain your amiable ways and your happy-go-lucky attitude. To make the most of the opportunities that come your way, make sure to address them and manage them right away. This can be a year of steady progress. By year's end, you will have much to look back on with pride and joy, such as many close relationships, memories to savor, and a happy love life that will bring you great joy. All in all, 2018 should be a stellar year for you."
  },
  "rabbit": {
    "content": "In nature, the Rabbit is a gentle, quiet spirit who attempts to go about his business unnoticed. You share many qualities with this peaceful creature, who is conservative, understated, cautious, and somewhat carefree. Although you may not be drawn to grand ambitions, you are dutiful in your responsibilities. You can be lazy, however, when you don't keep yourself in check. Over the last year, you may have been uncharacteristically driven toward certain goals. Even though you may not have made a lot of progress thus far, this year could usher in a new sense of accomplishment, and many of your efforts will finally come full circle. The rewards could be quite substantial in some cases. At times, your personality is rather carefree. Even when there is danger about, you sometimes freeze until it passes rather than doing anything about it or changing the pattern that put you in danger in the first place. This year, you may be forced to shore up your defenses and become a more cautious person, which will benefit you down the road. You may also be forced to become more organized, which will also promote greater success in all areas of your life.\n\nWhere relationships were concerned, 2017 may have been a rough year for you, Rabbit. There could have been some struggles that pitted you against friends or family members, resulting in hurt feelings and volatile interactions. You often shy away from dealing with situations like this, which means you let them simmer or ignore them altogether, hoping they will just go away. But by avoiding the issues, you may have made them worse. This year, you will have the chance to come back to those you love and start all over again - building your bonds up stronger and making them more resilient for the future. Don't hesitate to accept any opportunities to do so in 2018.\n\nYour love life may have experienced some tumult last year as well, Rabbit, and that may have caused you some dismay as you entered into the new year. And even though you do shy away from dealing with matters like this, thoughts of what transpired may be preoccupying your thoughts a lot of the time. In a Dog year, there are often solid chances for reconciliation in situations like this, and you will have the chance to nurture and heal any damage. If there was trouble in your love life, you may have to be the one to reach out and initiate the healing, but if you do it right, your partner will be receptive. You can actually build quite a vibrant love life this year if you put your mind to it and continue to nurture and share affection. If you are a single Rabbit, you may want to play the field until the fall, when an interesting romantic prospect may appear.\n\nWhere your work life is concerned, you may not have taken your job or your career as seriously as you could have. This year you have a new perspective, but you may fear that those in authority have branded you as lackluster or uninterested. Even if that is true, you will have multiple chances this year to prove your worthiness and to demonstrate a solid work ethic. In the past, you may have clashed with authority figures, but this year there will be changes on that front affording you a new beginning. If you have ever dreamt of establishing a business of your own, this is a great year to begin - especially if your business of interest involves some sort of old-fashioned or retro theme. The thing to keep in mind is that consistency in whatever you do - work-wise - will drive you toward success, so remain consistent in your passion and in your efforts.\n\nAlthough you may have faced many challenges last year, you hopefully learned a lot. And if you put what you learned into practice in 2018, and you maintain your determination and conviction, you can begin to make great strides in all areas of your life. If you are especially driven, you could enjoy record-breaking success in some sector of your life in the year ahead. But even if you don't make it all the way to the top, you can surely have your share of good fortune."
  },
  "ram": {
    "content": "Your kind-hearted nature will serve you well in the year of the Earth Dog, sweet Ram. Whatever crowd you are in, you are always the one who stands out as dignified and well-liked by everyone. People often turn to you to observe your actions so they can follow your lead and know the appropriate thing to do. With the vibration that exists in a Dog year, you will fit in splendidly, and good fortune will find you. Since you are someone who is thoughtful, forgiving, soft-hearted, and considerate, your path will be very compatible with the energy that pervades throughout 2018. As long as you continue to do what comes naturally, you will find hope and happiness everywhere you go.\n\nPeople born in the year of the Ram are often quite attractive. You are either visually and aesthetically attractive, or your personality is so unique and beautiful that others are naturally drawn to you. This year, take care not to be too focused on appearances or shallow desires, because this is a year when substance, quality and integrity will be very important, and should not be overshadowed by superficial thoughts, desires, or goals. Likewise, you have a tendency to be moody - but that is something you need to fight with everything you have, because maintaining a straightforward and consistent path will be important to your success. Work on being more decisive as well, because there will be important decisions to make this year, especially between February and April.\n\nYou may have made some major life changes in 2017, and change continues to be in your forecast. You are still in a period of learning and growing, but the education you are now receiving will be put to good use rather quickly - perhaps before mid-year. You made some good investments last year, and they will begin to pay off for you very soon. You may have already seen the signs that the choices you made last year will become quite lucrative and rewarding, and it will continue to be for some time to come.\n\nWhere your love life was concerned, last year may have had more than a fair share of conflict and discontent. This may have been partly your responsibility, because you may have been rather self-focused during 2017. Although none of these conflicts resulted in endings that were not meant to be, it may have still felt traumatic at the time. But throughout the process, you hopefully learned a good deal about yourself and your partner, if you are attached; or you learned to recognize what you are looking for - as well as what you don't want - in a potential mate.\n\nFinancially, last year may not have seen you realize your hopes and dreams. You like the feeling of being secure and not having to worry, but you may have had a few worries where money is concerned. That is changing, albeit slowly, Ram. You have become more aware of the need to stay on top of your budget and your income-earning capabilities, and to make the most of it all. This awareness and dedication to consistency where money is concerned, will be your key ingredient to financial success this year. There will be opportunities to increase your income, but you will need to be dedicated and determined to reap all the rewards that are possible.\n\nWhere family is concerned, this is a great year to mend any rifts, and to get closer to family members who haven't been as friendly as they should. It will be up to you to reach out and create stronger bonds. There are certain people in your family tree who would be very good for your emotional well-being if you would show them how much the family connection means to you by keeping the connection secure.\n\nSo, Ram, continue to be the kind, loving, affable person you have always been, and this year of the Dog will be very good to you. Although you may not enjoy spectacular changes that are obvious immediately, you will progress at a steady pace, and you will have something to show for it by the end of 2018."
  },
  "rat": {
    "content": "The Rat is charming, charismatic, curious and intelligent. You have been blessed with many admirable qualities. But you can also be a bit self-absorbed and self-centered at times, and in a Dog year, those are not qualities that will get you very far. In other words, you can choose the direction your life takes you in, but you would be wise to open yourself up to being more vulnerable, more empathic, and generally, a more open and spiritual person. If you can evolve in this way, a world of opportunities will open up to you, and your life in the year of the Dog will be so much better.\n\nLast year, you were cautiously optimistic, and you may have made the pursuit of financial gain a priority. If that worked out well for you, you may be feeling a bit cocky now. And although 2018 can be a very secure year for you, you should try to feel more of a sense of gratitude than a sense of superiority. And it would be quite good if you could find a way to give back this year too. If there is a charitable organization or a cause that is close to your heart, it would be a positive and rewarding experience to get involved in some way - not just by giving financially, but also by giving of yourself and your time, which actually may be even more important and more significant. This could be an amazing growth experience for you.\n\nYour powers of persuasion are at a high level now, especially because you honed and perfected them over the last year. But this year the Earth element will have a way of drawing you back down to a more stable, more \"earth-bound\" approach to life. Meaning what you say and saying what you mean will take on a new context for you, and you will see that doing so can work to your advantage. Opportunities that you love will definitely be coming your way, and it will be essential that you treat them in a fair, straightforward, and honest manner if you want the level of success that is so important to you. Be upfront, direct, and clear in all of your dealings. The more good you put out into the world in this way, the more good will come to you.\n\nMany Rat people worked very hard last year, and because of that you may have neglected your personal life in a few areas. You may also have stopped indulging in the social activities and interests you enjoy. But this year, you need to get back to those things and get back in touch with your fun, funny, happy side. Although you will continue to work hard, which you mostly enjoy, you must find some time to set aside for personal enjoyment too, outside of work, rather than just concentrating all of your time on work. \n\nYou are not always the most trusting person, Rat, and that may be because you yourself are often hard to read and often misinterpreted. This year, you need to work at trusting others and work at having greater faith in yourself too, as well as in your ability to be a good person who contributes a great deal to the world around you. The more you reach out, the more others will reach out to you.\n\nIf you haven't done so yet, this is a great year to either step up your efforts at fitness and well-being, or to begin a routine that will make you feel vibrant again. If you do, you will find that you catch fewer colds and flus, and you will generally feel quite robust and energized. Romantically, this could be an interesting year for Rat people. If you are single, an interesting stranger could cross your path, multiple times in fact, leading you to believe that there is a \"meant to be\" quality about this connection. Pursue it. If you are attached, you may find that your bond takes on an intriguing air of mystery, where you find your partner to be exciting and captivating all over again. Work to keep that fire alive.\n\nThe year ahead can be quite good for you, Rat, if you work on evolving and take steps outside of your comfort zone. You want a lot out of life, and you can have it, but you need to grow emotionally and spiritually - not just financially and socially. There are countless possibilities awaiting the Rat who aspires to \"higher self.\""
  },
  "rooster": {
    "content": " Just like the barnyard Rooster who announces the sunrise to the still-sleeping land, you are a born communicator, rouser, and all-around life force to be reckoned with! You may be incredibly independent, but you are also very warm-hearted. You are also quick-witted, superbly capable, and very confident. You can also be a bit eccentric, but that's part of your unique charm. You have a charming, fun-loving spirit too, and last year, you were able to indulge yourself with many fun escapades and interesting pursuits. This year will bring opportunities as well, but you will need to rein yourself in a bit to take full advantage of them. Since you did have many chances to exercise your management and organizational skills, you are probably quite ready to expand further and take on any kind of opportunities this year, no matter how serious they may be.\n\nWhere 2017 was a bit chaotic and unpredictable, 2018 will offer you greater stability, more control, and more chances to show off your ability to think on your feet. You may not have received as much support, praise, or encouragement from others last year, and while that may have dismayed you at the time, it probably also helped you to build up your self-esteem and prove to yourself how much you are capable of.\n\nIn years past, Rooster, you were attracted to style more than substance, and flash more than quiet elegance. But in 2017, you came to appreciate subtlety and quality more, and your tastes have evolved considerably in that direction. Because of this, you may have gravitated to people who would not have been your \"cup of tea\" in the past, but who you now find interesting and appealing. If you were single, you may have developed a relationship with someone who would have been out of character for you previously, but who came to offer you depth that you never found before. If you maintained such a relationship, it could develop into something very serious this year, and could even lead to a lifelong commitment in 2018. If you are still single, you will continue to meet interesting people. For those Roosters who are attached, you will find that your relationship can grow deeper and richer if you devote the necessary time and attention to it.\n\nIn your work, you have slowly begun to feel drawn to more serious pursuits. If you don't have your own business, you may have thought about starting something. If you do, you may have thought about - and maybe started - making steps toward expansion in one way or another. If you are employed and you were enjoying your role in the workplace, you might have felt more ambitious about growing in your career and taking on more responsibility. This year, you may have more power and control over your work life, and you will have several strong chances to move up and to earn more too. Whatever you choose to do this year, work-wise, you can expect to be met with assistance when you need it, and to make connections that will open doors for you at every turn.\n\nIn your family life, you may find that because of your consistent growth in certain areas of your life, family members who once saw you as unreasonable or cocky, or in some other negative way, will begin to offer you the respect you deserve. Certain family members may even turn to you for guidance and mentorship this year because they appreciate your experience, wisdom, and how far you have come in your personal development. The chance to reconnect with someone you lost touch with several years ago may come to you around May, if not before, and this can be quite nostalgic and enjoyable. This time, the connection should endure.\n\nIn general, 2018 can be a rewarding, fulfilling year for you professionally and personally. Keep in mind the traits of the Dog - including loyalty, friendship, understanding, and hard work - and try to be in sync with that energy. This year can be quite successful for you if you forge a clear path and keep moving forward with determination."
  },
  "snake": {
    "content": "You are charming, attractive, and - yes - seductive. But that doesn't make you a bad person, dear Snake. Sometimes Snake people get a bad rap, being identified with the slithery serpent. While you may be quite sexy and gravitate to the spotlight at any opportunity, you are actually a quite likeable individual. In 2017 you put your special charm to work for you. In fact, you may have been doubly intriguing and appealing, and hopefully it worked to your advantage. And while you may have had a small share of quibbles with others, you generally left a good impression and were well-liked by those who crossed your path. Now your reputation is intact, and you are respected and well-received. Hopefully you also managed to build a solid foundation for yourself in many areas of your life, and that will be a good thing in the year ahead, and you will be glad you did.\n\nYour last year was likely very harmonious when it came to your relationships. Your family, friendships, and romantic relationships were like fine wine that aged well, and this year, they may be so mellow and rich that you will enjoy them even more so. You may have even mixed business with pleasure last year with great success, and if so, that will also continue into 2018.\n\nYou should enter 2018 with a well-earned sense of confidence and high self-esteem, and you will have a better receptivity to happiness and fulfillment. You were rewarded in many areas of your life last year, Snake, and that has left you feeling like the world is yours to conquer - and it is. But be thoughtful and cautious, maintain a level ego, and don't become overconfident. It is always wise to remain humble, because everyone on this planet is only one click away from change. Maintaining a good state of affairs takes balance, intelligence, and conscious effort.\n\nMany people born in the year of the Snake are still reaping the rewards of years of hard work. If you are not one of them, then this could be your year. In a Dog year, those who devote themselves to their dreams will be rewarded in significant ways, as long as they go about their business honestly and with respectful regard for the feelings of others. Despite the sneaky, slithery image snakes have in tales and so on, people born in a year of the Snake have excellent integrity, so maintaining a conscientious way of life should be relatively easy for you, even in difficult circumstances. In the beginning of the year, there will already be rewards for your good will and kindness in the form of business and social opportunities.\n\nThe only area of your life that could experience some friction is family and close friendships. This is a big and important area of your life, though, so take special care to treat others in the way you would want to be treated. Be constantly conscious of being honest, open, and gracious to others, and try to find compassion even in disagreement. If you can make this a priority, you could sail through the year with very little friction in your relationships. In your love life, continue to work at remaining close and keeping romantic gestures in your everyday life. This will keep the fire burning.\n\nDear Snake, overall, 2018 can be a really good year for you with continued progress in business, in your relationships, and in the area of personal fulfillment. There may be a move or significant travel by mid-year, and there may be a new addition to the family. This could be a child, a new relative through marriage, or even a wonderful, playful pet you decide to add to your life. Make sure to remain constant in your efforts to maintain fair and honest dealings with everyone, and the Dog year will reward you in kind."
  },
  "tiger": {
    "content": "The last year was a year of change for you, Tiger. But that was probably just fine with you, as you thrive in an environment that is vibrant and dynamic. You are alert, aware, and keenly intelligent. You love to be challenged and to have opportunities where you can test yourself - and like any big cat, you are great at landing on your feet. You have natural charm and a magnetic personality, and sometimes that gets you into trouble. You have great courage and you are very brave, but sometimes you are reckless. You are highly intuitive, but even when your sixth sense tells you to go the other way, you are often tempted to keep going in the \"wrong\" direction anyway. Again, this is often a source of trouble for you. In a Dog year, you will be constantly reminded through various events in your life that you need to be more responsible and more cautious in your approach to life. This may involve a lesson or two that could result in some disappointment if you aren't attentive to these cues and are not careful.\n\nOver the last year, your relationships have hopefully flourished. At the very least, you have become more aware of the people in your life who are the most meaningful to you. You should prioritize those who have been loyal to you, and let them know how special they are to you. If you were able to build on those relationships last year, then this year, it must be a big part of your focus. In a Dog year, relationships are very important, so this year, you will have the tools you need to pull it together and dedicate your love and affection to those in your life who most deserve it. Any loyalty and devotion you show to those who care for you will be rewarded with great support and encouragement from the people who love you. You may not even recognize just yet how important this can be to you.\n\nIn your work life, Tiger, you are often a shining star - and if you haven't been, then maybe this is the year to start exploring where you belong in terms of your career and paint outside the lines. In fact, this can be an excellent year to make a pivot in your professional life - either to launch a new career, or to build upon your existing career. Good things can happen to Tiger people who are willing to put in the time and effort at work. If you work for someone, you may experience a power struggle or two with personalities at work who may be jealous of your exuberance and stellar qualities. They may fear that you will outshine them, and it may seem that they are out to get you. But if you persevere in your dedication, and you keep your skill set sharp, no one can bring you down. Anything that happens will be for the best. If you are in business for yourself, this could be a landmark year as long as you maintain your integrity, honesty, and straightforwardness in all of your business dealings. People will be watching you, Tiger, and you need to be a shining example of honesty and uprightness.\n\nTiger people tend to be fiercely independent, and that sometimes carries through to your personal relationships. When you are deep in thought or preoccupied with worry, you tend to go off by yourself to think or simply to sulk. You can be moody, and you tend to want to work out your issues on your own. This year, there will be more focus on a team effort when it comes to your personal relationships. You will need to learn to lean on those who care about you, and offer that same comfort in return. In your love life, attached Tigers will feel more of an urge to grow closer and to build a stronger bond with their partner. This will serve you well in the years ahead, and will give you deeper personal satisfaction at the same time. If you are unattached, your desire for rich closeness may draw the right person to you this year."
  }
}
