{
  "dog": {
    "content": "Like man's best friend, the person born in the year of the Dog is kind, loving, empathic, deeply honest, and loyal to a fault. You have a strong sense of justice and fair play. You are authentic and unassuming, yet you are also charming and beguiling in a very down-to-earth way. You may be known for your natural beauty, and you may come off as very easygoing on the surface. All of these attributes are extremely compatible with the energy of the Earth Pig year, and if you put your best foot forward this year, and you serve your highest purpose, this can be a very successful, dare we even say, extraordinary year for you. At the same time, you have characteristics that may be at odds with the tone of this year. You can be mistrustful, irritable, moody, and temperamental. You can be stubborn, argumentative, and you may judge others quickly and harshly. To capture the very best of this Pig year, the Dog will have to align with a softer, more caring, more trusting approach to life. But that is certainly possible.\n\nThe Dog is a great lover of home and hearth. For you, there may be no better place. You are your happiest when you are around familiar things and people and where you feel like you belong. In this way, you are very in sync with the flow of this year, for your home life can be extremely rewarding, which will bolster your confidence, make you feel at ease, and help you to be your best self. And when you are your best self, no one can stop you.\n\nIn 2019, the Dog will have many exciting opportunities, including those that involve financial security, which is something you not only crave but something you absolutely need to feel peace and harmony in your life. Because you are hard-working, you will be inclined to take any opportunities that come your way and work your hardest to make the most of them. This will enrich your spirit, contribute beautifully to your overall well-being, and help you to fulfill your purpose. Remember that the brighter you shine and the more carefree you feel, the better off you will be. Therefore, if you are consistently aware of negative thoughts that enter your mind or negative words that are about to leave your lips, then you can correct them and reverse them before they go out into the world and create your reality.\n\nYour family life is extremely important to you, and this year it should be extraordinarily rewarding. You should find that even the toughest of relationships are easier and that your bonds with those you love and admire the most grow closer and warmer this year. You are a lover of tradition, and there will be many chances this year to weave in some of those elements through family gatherings, reunions, or simply socializing. If there are family members or friendships that have become estranged, this is a year when you can repair and renew them as long as you are willing to reach out, forgive, and work at making things better.\n\nYour love life can also thrive in this Earth Pig year. Single Dogs have an idealized idea of the perfect mate. In some ways, this complicates your love life and makes it more difficult to find someone to fall in love with because you analyze and criticize and find fault in things that could mostly be overlooked. But this year, you may meet someone who seems to radiate the light and energy and connection that you seek, and you may be so enamored that you will naturally do everything right, possibly leading to a commitment. If you are attached, this will be a great year for you. Your connection with your significant other will be vibrant, dynamic, romantic and enjoyable. You will delve deeper into what makes the two of you tick individually and together, forging an even stronger bond.\n\nIn this Pig Year, the Dog has the potential to have one of the best years in many, many years. Remember to fight the tendency to be moody or bleak. Try to be more social and more optimistic. Try harder to find the good in even those things you don't like or don't understand. And most of all, put the emphasis on your many, many wonderful qualities by seeing yourself as the kind, loving, giving, generous person that you are. Work at being more carefree and light-hearted, and the best in life will come to you more easily."
  },
  "dragon": {
    "content": "The powerful Dragon is somewhat of a mystery to many. You are emotional, intelligent and filled with vibrant energy. This is an Earth Pig year, and the Pig is grounded in routine and entrenched in wisdom. The dragon is more flamboyant and more elusive. The Pig is traditional; the Dragon is not. The Pig is drawn to hearth and home, and the Dragon is more of an imaginative wanderer, someone who does not relish being tied down. So, in a Pig year, the Dragon may face a few challenges because of this conflicting energy. But that does not mean it can't be a positive and successful year for the Dragon. Firstly, this year can offer the Dragon greater consistency and opportunity, especially where work and money are concerned. That can provide a grounding influence, which can lead to security and less of a desire to fly free and be untethered by anything - including good things. Money can give you more power, Dragon, and with power comes the ability to have more of what you want. In this way, the energy of this is positive and restorative.\n\nFor 2019, there may be a chance to take on a new career, to make a change at work, or to make money in some way - perhaps through investing or partnering with someone. These would be all rock-solid possibilities, and the Dragon would be smart to at least explore them. The key to the greatest level of success in any of this, though, is to not become greedy or overly aggressive. This could sour any opportunity that comes along, and it could be difficult if not impossible to regain any chances that are missed. You must tread carefully in any of these opportunities, taking great care at every turn to do and say the right thing and to be extremely reliable with any promises you make. This could result in a successful year in these areas of your life.\n\nWith your love life, the Pig energy offers a grounding, more stable influence than you have had in recent years. But that alone will not be enough to make your love life all that you dream it could be. If you are single, this could be the year you find true love. This person could materialize in the most unexpected of ways, so it is important for you to get out and about as often as possible. If you truly want a real and lasting love, this could be your lucky year. You have the chance of finding someone who will be your anchor in a restless world, and when you meet this individual, you will suddenly realize how important that is to you. If you are attached, you will find yourself gravitating to a deeper, richer connection with greater communion of spirit. This may require some focused work on your part, but the reward will be well worth it.\n\nThe Dragon is someone who thrives on moving quickly. With the slower pace of this year, you need to focus on maintaining your health and well-being, especially mentally and emotionally. Find ways to remain upbeat and make a point of routinely engaging in recreational activities, especially team sports. Your spiritual life could be extremely nurturing for you as well this year, and learning more about healing the mind, body, and spirit through hypnosis or transcendental meditation could be very beneficial to you. You might also want to look into doing some serious thinking about your purpose in life this year because you have floundered in the past wondering what you are here on earth to do. Some soul-searching could be very successful this year if you study yourself, your wants, strengths, and needs very carefully. This will help you to center yourself, get your bearings, and work on balancing many aspects of your life for greater rewards now and in the future. \n\nLast year, many Dragon people had the chance to develop stronger relationships with family members. If you were one of these people, that will benefit you greatly in this year, as the Pig's year energy is very focused on home, hearth, family, and on appreciating what you have. If you feel you missed that opportunity, there is still time to do that - to develop these stronger bonds. You may have some especially poignant moments with someone special among your family with whom you have had a fractured connection in the past. This will help you in many ways, even ways that may seem unrelated, like career and monetary success.\n\nIf you keep your eye on the prize, tone down your wanderlust, and work on appreciating all that you are and all that you already have, you will feel great satisfaction this year. And if financial security and success are among your more important objectives, you will receive opportunities for those achievements. Stay grounded, even though it may be hard for you at times. The payoff will be worth it."
  },
  "general": {
    "year_sign": "Pig",
    "year_element": "Earth",
    "content": "As you welcome 2019, the year of the Earth Pig, you may be pleased to know that the Pig is symbolic of wealth and abundance in many forms and that this energy will rule the year ahead. Who you are, how you react to this energy, and the details and traits of your own sign will comprise the elements that form your path in 2019 and beyond.\n\nThe Pig is good-tempered, warm-hearted, loyal, honest, and gentle. Those signs that reflect and complement these traits will have the most fulfilling experience during 2019. Despite the many positive traits the Pig possesses, however, there are also a few that are a little less flattering. Pig people are sometimes gullible and naïve. They occasionally lose their temper. They can be sluggish or slow-moving, taking their time to do things or make a decision, which can be seen by some as indecisiveness, but that is not the case. The pig is just a grounded sign and doesn't like to make sudden moves. Instead the pig values patience and caution. The Pig means no harm to anyone and is especially well-known for bringing a propensity for affluence.\n\nPig is one of the most patient and practical of the signs. His feet are firmly planted on the ground, and his head is rarely if ever in the clouds. In other words, the Pig is a realist. That means that those who seek success this year through practical, logical, organized approaches will be most favored toward success. A realistic look at reaching for a dream will be the best way to go this year. And for those who do achieve success, it can be enhanced by the good energies the year of the Pig promises.\n\nPigs make strong partners in their romantic relationships. They are supportive and loving. They are giving and affectionate. Their amorous pursuits are usually very strong. They will occasionally go for a night on the town, but Pig people usually prefer their own home and hearth. Pig people also know how to appreciate what they have, including home and family. Once a Pig meets the right mate, they are typically very committed. Again, these traits are favored this year. Those who seek strong bonds will be more likely to find what they are looking for and keep it safe.\n\nIn a Pig year, you may feel more inclined to look for opportunities - and there may be more opportunities available. You may be drawn more to people who are very straightforward and aboveboard. You may be more likely to seek out chances that have the potential to bring wealth or greater security into your life. You should be conscious of not falling into a pattern of laziness. You should keep in mind that those endeavors that begin honestly will always end in the best way. Those who are seeking pie in the sky or who build castles in the sand could experience an uphill struggle all year long. It is only those people who have a realistic outlook and a very honest approach who will thrive the most in a Pig year."
  },
  "horse": {
    "content": "The Horse is a spectacular animal. Flashy and fiery, passionate and free, agile and fast-moving - people born in the Horse year are lucky and seem to have it all. Many Horse people are intriguingly beautiful - not just physically, but also in the great depth and mystery their characters often possess. When you are at your best, you leave an indelible first impression on everyone you meet. This can draw in envy and unkindness, but lucky for you, you are confident and strong enough to brush aside the slings and arrows of jealousy. In fact, it makes you stronger and more determined. The Year of the Pig can be an excellent year for Horse people since your energy is quite compatible with Pig's energy. Your own dynamic energy will balance out the slower energy of the year, while your mysterious ways will add intrigue and excitement to otherwise dull situations and encounters. And because the Horse is drawn to luxury and pretty things, the Pig year - with its enhanced potential for financial gain, abundance, and greater prosperity, will be especially welcoming for the Horse.\n\nAs a Horse, you are an independent explorer who longs for freedom and fenceless horizons. You take life at a gallop and you sail through it quite easily most of the time. Many things come easier to you than they do to others, but often your independent spirit means that you don't always form bonds that are as deep as they could be. This year, Pig energy will have a powerful grounding effect on you. You may find it more enjoyable to stay close to the stable than trotting off alone. If you can acclimate well to being more reserved and to slowing down a bit, you may encounter some remarkable opportunities this year in many areas of your life, especially career and romance. It isn't that you aren't capable of doing well in these areas usually; it's just that you have not chosen to pursue certain things because of your nature. Slowing down, taking stock, and assessing what you want your future to look like could be quite rewarding this year.\n\nYou may receive a very special career, work, or finance-related opportunity this year that will be quite appealing to you because it will offer a certain level of freedom that other possibilities have not offered in the past. Seize these opportunities, work at it, and you will find it quite satisfying. In love, this is a year to work on growing closer if you are attached, or - if you are single - this is a year to allow someone to really get to know you before you prance away. Stick around for a while if you find someone who makes your heart beat faster this year, and you may start thinking seriously about a commitment.\n\nIf the thought of home and hearth is crystallizing in your mind now, this could be a great year to either change your residence or spruce up your home space. You might want to explore a new location geographically, or you may want to renovate and remodel the place where you currently live. Travel might also be on your mind this year, and 2019 would be a great time to discover distant horizons. The contrast and new experiences will spark ideas and incite your creativity - which you can bring home to influence your home life.\n\nFamily relationships could improve considerably this year. You may feel more drawn to your roots, and you may find yourself craving better, stronger, closer bonds with those who know and love you best. Make a point of spending more time with the people you love, and you may see new facets and aspects of them that are quite interesting and enjoyable. Certain conflicted relationships may take some work on your part - perhaps involving forgiveness and putting the past in perspective - but working on that will be well worth your time.\n\nAll in all, 2019 could be a very fine year for you. If you can adjust and embrace being more grounded, slowing down your pace to stop and smell the roses more often, and invest more of yourself in your relationships, this can be a fantastic year for you. You can also increase your level of success in building your wealth, your security, and satisfaction in what you feel you are here on earth to do. This could be a benevolent year in many, many ways for those who were born in the year of the Horse. So, pace yourself, be more aware of living in the moment without thoughts of escaping on to the next great thing, and relish the relationships that are important to you."
  },
  "monkey": {
    "content": "You are the life of the party, Monkey, even when there is no party. You have a fun, carefree, vibrant personality that makes you endearing and appealing to almost everyone you meet. You are a natural at socializing, and you play well with others - even though you are highly competitive and you often crave the spotlight. You are always good as a team member because you are smart, insightful, and you have a unique and innovative way of thinking; therefore, you contribute quite a lot in even the most challenging of circumstances. You are generally confident, you have great courage, and you can be an excellent leader. All of these leave you poised for success in anything you try. Your sociable nature will do well in this Earth Pig year. Your innate desire to get ahead will serve you well as there will be many lucrative opportunities coming your way. In fact, your happy-go-lucky nature will keep you in good favor with decision makers and with those who hand out the opportunities you seek.\n\nFor the Monkey, 2019 will be a year when past efforts have put you in a very good place to do more of the things you want to do, rather than have to do. Projects and ideas you have set aside - some because you thought they were not doable - will somehow seem more attainable this year. You have built credibility in certain areas of your life through your experience and your consistent dedication, and that should pay off for you in 2019. If you remain consistent, light-hearted, jovial in all of your dealings, and most important, if you remain direct, 2019 can be a successful and fulfilling year for you on many levels.\n\nAlthough you have a natural curiosity and a tendency to become involved in situations that you probably should avoid, you may need to try harder to suppress those tendencies this year. You could get yourself into tricky situations, or you could find that your luck takes a turn for the worse if you do engage in risky behavior. Likewise, plow a straight line in love because any deviations from honesty or any misleading or arrogant behavior could set your love life back. If you are attached, you may experience some troubles in communication with your partner during the early part of the year, and this may last some time until you find a way to adjust yourself. But if you persevere and show that you are still trustworthy, reliable, and faithful, things will begin to pick up after that. If you are single, you may feel compelled to play the field because you may not be in the frame of mind for settling down. Be careful not to make any promises you do not intend to keep, because there may be someone among those you meet who could be the love of your life, and if you don't handle it properly, you could lose this person forever.\n\nYour natural curiosity could compel you to explore many different kinds of ventures this year, Monkey, but be extremely cautious about those you choose to engage in or commit to. If you choose wrongly - if you choose something that is too risky, even if it seems interesting and seems like something that will offer you a lot of fun times - then it could backfire and cause a big failure that will be difficult to recover from. This year it is wise to stick with the tried and true and with things you can predict, measure and assess fairly easily. If you stick with the safer bets, they will reward you. You may find that a like-minded person will come to you at some point trying to entice you into a risky project. You will need to hold your ground carefully and think about the consequences before you do anything you might regret.\n\nThe year of the Pig should provide you with ample income and a comfortable life as long as you don't go overboard in indulging and don't take any foolish risks. Work at being smart with your money, with your emotions, and with your family life, and you can maintain a steady, content life of fulfillment and satisfaction. New ventures you begin this year may not take off right away, but if you are dedicated to them, work hard and consistent, don't get involved in any \"monkey business,\" and approach your efforts authentically, you will do quite well in 2019 in pretty much every area of your life that is important to you."
  },
  "ox": {
    "content": "The highly principled Ox has an entrepreneurial personality. You are hard-working, tenacious, persistent, and you have very high standards. On the outside, you appear to be quiet and tranquil, but beneath the surface, there are raging emotions that can explode when you are provoked. Anyone who knows you well, knows that you do not tolerate fools and that you are someone who should not be crossed. As long as someone is honest, aboveboard, and they adhere to the principles you admire - such as hard work - they will be in the Ox's good favor.\n\nLast year was good for many people of your sign, Ox, although you barely surfaced to catch your breath and take a break. This year should be equally good, but more relaxing and less stressful. You have laid a secure foundation, and this year you can take it easier if you allow that for yourself. There will be the temptation to say yes to every opportunity that comes along, but you would be wise to be very selective and devote your time only to those possibilities that you find the most interesting and rewarding. This year will be an excellent time to work on some of the more personal aspects of your life, such as friendships, family relationships, and your romantic life.\n\nThroughout last year your social life may have picked up considerably. That isn't because you suddenly became more popular - you have always been well-liked and respected among those who get to know you. But you may have been more willing to be sociable and to pull yourself away from your duties to take some time to relax and enjoy the many elements of friendship and family life. Someone you meet this year, even though this may be in a social setting, could offer you something deliciously interesting in the business or investment realm. Just be sure you know where the line is drawn between business and friendship before you commit to anything.\n\nThis year the work or money-related aspects of your life may be less frantic, but they may be more intense. It will be especially important that you remain aware of the intensity and adjust your moods so that you don't lose control of your temper and screw up some very good possibilities. This may take restraint, caution, and practice, but it is certainly something you can do and do well if you only try. Not only will this be good in the moment and throughout each frustrating thing that occurs, but it will also serve you well as it becomes a habit and you can apply it to future situations where your patience is tested.\n\nWhere romance is concerned, in 2019, your love life should be joyful and steady. It may not be all that exciting with fireworks and intriguing mysteries; but in its solid and reliable way, it will be very fulfilling and rewarding. If you are single, you may find you have an attraction to someone you already know in a different way, and perhaps have known for a long time. Or it could be that an old flame who didn't quite work out resurfaces, and this time it is decidedly better. Just move ahead slowly and maintain that pace until you are certain of how you feel. If you are attached, that same solid foundation of love and respect will continue to provide a base of security in all areas of your life, and your familiarity with each other will continue to reinforce the deep connection you already have.\n\nYour life in 2019 may have its exciting moments, but overall it will be reliable and predictable in a very good way. The Pig year will reward you for your honest approach to work and to relationships, and you will achieve a wonderful level of comfort in many aspects of your life. This is all good, and it will be important for any ventures you choose to engage in this year. Work and security should remain steady as long as you maintain your moods and take the occasional break.\n\nBe sure to take times to consciously appreciate the quiet moments and the solid structure of your life in 2019. Remain flexible, open-minded, and even-tempered, and all should go according to your plans. A good year for you overall."
  },
  "pig": {
    "content": "Dear Pig, this is your year! And to the people born in the year of the Pig, this year should be like a wonderful wallow in rich, deep mud! Yes, good things are ahead for you in this Earth Pig year, and you should enjoy it from start to finish. You are easygoing, naturally happy, honest, and very down-to-earth. You are an enthusiastic learner and quite knowledgeable on many subjects. You know how to be carefree, and you really know how to enjoy yourself. People of your sign are also often aligned with wealth, and good fortune surrounds you. The natural laid-back, fun vibration of this year should be especially enjoyable for you because you always know how to have a good time, and this year will offer you plenty of opportunities for good times. Hopefully this year, you will work at downplaying some of your less-desirable characteristics, such as being overly dependent, stubborn, and quick to anger. You should also try to find greater pleasure in the spiritual and in the simple, prosaic things rather than in material things.\n\nIn 2019, the Pig will get an opportunity for a fresh start in many areas of life. Life will be much like a truffle hunt. You will have many happy hours pursuing happy times and sweet rewards. With the carefree, laid-back tone of the year, you may find yourself exploring interests you have put off in the past and chasing dreams that once seemed too complicated or too far away. Whatever you try this year, you will have the golden touch, and your talents will shine through. Be careful early in the year of a get-rich-quick scheme or an investment that seems risky. Because you are a bit of a dreamer, Pig, you are sometimes gullible, especially when you are dealing with people that seem honest and respectable on the surface. Look at everything twice and play the devil's advocate with every opportunity that you think about getting involved in. If you take your time and you are cautious, you should do well in any ventures you begin this year.\n\nPig people often have satisfying love lives. Many people born under your sign find their true loves early on and often times remain loyal to that person through troubles and tribulations. Those who don't marry young can easily find their perfect mate when they feel ready and they start to look. If you are a single Pig, you may find yourself surrounded by admirers this year, and you may even have a hard time deciding who is best for you. But there is a method you can use. Look ahead and imagine yourself with that person several years from now and make sure you like what you see. If you choose to, you can certainly find the perfect mate this year, and if you do, your romance will likely progress rather quickly. If you are attached, you should enjoy the comforts of a loving connection. Your mate is probably your closest confidante, your best friend, and your biggest fan. If your relationship is not ideal right now, this will be a good time to work on it to make it as good as it can be.\n\nWith family or other close relationships, there may be some sort of a conflict that carries through from last year or even earlier. If there is, you may be very stubborn about choosing to resolve this because the choice probably is yours to make. This person may have reached out to you in the past to heal the rift, but you have not let go of the anger. Hopefully, the kinder vibration of this year may offer you greater empathy, understanding, and the ability to rebuild what was once a special bond. In general, you may have a rather enjoyable family life in 2019, with many family and life events to attend to. If you try to be compassionate with even those relatives that sometimes annoy you, your family life can be a great source of joy and validation.\n\nFinancially, you either have or can have greater financial security this year than you had in the past few years. It may not be your point of focus, but opportunities at work and elsewhere may come to you easily that will allow you to pad your bank account and feel generally more financially stable. You may even choose to indulge in some extra luxuries this year, as you do have a fondness for pretty things and impressive collectibles. Just be sure that you don't allow yourself to be taken advantage of in the monetary sense by someone who is with you for the wrong reasons. Keep your antenna up this year for users and con artists. If you are alert and aware, no one will be able to take advantage of you.\n\nOverall, this Earth Pig year will be a delight for the Pig. The slow, steady pace, the sumptuous vibration, and the congenial tone of the year are all conducive to a rewarding, satisfying journey for the Pig. Try to stay active and interested to avoid becoming trapped in a lazy groove. Steer clear of negative influences that could darken your outlook on life. And try to lift yourself above any situations that might cause you to lose your temper or cause you to do or say something you might regret. If you are true to your best self, this year will be happy, rewarding, and memorable."
  },
  "rabbit": {
    "content": "Rabbit people are noble but approachable. Among those who know you well, you are held up as a symbol of tenderness, grace, and sensitivity. You are a class act, Rabbit, but you don't see yourself as being above anyone else. You are not snooty in any sense. You are more likely than any other sign to gracefully transform an enemy into a friend. Your gentle, modest nature makes most people feel at ease. But despite all of your wonderful qualities, you do have a few traits that can hold you back in an Earth Pig year. You have a tendency to hesitate when there are opportunities. You are occasionally stubborn. You can also be timid and overly conservative. These qualities can work against you in a Pig year, leading you to become lazier and more resistant to positive change than you would normally be. But if you fight those tendencies, you can pull it altogether to make the energy of this year work very well for you. When you are engaged in a work effort that is important or meaningful to you, you work with great speed and efficiency. If you remain very conscious of your ability to be this way, you won't lose sight of your goals and productivity this year. And if you remain more open than usual to new and unusual opportunities, you can benefit from some wonderful chances to boost your income.\n\nIn this Earth Pig year, you may experience some wonderful opportunities for strengthening and building your relationships in romance, in friendship, and even in work-related connections. There will be great focus this year on your relationships, and the slower pace of this year and the sensitive home-focused nature of the year could lead you to look at your connections more intensely. You will have a clearer view of how things can be improved, and you will have the motivation to improve them. Any family ties that have been severed or suffered from conflict can be repaired this year, and you can move forward with a greater foundation of love and trust. Work or community-based relationships can also be started or expanded upon to be more rewarding. And in romance, this might offer the greatest improvement of all. You are more confident and more yourself this year. So, if you are single, you could draw in just the right romantic partner - someone who is so perfectly right for you, it will be obvious from the moment you say hello. If you are attached, your true spirit will shine through, causing your partner to fall in love with you all over again.\n\nOn a side note, one specific work-related or money-related relationship may fall outside of the positive realm creating some friction in your life briefly. But if you are calm, centered, and approachable, you can transform this connection into a positive one.\n\nYour professional life or a business venture - if you are so engaged - could be very successful this year. Likewise, if you are someone who enjoys investing - and is actively investing - you may have the chance to make some very wise investments both short and long term. But you have to be careful not to get blinded by your own success. You could do very well for yourself this year in this regard. You may find yourself being more of a risk-taker this year, but it should also wind up paying off quite well for you. You could also feel inspired to start a business or a charitable organization that you have been thinking about for a long time. This would be a great idea, for the energy this year is ideal for starting something like this slowly and building momentum as you become more comfortable and knowledgeable. You may even find yourself passionately engaged in a cause of some kind, and it could lead to great fulfillment personally, along with the benefit of meeting some very interesting people with shared interests.\n\nIn 2019, you may have a great burst of sustained luck that could result in enhanced finances and in making connections that will serve you well this year and possibly in the years ahead. To do this, you will need to rise above your tendency to be timid or shy at times and put your best foot forward. Do not fear the limelight this year. As long as you are cautious, you can do very well in this Earth Pig year."
  },
  "ram": {
    "content": "The symbolic associations of your sign, dear Ram, include righteousness and justice, peace and kindness, integrity and honor. Many people born in the year of Ram are inclined toward wealth, and even if you have not yet experienced financial success, you will, in time, find that you are on the right path where your finances are concerned. At the same time, however, you may be a big spender, so your wealth may be fleeting at times. Your gentle nature often hides a deep well of strength and fortitude. There are those who mistake your kindness for weakness, but you are not weak in any way. Your sign is among a group of signs compatible with the energy of the Pig. As this is an Earth Pig year, this should be a very favorable year for Ram people. Your finer qualities are pleasing to this vibration of energy, and your quiet, gentle nature is very adaptable to the pace this year is going to take.\n\nYou can be especially successful in business or in investing this year due to its low-key flavor. You are prudent and analytical, and your reliable nature will inspire confidence in anyone who chooses to align with you in any way. There may be many opportunities for you in 2019 that will draw prosperity and abundance to your life. This may not be new to you, but this year you may appreciate it more than you have in the past. This is a good thing, because sometimes when things come easily to you, you forget how hard other people must strive to achieve what you have achieved. Putting things in perspective will broaden your social circle because you will have a deeper understanding of the struggles other people face. Even though there may be plenty of opportunities, Ram, you need to pick and choose very selectively. You can have what you want, so why not make those choices that will be the most enjoyable and bring you the most success.\n\nYou have been on a roll since last year with accomplishing goals you have set for yourself. Some of those goals are ongoing, and this year you may continue to see slow and steady progress. Toward the end of the year, at least one of your accomplishments may bring a big reward that will benefit your life and the lives of those you love in many ways. You may also feel validated in taking some time off from the pursuit of your goals to relax, reflect, and just indulge yourself as a reward for your hard work, patience, and determination.\n\nIn love, Ram, you are loyal, loving, affectionate, and considerate. These traits are honored and rewarded in a Pig year, so your love life should flourish beautifully this year. Ram people can be dreamy and romantic, but you are also very capable of having stable, reliable, rewarding love lives. This year, those people of your sign who are already attached will see their romantic life bloom more beautifully than ever. And even though you may already be extremely close to your mate, there could be extra special moments that will draw you even closer together spiritually and in terms of your goals and shared dreams. If you remain aware of your lover's needs and are open and receptive to even those hopes you do not share, you will have a wonderful journey together this year. For single Rams, if your path has made you ready for love, you should be cautious this year in choosing who you want to become close to. That's not because there is deception to be worried about, but you may be more vulnerable to falling in love than usual. Be sure that the person you are drawn to is right for you in the long term and shares the goals and hopes that are meaningful to you.\n\nYour family life should be quite smooth and enjoyable this year, Ram. Most of the old rifts should have been healed, so this year you will be able to savor the fruits of your forgiveness and your ability to reconnect. Let go of old expectations and allow family members to be who they truly are - not who you wish they could be. This alone will further enhance and strengthen your bonds.\n\nThe Pig year has the potential to offer you a wonderful journey that could bring you greater financial security, deeper and richer relationships, and the chance to bloom fully through every desirable opportunity that comes your way. Stay true to yourself and know that your nature and your many fine qualities will serve you quite well in 2019."
  },
  "rat": {
    "content": "The charming Rat is someone anyone would enjoy spending time with. You are hard-working, thrifty, and diplomatic. You can engage with anyone. You are also very honest and reliable, and you appreciate and seek out other people who keep their word. Because of these traits, you are someone who should do very well in a Pig year. In fact, you tend to be well-liked and generally successful, and that can be enhanced in the year ahead by the overall energy of the coming year.\n\nYou may have spent a lot of time building your fortune and building your confidence last year. Hopefully, any success you achieved did not cause you to become boastful or to take your good fortune for granted. This year can be a good year overall, as long as you maintain the basic character traits that define your personality and remain true to your values. Again this year, giving back would be favored, and you know that giving back doesn't have to be all about money. Sometimes it means helping out a friend in need of advice or encouraging a loved one who is down or struggling. The more you tune in to those in need, the more your own needs will be met.\n\nFinancially, this could be a good year for the Rat. However, the opportunities that come to you may come through adversity or troubles. You have the power to turn things around, and that may be something you will face time and time again. Some of your chances at success may involve pursuits that don't necessarily interest you, or for which you have no great passion, but you need to work up your enthusiasm and recognize that these chances are leading you to something you do want. Some of your possibilities may come through partnerships with people who are nothing like you, so part of the challenge will be in adapting to someone else's ways and style, rather than demanding that things are done in your preferred way. This will not only earn you the success and security you crave, but it will polish and refine your own skills and your ability to be insightful with others.\n\nLast year you may have set on the path to be more sociable - not just with friends and acquaintances, but also with your family. Having a familial support system is essential to people who work as hard as you do, which is not surprising for the Rat people. When you work as hard as you do, you need someone to turn to when things become challenging. Hopefully, you also took more time for pursuits of pleasure rather than directing all of your energy to money or the pursuit of other tangible things. This year you may have the chance to build a very special friendship with someone who really gets you and who can be your greatest fan and your cheering section. Don't dare neglect this relationship whether it is romantic or platonic because it could drift away easily if you do. Treat it like one of your ambitious efforts, and the bond will reward you substantially.\n\nAs you become more flexible, more adaptable, and more in tune with your own emotional needs, your romantic life can flourish as well this year. Rat people who already have a significant other will find their relationship becoming deeper, richer, and more meaningful. You need to be ever-conscious of not taking your loved ones for granted, and this year you will have a taste of the wonderful rewards that are possible when you nurture your bonds. If you are single, you may find that there are many attractive, eligible people clamoring for your attention. Choose wisely, because potential romantic partners will become easily and quickly attached to you and will not want to let go. Be careful not to make any promises you aren't sure you can keep, as that will affect all of your life in a negative way this year.\n\nThis Pig year can be very warm and wonderful - and certainly very rewarding - for the Rat. As long as you remain humble, honest, straightforward, and dedicated to those who love you, you should have a strong year. Even the struggles you face will be meaningful and will teach you many valuable lessons. Pursue your goals, but also pursue your true purpose, and you will find it."
  },
  "rooster": {
    "content": "Just like the colorful Rooster that is the symbol of your sign, you are someone who stands out. You strut your stuff with passion and with attitude, and you are a person who does not go unnoticed. From that first cock-a-doodle-doo in the morning, you are a sight to behold and a force to be reckoned with. You are not afraid of the spotlight, and you don't have a problem speaking up about anything that is meaningful. Many people of your sign are quite fancy and stylish, and maybe even flamboyant. The traits that come naturally to you that will benefit you most this year include your incredible work ethic, your charming, likable personality, your resourcefulness, and your practical approach to life. If you tune in to those characteristics during this Earth Pig year, it can be very special for you.\n\nLast year you had the wherewithal and the inclination to acquire greater stability in your life. You are someone who is naturally able to think on your feet, and you improved your self-esteem, confidence, and became even more possessed of who you are, where you are going, and what you want out of life. This year, that tone will continue if you continue to build on those aspects of yourself, keep believing in yourself, and stay true to yourself.\n\nYou are ever-evolving, Rooster, and this year will be no exception. You may discover new interests, and you may plow deeper into interests from your past that you never fully explored. This will be beneficial to you on many levels. Learning and growing will help you with confidence, and it will help you to understand what's right for you, what's wrong for you, and how to strike the balance of a happier life. Your ability to ruffle feathers and your personal talent for showmanship will enhance the opportunities that come to you, for you are hard to ignore. Opportunities will be coming to you - sometimes many at the same time, which will require you to choose the best among many. But your ability to strategize and scratch the surface will keep you grounded and will give you great insight into making the very best choices.\n\nYour love life for 2019 promises to be highlighted with a positive hue. If you are single, your attractive appearance may draw in a wide variety of potential suitors who will be drawn to your flashiness but will want to stay because of your substance. Be very careful about falling for pretty faces and fooling yourself into believing it will be a lasting attraction - for you are typically drawn to beauty. You must also make a point of honing in on the deeper qualities and interesting aspects of those you meet. This year is a great year to meet someone you might want to settle down with, as you could experience the desire to nest and form a bond that will last. If you are attached, that nesting instinct will come into play as well as you find yourself drawing in closer to your mate, learning things you never knew about them, and finding deeper, richer bonds. All in all, this is a great year where your love life is concerned, Rooster.\n\nThere may be some concerns this year in your family and in your social circle. You may experience some jealousy from friends and family members who don't always understand you and who are sometimes hard on you. In some cases, these may be people who choose to see only your negative traits and are too envious to validate your positive ones. Don't allow harsh reactions to get to you, or it could change your positive vibration and slow you down this year. Focus instead on those who lift you up, and surround yourself with people who understand you and who encourage you. Being in the right element and mindset could make a huge difference in your level of success.\n\nThis Earth Pig year can be marvelous for the plucky Rooster. It will be important to remain grounded while you strut your stuff, keep your eye on your goals, stay dedicated and disciplined, and also maintain an upbeat attitude. Success can be yours if you are picky about the opportunities you choose for yourself and see them through to the end."
  },
  "snake": {
    "content": "The Snake is independent, calm, and stoic under pressure. Mysterious, deep, richly complex and sophisticated, the Snake is a study of contrasts. Outwardly, this sign may appear slow-witted and lazy, but inwardly, the Snake is bright, fast-thinking, and they have a luscious sense of humor. With your stealthy approach to life, not everyone trusts you, but nevertheless, you are trustworthy and reliable. In this Pig year, the Snake can expect a few challenges, but it can be a successful year if they rise to those challenges. First and foremost, when it comes to problem-solving and to life in general, the Snake tends to employ an analytical and very measured approach. The Pig, on the other hand, is more direct and intuition based. These contrasts can make a challenging environment in many ways for the Snake. The energy differs, and it will take some adjustment to thrive.\n\nThe slow-moving yet solid energy of a Pig year can seem almost like an environment of hibernation to the Snake at times. Therefore, people born in the year of the Snake must intentionally make a point of staying active and alert to counterbalance the measured rhythm of the year of the Pig. You can eradicate bad energy that accumulates in you because of this pace and maximize good energy by giving back in some way - such as to a cause that is meaningful to you or to your community. Keep busy and keep moving. You should also steer clear of gloomy environments and spend as much time as possible outdoors with the fresh air and sun. If you are invited to a celebratory occasion, make a point of attending. In fact, you may receive invitations this year to such a very special occasion.\n\nWhere your career or your financial security is concerned this year, you may face some challenges. This may include people who work differently from you, which could lead to misunderstandings and conflicts. Make sure everything is spelled out clearly and follow agreements to the letter. If you persevere through challenging times, there will be ample rewards. You may even experience a small but pleasing windfall, a raise or promotion at work, or the chance to invest in something quite lucrative.\n\nThis could be a complicated year for the Snake where love and romance are concerned. You are someone who does not fall in love easily, but when you do, you go all in. This is a positive thing in a Pig year, but the energy this year also demands that you know who you are and what you need most in an intimate relationship. If you have a significant other, this year will be about exploring your connection, learning more about each other, and figuring out what is missing and how you can make your relationship stronger. This can, of course, be challenging at times, but if you do the work, you will surely be pleased with the results. If you are single, this may not be the year you find \"the one.\" This year could be more about exploring what you want and need in a partner and making sure you are ready for the real thing. If you are ready, and you do the emotional work needed, you may meet someone by the end of the year who could play a significant role in your life going forward.\n\nThe Snake can be very sensitive and very stubborn. These two factors may present your biggest challenges and barriers in a Pig year. When you face predicaments where others are in control or where things are not going your way, you become quiet and withdrawn - but the best way to deal with difficult situations this year is to be open, flexible, and reach out and express what you are feeling. It might be a struggle for you to get to that point, but you can do it, and it will be beneficial for you.\n\nOverall, 2019 can be a very good year for you if you can be adaptable to changing circumstances, work on being part of a team at times rather than always being in charge, and if you can work on expressing yourself more fluidly and more openly. It will also help if you work on tapping into your natural intuitive abilities because that will increase your empathy and your understanding of the world around you."
  },
  "tiger": {
    "content": "You are friendly, charming, and good-natured, dear Tiger. Should anyone ever underestimate you because of these warm qualities, they will quickly begin to recognize that you are also fierce, courageous, brave, and not someone who will be taken advantage of. You tend to have good luck in many areas of your life, and when combined with your competitive nature, you do seem inclined to win and succeed quite a lot. You do well in environments that are wild and vibrant, and this year may be a tamer one for you, so you will have to slow down and find a way to appreciate the slower pace. Be very careful this year about indulging in some of the characteristics that could hold you back, such as being impetuous, irritable and boastful, because those traits could slow you down or even stop you in your tracks in some cases during this Earth Pig year. If you work on being humbler, more even-keeled, and completely honest and open in your dealings - even when your wild survival instinct kicks in - you will draw more success into your life this year.\n\nYou are not a homebody, Tiger, but in a Pig year, there is more focus on the home and on being content by your own hearth. Although it may not come naturally or easy to want to work on building your den, it will help if you work at making your home base cozier and warmer. Doing so will make you more inclined to spend time there with those in your life who are important to you. Just be careful about becoming lazy, as sometimes slowing down after a rapid pace can cause you to lose momentum and not be as motivated as you usually are. Although you are warm-hearted, Tiger, you are also unpredictable, and that quality can make some people feel uneasy. That's not to say that you should make yourself boring in any way, but try to be more of a planner this year - especially if you are working on endeavors that will require trust and assistance from more sensitive and more conservative people.\n\nThe pace at work, or with whatever obligations you fulfill on a daily basis, could be decidedly slower this year. You may see this as a negative, but actually, it is quite the positive. This will give you the chance to engage in certain interests or hobbies that you have neglected due to the frenzied pace of last year. Don't waste this time puzzling over what you want to do - choose something that makes you happy and go for it. This also means you can devote some time to any dreams of yours that have fallen by the wayside. This is a great year to nurture those dreams, experiment, and explore what you can do and where you can take your ideas. With your adventurous nature, the predictions for this Pig year may have you feeling like it's going to be rather boring, but you will actually have at least one chance at quite an extraordinary adventure. This could give you the chance to use your intense energy to pursue something you enjoy with great vigor.\n\nYou may deal with some crankiness this year in your personal relationships - not necessarily with others, but within yourself. Because you won't have as much frenetic energy to engage in, your mood could be touchier. But if you see this as a test of your patience, you can work on being more adaptable and open to a more relaxed way of life. Your family life will be good if you remain aware of this, and your romantic life can become more stable than it has been in a long time. If you are attached, your bond should become stronger this year. If you are unattached, you could draw in someone who is right for you, someone you will have the chance to get to know better. The year of the Pig is a good year for establishing long-term connections.\n\nIn 2019, be ever-conscious of adapting to your environment, keeping your temper in check, enjoying the slower pace, and nurturing your relationships. If you can adapt to a slightly different pace, this could wind up being a very content time for you."
  }
}
