{
  "aquarius": {
    "content": "You have always had great insight into other people, Aquarius. You can meet someone and understand them - understand their spirit and what makes them tick almost instantly. This makes you a good judge of character and an excellent leader. But for all of your insight into others, you don't always understand yourself. Sometimes you don't even look inward. Sometimes you just sail along feeding off what other people think of you, but in 2016 you did begin to look inward. You tried to figure out what makes YOU tick. You tried to discover what you want out of life, and how to get what you want. You are making good progress and you are evolving. With your enhanced insight, you will be in the perfect position to take advantage of the many chances that come to you in 2017. You will more easily recognize those opportunities that are best for you, and you will also understand why. That means you will be better able to hone your approach to getting what you want out of life. In the starting months of 2017, you may start to feel that you won the jackpot when it comes to your diverse goals because there will be numerous opportunities to reach for what you want. You will have to prioritize and choose those that mean the most to you, because trying to do too many things at once will only dilute your power. Stay focused on what is most important to you, and you will be able to triumph over the most important things to you, which in turn will help you feel like a winner all year through.\n \nLove\nYour love life in 2016 may not have been all that you hoped and dreamed it would be. You may have thought you were ready to devote a lot more of your time and energy to your romantic life, but that probably didn't happen for one reason or another. Perhaps you were distracted by other events, or maybe there just weren't the opportunities that you had envisioned. You may have felt great disappointment that your love life didn't rise to the level you wanted it to, and that may have caused some disillusionment. But you will have a lot to look forward to in 2017, Aquarius, whether you are single or already attached. For single Aquarians, you can expect interesting twists and turns that will lead you to a variety of interesting people. Around Valentine's Day you may meet someone through the friend of a friend, or at a social gathering. You might even find that a last minute blind date turns out to be a perfect match. However you meet though, you are likely to develop a very special connection that could lead to so much more. For attached Aquarians, your life with your romantic partner will heat up, and you will discover interesting and exciting things about each other that you never knew before. In 2017 where love is concerned, you can expect to be dazzled!\n \nFamily\nYour loyalty to your family was very evident in 2016, as it is virtually every year. You stood by family members who experienced trouble, and you did your best to remain connected and true to those you love. There may have been a point last year when you took a break from someone who was very difficult and confrontational, but it was a much-needed and a rational move. You have hopefully reconciled fully with this person, but even if you haven't, you will have chances to do so in the year ahead. In 2017, you can expect to experience an even stronger allegiance from your family, and you will feel a stronger desire to become closer and more involved. As we get older, it becomes more obvious that family is the heart of who we are, and you are on a perennial quest of self-discovery. One particular family member may need you very much this year - perhaps around August. This person would benefit from some of your stellar guidance, and you will gain a great sense of accomplishment from helping out and from seeing this person rise above a challenging situation. You may be hoping for a family reunion because it would give you a chance to reconnect with your roots and your history, as well as take a peek into its future. Even if one isn't planned yet, you can certainly be the force behind making it happen.\n \nCareer\nEarly in 2016, you may have had a nemesis who eventually transformed into someone who challenged you to be your best self. This person may have been a partner in your career or your business, and you probably gained quite a lot from each other. This relationship has hopefully continued and will keep going into the year ahead. You may have many different opinions and you may have some conflict with this person in 2017, but it will all turn out to be beneficial eventually. If no person of this description materialized last year, then you can expect to meet someone this year who will fill the role of challenger and instigator, but who will ultimately become someone you trust, lean on, and find inspiring. This year will be marked by ups and downs where your work life is concerned, but when you go down you will always come back up only stronger, Aquarius, so don't get discouraged. Every challenge or disappointment you experience will have an upside - even if it turns out to be the lesson you learned. This should also be a profitable year despite any problems you face, but you are advised to pour whatever extra money you earn back into your work, and you will see it grow exponentially. You may feel blessed with some wonderful but fantastical ideas this year, and you are encouraged to explore them fully and aim to launch at least one of them sometime in spring. You will have many months of trial and error, but you will eventually find your path with at least one of these ideas, and it will launch you into another area of success."
  },
  "aries": {
    "content": "The amazing Ram is strong, sure-footed, hard-headed, and up to any challenge it comes up against. But the Ram can also be playful, lighthearted, and a bit mischievous. In 2016 you had to use those first few qualities much of the time as you may have struggled at times to survive a challenging year. In the year ahead, however, you will be able to integrate some of your more charming, fun-loving elements for a year that will give a lot more back to you. You have invested a lot in your development through learning and evolving, and the efforts of your labor and investment will be paying dividends all year long.\n \nLove\nBecause of some of the challenges you faced last year, Aries, you learned to be more open and more vulnerable. You also hopefully learned to be more giving, more expressive, and more nurturing. That's good news for your love life! If you can put the lessons you learned in 2016 to work for you this year, your love life will reap many wonderful rewards. In the past, you may have been led by lust as you sought out love, but now you are geared more toward establishing a strong foundation of trust and friendship in your romantic relationships. This means that any relationship you have or will begin in the year ahead will be stronger and more rewarding. And, Aries, when you have a strong foundation in a relationship, you will also find that there is more excitement and more fireworks as well. Last year you may have been more into your love life, perhaps even giving it priority over your work. If you do have an established relationship, it has surely benefited from this, and will continue to do so. If you are seeking out a romantic partner, then your newfound way of approaching love will draw the right person to you, and will ensure that you have the skills and qualities you need for your romance to thrive. Keep in mind that you must always keep the flame burning, because that will enhance the bond you share. Love is a dance, and if you are graceful, loving, and ever-thoughtful, you will be rewarded with a rich, satisfying romantic life. For the Ram who has a significant other, 2017 will bring many happy surprises. There could be a business opportunity that will somehow enhance your relationship by offering travel to someplace exotic, or by creating greater financial security, which will offer you the peace of mind that strengthens you personally and makes you more confident in all areas of life. For attached Rams, an ongoing relationship is likely to either break apart or experience an even stronger attraction and move to the next level. If this person is the one, you will know it this year, and you may choose to tie the knot by the year end.\n \n \nFamily\nThere may have been some turbulence and perhaps even drama in your family life in the past year, Aries. This could have left you with some unresolved conflicts and some bitter regrets. Even if you handled the tumult well, there could still be some hard feelings coming from other family members. While you don't like the friction that comes with conflict, you may not have had the opportunity to fix things, and if so, that has lingered on your mind. In the year ahead - especially somewhere around March - you will have opportunities to smooth ruffled feathers - though it may take more than one attempt. If you do your best and you proceed humbly and authentically, others will see that you are determined to create a stronger family bond. If there is a sibling relationship that has been difficult because of jealousy or envy, there will be chances to grow closer and to understand each other better. If one of your loved ones comes to you with a request for assistance, say yes. This will give you time to know this person better and to show that you care deeply by being even more dedicated to the relationship. Even if you aren't asked for help, it would be nice to volunteer.\n \nCareer\nThere was a lot of action in your work life last year, Aries, and you can expect more of the same in the year ahead. Your career could be going full-tilt until mid-April, when it can begin to slow down and not require as much of your time as before. Even so, there will likely be increased financial gain despite the slower pace. You are a hard worker, and your efforts will pay off in many ways in 2017. You can benefit from new business opportunities and positive alliances that can bring you even more business, and the chance to broaden your involvement in the areas of your work that you love the most. If you play your cards right, there could be a chance by the end of summer to branch off into a new area, and with that chance, you will have an increased responsibility and a lot more fun! If you put some of your exciting ideas into action in the year ahead, be discreet about what you're planning. If you confide in the wrong person, you may later find that there are attempts to steal your thunder. Be bold to explore beyond previous boundaries, but make sure to play it safe at the same time."
  },
  "cancer": {
    "content": "You may have started out in 2016 with a melancholy outlook and a desire for solitude. You may have kept your distance from emotional situations because you just didn't want to deal with any sticky situations. Perhaps you closed yourself off from some of your usual social activity because you were feeling more introspective. Gradually, however, you began to come alive again, though slowly at first. Your life has gotten better and more serene, and it continues to become more beautiful every day, despite some remnants of sadder moments in the past that arise in your memory from time to time. These remnants can dissipate if you give yourself a chance, and you will have plenty of opportunities in 2017 to open up your heart and begin to feel more like your old self. In fact, there will be many positive changes in your life in the year ahead - and in many areas of your life. The symbol of your sign is the Crab, and just like the crab, you protect yourself with a tough outer shell, you also move sideways in a sense; not always revealing your deepest feelings because you don't want to get hurt. Your sensitive nature has been both a blessing and a curse, but in 2017 you will come to see it as nothing but a wonderful blessing. You will feel deeply and you will have much to feel good about. Trust in the universe to write you a happily-ever-after kind of tale in 2017.\n \nLove\nYou probably had quite a number of wonderful opportunities to make your love life richer in 2016, Moonchild, but many of you born under the sign of the Crab chose a solitary path. At times you probably fantasized about a romantic, fulfilling love life, but the reality of going through the effort to make it seemed so daunting. Even so, and even though it may seem that way - you have not given up on love. You may have grown insecure about your love life and your own value; or you may have become shy about expressing yourself romantically, but these are areas where you can build yourself back up if you are patient. For single Moonchildren, you could meet someone very special pretty early in the year. This person could coax you out of your shell, and the gentle persistence you see will win you over. Don't panic when you begin to have feelings for this individual. Just calm yourself down and enjoy exploring what you two are like together. You may be very surprised by the depth of feeling you develop for this person. For those Crabs who are attached, you will need to make a conscious effort to tune in to your partner and show the nurturing side that will come naturally to you once you open the floodgates. You may have been emotionally absent for a while, and it's time to return your love life to its former state of splendor.\n \nFamily\nYour family life may have been out of balance in some ways in the last year, Moonchild. Sometimes family drama can affect you profoundly because you are so sensitive and so family oriented. It may have seemed as though certain family members were ganging up on you or leaving you out, which probably made you feel very alone. Since you function best in a strong family environment, Moonchild, you may have felt out of whack in many areas of your life last year - even if some of it was just your perception versus the reality. You have hopefully learned to be less volatile in situations like this, and a reserved state is the best way to deal with this kind of situation. If you hold yourself back from reacting, you won't say anything foolish that you will later have to explain or take back. Even if your family life has not been idyllic, it is improving slowly and it will continue to do so. You may not see it, but small changes are happening that will make 2017 a much better year where your family is concerned. You may have to continue to bite your tongue, and you may be the one who has to reach out and step up most of the time, but as the year progresses, you should be feeling much better about the way things are between you and your loved ones. And if your family situation has been pleasing, it will become even more enjoyable and inspiring in the year ahead.\n \nCareer\nWhere your career is concerned, Moonchild, sometimes it seems like you just can't catch a break. Although there was a bright light of opportunity at the end of 2016, it may still be on hold or evolving. Don't give up on this chance, because it is still very much alive, even if it doesn't seem that way. At the beginning of 2017 - just as you want to abandon any thoughts of this being a possibility - this opportunity will spring to life again and take you where it originally promised to take you. In fact, the magnitude of what happens with this opportunity may leave you awe-struck. When you have the chance to express yourself, be as creative as you dare because you will be in the spotlight, and you will have an extraordinary opportunity to shine. And, if you play it right, this chance will open up so many other wonderful chances your head may be spinning all year long. It has been a long time coming, Moonchild, but your time has come, and the many seeds you sowed over a long period of time will suddenly begin to pay off for you in 2017 and beyond!"
  },
  "capricorn": {
    "content": "In most aspects of our life, Capricorn, you are an inventor and an entrepreneur. You see everything you do - not just exciting opportunities, but even the most mundane of daily tasks - as a chance to refine and perfect. This tendency can get tiresome for some people. But for you, this is the framework of your life and it gives you comfort. In many ways, this extreme attention to detail makes you feel secure because you can control any situation for a fairly predictable outcome. In the past, others may have been a bit frustrated by your attention to detail, but in 2016, it became a sense of comfort for some of the people in your life. That's because you were a guiding light and a steady force of hope for certain individuals, and they have come to see you in a new light because of it. This validates your way of doing things, and it has also opened the door to greater self-acceptance. In 2017, you are at the top of your game in every way. You may have gotten involved in many opportunities last year, but they were slow-moving and, at times, frustrating for you. While you are fine with steady progress, there were probably more disappointments and delays than you would have expected. This year, by contrast, you will find things moving far more quickly. Ventures you began last year will begin to take off, starting in February. Once you get off the ground, you will sail far and high pretty quickly. You can look forward to a splendid year with a variety of successes.\n \nLove\nIn the past, Capricorn, your work was often more important than your love life. Last year, however, you dedicated more of yourself to the pursuit of love and passion, and that hopefully had a satisfying impact on your life. Where it used to be all work and little play, there is now a greater balance for you when it comes to romance. There may have been ups and downs, Capricorn, but mostly there were ups and you've gotten used to a more serene experience with love and romantic relationships. In the early part of 2017, you may be distracted a bit by work responsibilities, but you know enough now to dedicate whatever time you can spare to indulging in your relationships - especially when it comes to love, and they will remain strong because of it. By early spring your romantic life should begin to bloom. If you are single, you could find yourself invited to a variety of social engagements where you are bound to meet many potential romantic prospects. You probably won't be in any hurry to settle down this year, and so you may be surprised when you meet someone who makes you want to take a relationship to a much higher level. If you are attached, your relationship will be remarkably carefree and enjoyable, with the sharing of exciting new experiences, such as travel abroad. Continue to make love a priority, and your love life will continue to reward you all the way through the end of 2017.\n \nFamily\nEven though you have become more patient, more stable, and more dedicated in your love life, your family life may have been another matter in 2016. Extended family members may have created some conflict in your life, and you probably would have rather avoided them than dealt with any issues. You are famous for avoiding conflict at any cost, but as you know, Capricorn, avoidance sometimes leads to even more conflict. You may have grown distant or even estranged from a certain family member, and you know that is something you will have to deal with this year. It isn't mandatory of course, but you know that your life is better with this person in it. Summon your courage and approach this person early in the year, and you'll have a lot of good times to share together all year long. Once you break through the emotional barrier of reconciliation, all of your family relationships will become easier and more peaceful, and therefore more enjoyable. In fact, you may find yourself growing closer and closer with one particular family member. This will be someone who you have admired even though you often kept each other at arm's length. Now your bond with this person will flourish. Good news from a family member around June could be just as thrilling for you as it is for that person.\n \nCareer\nDespite a more casual approach to your career or your business in the last year, Capricorn, your entrepreneurial spirit is glowing and you have done well with any opportunities you were lucky enough to receive in the last year. Your steady nature is appealing to business partners and potential clients, and anyone who can benefit from your excellent work ethic. Any career-related upsets or disappointments you experienced last year were probably very minor, and so you maintained a stable, steady outlook on your work life. As 2017 begins, you may receive an invitation or a chance to get involved in an opportunity that seems to have wonderful potential. This will be very exciting to you, but you need to look at it carefully before you jump in. In fact, it would benefit you to ask someone you trust to look into it for you as well, because an objective opinion regarding this opportunity would be beneficial and enlightening. Your career will operate at a more intense level in 2017, especially in June and July, because you will feel driven to accept and master any opportunities that come your way. An old friend - not necessarily someone from your work life - may reconnect with you, and this person could be significant in some aspect of your career. By December of 2017, you will have great satisfaction for your accomplishments and for your prospects for the year to come."
  },
  "gemini": {
    "content": "People who don't understand you may see you as having diverse personalities because you are a person of many moods and because you always seem to be going in many different directions. Actually, Gemini, you have many facets to your one big personality, and your broad focus allows you to understand all the nuances of any situation. You can talk easily to people from all walks of life, and you can understand and empathize with them. This means that you have all kinds of friends, and that you have a wide range of dissimilar interests. You have hopefully experienced a wealth of good experiences over the last year, Gemini, and you may chalk it up to good luck. But in reality, you earned every one of your blessings through discipline, hard work, and of course your empathy and kindness. You are someone who sticks by the friends who stick by you, and you should have a strong foundation of friendship in your life. If you don't have it, the year ahead will be an excellent time to expand your network of friends. A spiritual quest you may have begun last year will carry into this year, and you will learn quite a lot about yourself in the process. Any success you enjoyed in the past, and the success you will surely enjoy in the year ahead, will be magnified by a greater sense of self than you have ever had before.\n \nLove\nIf you have a nemesis when it comes to your love life, Gemini, it is your multi-faceted personality and the difficulty you sometimes have in staying focused. This may be a recurring theme in your life, with romantic partners who just don't understand your big personality. You have a hyperactive imagination and a strong sense of ambition, and this often causes you to shift your attention from one thing to another. Naturally, a romantic partner who wants your full attention is going to feel as though they're competing with a plethora of other interests you have. This year, Gemini, you should work on staying focused on and nurturing your love life. If there is someone special in your life, set aside some time on a regular basis to express how you feel about that person, and to spend time together in a setting where you can concentrate solely on each other. This alone will enhance your romance and keep the fire burning. In February, you will have a chance to meet someone very special, or to grow closer to someone you already know and love. Times like this are gifts from the universe, and you can't waste them. Make sure you take each opportunity in the year ahead to strengthen your love life, and your efforts will repay you with a closer bond that will keep you warm and fulfilled.\n \nFamily\nYour family life may have been pretty predictable over the last year, and the strength of your bonds with family members has probably been pretty solid. Old wounds had a chance to heal, and disjointed relationships grew closer. There may still be one family member who just can't seem to get with the program, but this may not affect you directly. Even so, the effect this conflict has with other members of your family could be upsetting to you. You will need to recognize that you can't control everything, and just allow the situation to evolve on its own. There could be a few family-related surprises in store for you this year, Gemini, and most of them will be delightful. This may mean an unexpected new member of the family - either a baby or a marriage that seemed to come out of the blue. If you accept any surprises with grace and support of the individuals involved, then you will be able to share the happy moments. Try not to be judgmental even with situations that you find bothersome, and over time you may come to see why your support makes good sense. Most of all, you need to continue to nurture the family bonds that have been fragile in the past, because these people are the ones you will turn to in times of stress or crisis, but also in times of joy.\n \nCareer\nYour energy may have been very scattered over the past year as you learned about new possibilities for your career, and as you came to know more about what's most important to you. You should have a strong sense of where you want to go with your work now, and that is the foundation for a strong start with a new endeavor. You have big plans and big dreams, and this is the year when you can finally get started in earnest. It may not be obvious to you yet, Gemini, but you have become quite knowledgeable in specific areas of your career. This has come about over a long period of time, but you have accumulated so much experience that you are now someone that others can turn to for advice and guidance. Even so, there may be a new mentor entering your life, who can do the same for you. This person could serve as a gateway to a new opportunity around midyear, when you may have to make a choice about your direction. This could mean giving up something you have been working on in favor of branching out in a different but promising direction. When you arrive at this crossroad, you will know instinctively which way to go. You should enjoy a new and exciting level of success in 2017, which you certainly earned."
  },
  "leo": {
    "content": "When you are at your best, Leo, you are strong, courageous, and sure of yourself. You exemplify the very best qualities of the majestic Lion - the symbol of your sign. You have been through a challenging few years, Leo. Some significant changes happened in your life during that time, and it impacted the way you see the world around you, and the way you see yourself. You came back more into your own in 2016, but you aren't all the way there yet. There is a lot to adjust to, Leo, but you are doing just fine. You should be in the process of regaining your balance and centering yourself. You have hopefully rebuilt your confidence and reframed your optimistic outlook on people and on life in general. As more beautiful adventures open up to you in 2017, you will complete a cycle that has taught you a lot about yourself. You will have a new way of looking at everything, and that means many new beginnings for you. In many areas of your life, big opportunities will give you chances to shine in ways you never have before - including in areas that draw on your deep well of creativity. Making discoveries through exploration that lies outside of your comfort zone will become easier for you, and using your creativity to evolve even further will be very rewarding. This will be a landmark year for you in so many ways, Leo.\n \nLove\nLove is always a central focus of those born under the sign of Leo. You do everything in a big way, and your love life is no exception. You are deeply passionate and romantic, and you may spend time, even daily, thinking about some aspect of your love life, whether it is to fix something that isn't right or to enhance the romance you cherish in some magical way. You may have had some ups and downs in this area of your life in 2016, Leo, but you are an eternal optimist - especially where love is concerned. There may have been some romantic disappointments last year, but even so you should be feeling hopeful about the year to come - as you should! For single Leos, this could be a thrilling year. You will find that your charm and charisma are blooming in the early part of the year, and that will translate to lots of admiring glances cast your way. You will have the pick of attractive paramours, and that's where the fun begins. Once you choose the one who sets your heart on fire, you could experience a whirlwind courtship that will bring you moments of joy, laughter, and fiery romance. For attached Leos, overall this will be a year filled with happy moments. You may choose to take your love away on an exotic vacation early in the year, where you can spend days or weeks doting on each other. Taking a vacation where you can reignite your romance and simply spend some quality time together is something you should do more often this year, and it will bear great fruits of passion and connectedness. Yes, Leo, this could heat up to be a very exciting year whereas your love life is concerned.\n \nFamily\nWith family matters throughout 2016, Leo, you may have had to restrain yourself in a way you have never done before. There were probably many times when you had the urge to jump in and fix everything, but you knew it was best to wait it out and allow others to take the lead. There were lessons to be learned, and in some ways it was also a matter of self-preservation. You know that immersing yourself in issues that others should address themselves can only bring frustration and resentment. Your reserved approach to your family life last year will continue to pay off for you in 2017. You should find that formerly troubled family members will begin to stand on their own two feet more often, and you can get on with your own business. This will also give you the chance to share in more joy than heartache, and to actually enjoy your family life in a new way. Someone at a distance - perhaps a relative you have not seen in many years - may approach you with an idea. This could be an exciting concept that may bring you good fortune, and will also give you the chance to reacquaint yourself with someone you once enjoyed and connected with. By mid-July, someone in your immediate family may share some news that will make you feel proud and happy.\n \nCareer\nThe last year may have offered you a variety of new beginnings in your career or business. You hopefully had the chance to explore a new venture that was gratifying for you on many levels. As 2017 begins, you may be thinking about branching off and getting even more involved in something you began last year. The timing for this is excellent and you are in prime shape mentally and emotionally to start something new and exciting. Be very careful about taking on big risks, because this is a year when you should be a bit more conservative than usual. That doesn't mean you shouldn't explore some of your wilder ideas - you should. Just be careful to back up any wild ideas with the appropriate research and due diligence. Protect yourself, but also get adventurous - explore to ultimately discover what makes you feel happy and fulfilled. An encounter with a potential mentor or someone who can connect you to a special opportunity could happen in August, and this could be life-changing where your work life is concerned. The key to being successful will also lie in enjoying the process rather than worrying too much about outcomes. If you take care of each venture carefully, you should reap big rewards for your efforts."
  },
  "libra": {
    "content": "Your sign is represented by scales. It must get awful tiresome carrying around those scales and feeling compelled to weigh and measure everything. Being fair and upholding justice are noble principles, but it can be hard to be so perfect in daily life. You may have carried a big burden in this regard throughout 2016, Libra, but the time is coming when you will finally be able to put that burden down. Many people in your life have turned to you over the last year to mediate, to help them make important decisions, and to figure out what is fair and what is not. You have also had your own share of personal issues to deal with. You have been the steady voice of reason, but, unsurprisingly enough, it has taken a toll on you. This year, even from the very beginning, you will feel lighter and freer. There won't be as many requests for your judgment and your time, and you will begin to get a taste of what it's like to feel carefree. Even so, Libra, you may have to recognize that you have always given too much of yourself over to others, and you know this is something that has to change. You will have chances to put this new philosophy into practice, and you will be rewarded with more time to pour into your most important goals. Stand strong on your new way of dealing with this issue in the year ahead, and you'll become more of an advocate for yourself in time.\n \nLove\nThe past twelve months may have been a crazy mixture of highs and lows in your love life, Libra. You may have traveled from the depths of despair to the heights of passion, then up and down again. You most likely ended 2016 on a high note, with peace and harmony in any love relationships. Now, as you are entering a new year, you will see it is ripe with new possibilities for your romantic life. If you can think back and identify what preceded the highs and lows in your love life last year, you will be able to recognize how to avoid certain pitfalls, and how to make the most of the chances you will have for closeness, warmth and passion in the future. Single Libras will probably have quite a lot of fun meeting a number of eligible romantic prospects - especially in the first part of 2017. But you may not be as interested in passionate flings as you are in meeting someone you can really trust and care for ﹘ someone who'd care as much for you as well. That is a possibility this year, but probably not until later in the year. Those who already have a significant other - especially those Libras who are married - should experience a very social year with your lover that will allow you to spend a lot of time \"dating\" and recapturing the excitement you had in the beginning of your relationship.\n \nFamily\nYou hopefully broke through a gridlock in one or more family relationships in 2016, Libra. There was a lot of work to do to get back on track with family matters. There may have been some jealousy and resentment to deal with, but you had the grace and caring nature to gently lead the way to make things better. In the year ahead, you will reap the rewards of your efforts, and you will enjoy an unprecedented closeness with even the most difficult members of your family. That's not to say that you won't occasionally hit a speed bump, and then you will have to go back and repave the road you already traveled. But once you experience that once or twice everything will even out and become easier. Pay extra attention to a family member who is out of sorts and behaving out of character. This person may need special support and guidance from you, but if you show your love and caring by checking in with this person and coming with suggestions to motivate and inspire your loved one, the issue will become more and more manageable until it disappears. A family reunion or a gathering of a group of family members who have not seen each other in ages will be possible this year, and it will seem like you've gone back in time. You will recapture memories that you cherished, and it will feel like a fresh start. Towards the end of the year, due to prevailing circumstances, you may not be able to fulfill some of the promises you made. Your loved ones will have a tough time forgiving that, therefore carefully weigh your promises and only promise things you are certain you can fulfill.\n \n\nCareer\nYou have always had the potential to be a mover and a shaker, Libra, because you possess a very rare blend of wisdom, objectivity, fairness, foresight, and innovative thinking. In 2016 you may have had many challenging lessons to learn, but they were good practice for some of the opportunities you will face in 2017. You may have encountered more than your fair share of disappointments and difficult people, but you generally handled yourself quite gracefully and morally. And you were noticed, Libra, by people who you will cross paths with again in the year ahead. Some of these people are quite powerful and have the ability to turn the key on some of your dreams, and you will be ready, willing, and able to reach for the stars. Toward the end of last year, you may have noticed a sudden change in tone. All of a sudden you felt more electrically inspired and involved in projects that were of a higher caliber. You will find that beginning in February your opportunities will begin to be increasingly exciting and rewarding. Anything you do now will seem to be blessed and luck will be on your side. If you work hard enough through the first half of the year, you will start seeing results long before the year ends, and you'll be sailing towards even greater success, with the steady wind in your sails."
  },
  "pisces": {
    "content": "Pisces, you are wistful, sensitive, kind, intuitive, and dreamy. Not everyone gets you because you are truly a fish of a different color. Your creative nature sometimes defies logic, but somehow you can make progress with even the wildest of ideas. You may have struggled last year with certain responsibilities in your life. It isn't that you are irresponsible; you are truly moral and reliable in terms of your character. Sometimes, though, you become so distracted and scattered that you don't fulfill all of our obligations and you occasionally find yourself floundering. As the year came to an end, however, you began to see a light at the bottom of a long path, and you have been headed in the right direction in an effort to improve yourself and your life. You are doing well, Pisces. You bring with you into 2017 a new sense of yourself, a new determination to do better, and an extremely creative nature. The possibilities for you this year are endless, as long as you stick to your new way of doing things and you don't give up. Above all, you have to be true to yourself, to your vision for your life, and to making your dreams come true. Be brave in 2017, and work on building up your confidence. With proper confidence, you can do anything you set your mind to this year.\n \nLove\nLove aspect has been a challenge for you lately. Perhaps even for several years now. It may have been that you haven't known what you wanted, or that the relationship you had, if attached, was conflicted; or the people you met, if single, were wrong for you. You have certainly had your ups and downs in love, and right now you may be thinking that you've had mostly downs. If that's how you feel, then you'll be happy to hear that it's about to change in 2017. Where you once met frustration and longing, you will soon find comfort and excitement - a rare combination. Attached people born under your sign will find yourself thrust into situations that will enhance and empower your relationship with your romantic partner. You will learn more about each other, and you'll be in for some pleasant surprises. You might even decide to take another honeymoon, or take some sort of voyage for just the two of you. This will help you to grow closer and feel even more intertwined. For single Fish, the world is your oyster. You should have a variety of potential partners to choose from if you wish to explore the possibility of a permanent relationship. It may be a hard choice, but someone will eventually stand out from all the others. At first, you may be thrilled by the prospect of a thrilling life with this person, but there could be a few bumps in the road until you get into the right groove and begin to grow closer and build a strong foundation. Cherish whatever you have, and devote your time and attention to it, and you can make this year quite memorable.\n \nFamily\nIt has been a long process, Pisces, and it isn't completed yet, but you have grown increasingly closer to family members that have been estranged or distant in recent years. You may have felt that you weren't appreciated or admired, but you have grown more confident in yourself, and that has allowed you to accept that others do love you and respect you and your talents and abilities. This new sense of who you are and what you are made of is contributing greatly to the heightened quality of your life and all of your relationships, and it will continue in the year ahead. Last year there may have been some significant challenges with a parent, a child, or perhaps a sibling. This is someone who is or was intensely involved with you, and someone you felt deep love for. You may have felt that you were rejected or looked down on by this person, but that was not the case. You have come to see things more clearly, and now your relationship can expand and evolve. There may be one more barrier you would love to break through where a family matter or a family tradition is concerned, and you will have the chance in 2017. Just keep in mind that you need to understand and empathize with other perspectives, and sometimes you need to move slowly if you want something to change. This year should be dramatically more fulfilling and enjoyable if you maintain a harmonious approach to family members, if you nurture your own self-esteem, and you devote your time and attention to making your family life better every day.\n \nCareer\nYou may feel you have been bewildered where your career is concerned - or the lack of the career you dream of. You may have tried on many different kinds of work outfits by now, but for a Pisces, it has to be a perfect fit - one that allows you to use your creativity and your intuition too. Sometimes we have to do whatever we can to get by, but if that's where you are right now, you may find it lonely and dull. You crave the challenge of creative thinking, and you want to allow your imagination to run wild, but that isn't always possible in the line of work you've had recently. If you are looking to change your career then open your mind and allow yourself to think less restrictively about your career options, you will discover something that can provide all of the things on your checklist. You may have to go out on your own to completely fulfill all your desires for your work life, and that comes embedded with certain risks. But what's at stake is your happiness, and taking a few risks for achieving happiness will certainly be worth it. If you have something specific in mind, see if there is someone you know who can assist you or guide you. An excellent mentor is likely to be available for you this year. By indulging in your own personal interests, you will cross paths with a person who will understand you very deeply, and will feel honored to guide you toward the career or the business of your dreams. Don't close your mind to possibilities that may not seem like a perfect fit on the surface, because there may be a possibility in August that is extraordinarily right for you, even if it doesn't appear so on the surface. Let your heart lead you, Pisces."
  },
  "sagittarius": {
    "content": "What are you aiming for this year, Archer? Whatever it is, you stand an excellent chance of getting it! That's because you paid your dues and accepted the lessons that were offered to you over the last year. You are a new person - you are your very best self. That doesn't necessarily mean that there aren't still lessons to learn and dues to pay; because learning is a lifelong experience. But you are in the perfect place right now to make major strides toward the things you want most out of life. And luckily this year, you will have the right opportunities to put your dreams into action. It is the perfect storm of having the experience, the talent, and the opportunity all at the same time. That means that your words are magic, your touch is golden, and you have the power to heal yourself and reinvent yourself. You may have begun to discover your purpose here on earth - or at least one of your main purposes for being here - and you have started to explore that. In 2017 there will be chances to really immerse yourself deeply in whatever you find yourself compelled to do, and you need to accept every opportunity you can to fulfill your destiny. This is bound to be a really fabulous year for you if you love yourself, take care of yourself, and are being persistent in pursuing your dreams.\n \nLove\nWhereas last year you were a beautiful bud, this year you are in full bloom. During the last twelve months you opened up slowly, learning more about yourself and also gaining greater insight into other people. You have high ideals where love and romance are concerned, and sometimes your expectations are unrealistic. You want hearts and flowers and seamless communication, but life isn't always that easy, Sagittarius, and you have come to recognize that you need to be more flexible and to not have restrictive ideas about how love should be. If you are attached, your love relationship probably grew incredibly well over the last year, and hopefully you are both on the same path now. If you experienced growth together, you can probably see a brighter future filled with even more love and happiness. Continue to nurture this relationship, to explore each other's needs and dreams in a non-judgmental way, and you will continually strengthen your bond. If you are single, you need to be more open to the people you meet. There may be someone you might not ordinarily associate with who could be a terrific lover and companion for you. If you have a specific list of requirements in person to fulfill and you are not open to other options then you might not meet the person of your dreams, Sagittarius because no such person exists. You should try to let go and go with the flow. You never know to what pleasant surprises this may lead to.\n \nFamily\nLast year there may have been certain family relationships that were in conflict, and at the time, in the heat of the moment, it could have seemed that there was no hope for reconciliation, let alone a stronger, closer bond. You may have given up on ever having that, and replaced the need for that family connection with other relationships. Toward the end of the year, however, you probably began to hope for more again, and as this year begins, it can all start to come true. If no one from the other side has reached out to you in some way, maybe you should be the one to make the first move. You may be hopeful that this relationship can become what you have always hoped it could be. The good news, Sagittarius, is that it can indeed be what you've envisioned. This relationship is rich with possibility, and it is up to you to keep working at it, nurturing it, and having the highest of hopes for it. You will still face some ups and downs with certain family members, but you have to remember that this is natural, and you must vow to always return to that person with love and the hope that your connection will be strong and that you are committed to making it so, Sagittarius.\n \nCareer\nYour work life was more active and maybe even more exciting in 2016. If it was a bit stressful at times, there were certainly rewards along the way that made it worth it. You probably learned a lot, and you likely made a lot of wonderful connections. You may even have had a mentor who taught you priceless lessons that you can use in the year ahead. If you find such a person - try to hold on to them and make sure they stay in your life. That mentor could play an even bigger role in your life in the coming year Sagittarius. You will continue to learn from this person, but there may be a new dimension to your relationship - such as a partnership of some sort or this person could introduce you to other key people and help you forge good relationships with them. This person could also lead you to an opportunity in 2017 that has the potential to change the course of your life in a very positive way. In addition to this experience, you will have involvement from many new people who will enhance your experience by sharing their own important lessons with you. This year you will have the chance to make a lot of progress toward the successful future you have dreamt of, but you may have to commit yourself to longer hours and some stressful situations again. The intensity of this phase will level out by mid-year, and by year end you could start seeing everything seemingly running by itself, leaving you able to relax more often and to enjoy a richer personal life. All in all, you can pack a lot of momentum into 2017 if you are dedicated, and that will create a great start for a successful path forward into your future."
  },
  "scorpio": {
    "content": "You have been a little less secretive and private over the last year, Scorpio, and tried to be more open to those who hoped to know you better. In return, you got to know certain people in your life on a deeper level too. You may have found that experience to be surprisingly rewarding, and it had also probably changed you in some ways. This broadened awareness of connecting more spiritually with others will be used to great advantage by you in 2017. This means that you will have closer relationships that will bring a new level of joy into your life. It also means that you will meet people you might not ordinarily want to get to know because you have a heightened sense of insight into others now. This year could bring a lot of exciting changes, Scorpio, and many of these changes will involve dreams and desires you have held dear for many years. At first, you may have a lot of old business to deal with, but once you are free of old obligations you will embark on a new chapter of your life that will be filled with opportunity. As early as February, you could meet someone you have admired intellectually, and that person could offer you entrée into some sort of an investment that has huge possibilities for you. You will surely want to say yes but don't do so haphazardly just because you trust this person so much. Even though this proposition is probably a good one, you still need to make sure you do your own research.\n \nLove\nFor most Scorpio people, love and lust are always closely intertwined. For most people in general, attraction usually springs from the physical. But your attraction to someone usually begins when you sense a blend of the spiritual, the physical, and the soul. You love deeply, but it takes a lot to win your love. You are naturally suspicious because you don't want to waste your time and energy on a relationship that doesn't have a good chance of working out, so you like to learn as much as possible about someone before you take the steps toward commitment. In the year ahead - for single Scorpions - you will have a deep desire to connect with someone on all of those levels, and you will begin a quest to seek out the perfect one for you. It may not be easy, because you may wind up looking for love in all the wrong places based on experiences of last year. But once you hone in on the right tone for your search, your love will seem to appear suddenly. You have the tools now to make this work if you devote proper time and nurturing to the relationship. For attached Scorpions, your relationship could be elevated to a higher level this year. No matter how long you have been together, you may begin to notice things about your significant other that you never noticed before. You will begin to find your lover more interesting, and the romance in your relationship could heat up considerably. Go with this, Scorpio, because if you take advantage of the spell you're under, you will reach new heights in your relationship that will be truly exciting.\n \nFamily\nWith some family members, you typically endure a rather distant relationship. There may be complicated factors causing this, but you aren't one to analyze what might be wrong. You prefer to avoid confrontation or complication, and these people in particular, may be overly emotional or demonstrative, and that makes you feel uncomfortable. While you could accept opportunities to grow closer, you may not have the desire because you are nervous about what that might involve. Try to work at increased closeness anyway, Scorpio, because it would be good for you to have a group of people you can turn to and count on when you need someone, and those who know you best would be ideal. One family member out of this group may go to great lengths this year to learn more about you, and to get you to learn more about them. This would be an excellent thing to do because it will help to give you insight into your background, and it will also help you to understand some of your own motivations. In September, you may have to be the one to lead others with a family decision, but this will be a happy occasion that you will enjoy. Towards the end of 2017, big news from a relative at a distance could cause you to rethink a recent choice of your own.\n \nCareer\nYou may have started a new career adventure in 2016, Scorpio, but perhaps it may not have gotten started with the bang you had hoped for. In fact, it may have continued to move slowly throughout last year, and by now you may be wondering if it's even worth continuing. Most likely it is worth continuing, and you will see signs of that early in 2017. No matter what your career path is though, you will experience slow and steady progress. Along the way, there will be many signs of hope and moments of inspiration that will show you that you need to keep going no matter what you face. You aren't a quitter, and you can certainly conquer even the toughest of obstacles. Tap into that determination and try to inspire yourself all over again if you ever have moments when you begin to lose hope. If you are loyal to your goals, you will be rewarded with a huge burst of progress sometime in May, when new doors will open and new people will show up to instill more hope into your dreams. For some of you, there may be a chance to include someone else in your career plans in some way, and that would probably be a very good idea. Just keep moving forward because you love what you do, and don't give up."
  },
  "taurus": {
    "content": "You are strong, tough, and determined. The Bull, the symbol of your sign, is a perfect reminder of how powerful you are. You are so powerful, in fact, that it can be hard for you to ever rest or take a break. Others turn to you, and you always accept your responsibilities and obligations graciously. During 2016 you may have struggled with this. When friends and loved ones turn to you, you can't help but say yes. And then it is often you alone who fulfills what they need. Last year was also an important turning point for you though, Taurus. Hopefully, you learned to be a little less independent, and you opened yourself up to accepting help more often from others. This is a critical lesson for you, because if you continue to be so independent, it will eventually weigh you down. You may have come a long way, but there is probably still a long way for you to go. You need to be unafraid of asking others for assistance when you need it. This will help you to bond better with others, and will also take a lot of weight off your shoulders. You have been getting better at drawing a line when others ask too much of you, and you need to continue growing stronger in that area as well. The year ahead will offer you many chances to practice this, Taurus, because others will still be turning to you way too often out of habit. Perhaps the biggest focus for you in 2017 - especially in the first few months - will be your career and making money. You will be very driven toward creating a strong foundation and a prosperous future for yourself and your loved ones. You will find many opportunities that could lead you to greater security, Taurus, but you will have to be judicious in your choices. Your innate common sense will guide you well.\n \n\nLove\nIn 2016 you were advised to be more forgiving of yourself and others, Taurus, and hopefully you have evolved successfully in this direction. You have always been hard on yourself, but you are someone who genuinely does your best and you can't cling to regret or guilt, or you will not be able to become your best self. In the area of love, people of your sign are sometimes slow to learn and to grow. Your mission this year will be to open yourself up more - not just in romantic relationships, but in all of your relationships. The more you practice being more open and more interested in others, the more you will grow and develop as a person in general. And when your heart is open, you can expect your love life to thrive.\n \nHopefully you have gotten into the habit of nurturing yourself better and more often, Taurus. If you take good care of yourself, you will be better at loving yourself and loving others. In 2017, you will have several chances to meet new people who could be important in your life - both romantically and otherwise. Many social invitations should begin coming to you during spring and the trend should continue long past summer. Try to get out and about and to socialize as much as you can, because there will be many kindred spirits out there for you to meet. This could be a truly fulfilling year for you if you have faith in the stars to guide you.\n \n \nFamily\nYou have the capacity to draw a lot of love and support from your family, and you are so family-oriented that you may connect or at least try to with family members on a daily basis. Tradition is important to you, and others in your family circle often turn to you with questions on family history and happy family stories. In the year ahead, there may be a very big family get-together of some kind. This could be a family reunion, a wedding, or a birth celebration, and it will give you the chance to connect with relatives you haven't seen in quite some time. You may discover that someone you remember from your childhood has a unique connection to you now that you would not have imagined, and you may grow closer to this person in 2017. You are often the family mediator, Taurus, but that is a role you should discourage in certain situations because it can bring great strife and anxiety. It's great to be able to help out when you feel it is worthy of your time, but in truly conflicted situations, you need to bow out if you think it will put undue stress on you. Luckily, the year ahead should be more stress free, and you should see very few conflicts, large or small, so your year should be quite harmonious where family is concerned!\n \nCareer\nYou may have done a lot of thinking in 2016 about tapping back into some of the big career and business dreams you may have shelved in the years before. You may even have taken first steps in exploring what was possible with some of those old goals. If any of them seemed possible and you still had interest, hopefully you went on in your exploration process. Even if you didn't get very far, Taurus, the coming year will offer you several chances to keep going along that track. This will be a good year to try to make your dreams come true for you, and if you've already done some discovery, you have a head start. A huge career opportunity - one you may already have an inkling about - could come to you before July. Your mission now is to build up your self-confidence and your knowledge in the areas that are of the greatest interest to you, for it will be critical that you know what you're doing and that you feel in control. Others will turn to you for guidance, and you need to feel sure of yourself and your ability to lead. Even if you don't make a lot of progress with your goals initially, you need to keep forging ahead because your hard work will pay off in the long run."
  },
  "virgo": {
    "content": "You began coming into your own last year. You learned a lot about yourself, and you tested the edges of new boundaries. But in typical Virgo style, you are moving slowly through your evolution. That certainly isn't a bad thing because it gives you the chance to absorb what you see and experience and to live with it for a while before you move on to the next step. In 2017, you will make many more exciting discoveries about yourself, your talents and abilities - including the ability to have your voice stand out from everyone else's. That may be a completely new experience for you, Virgo. Even though you have always had your very own unique voice, you don't always speak up and express yourself. You would rather be discovered than chase attention - but attention and opportunity do not often come knocking at one's door. There will be many chances this year to show off your newfound sense of self, but one of the best and biggest breakthroughs could happen in September, when you will be able to present something you designed and created, and which has the potential to have a significant impact on your life in the future. Continue to strive to sculpt out your highest self, and the more you define who you are, the more you will enjoy being you.\n \nLove\nAs you continue to slowly evolve into your full self, Virgo, you will begin to meet people who match up with your ascension. If you are single, one of these could be a potential romantic partner who could fulfill you in ways you never imagined because you are so much more complex than you were before. Even last year you were still stuck in some old ways that weren't really doing you any good - perhaps including the romance in your life. Where your love life was occasionally dull in the past, it will be much more exciting and engaging in 2017. Where you were once too shy or reserved to allow someone to know you fully, your persona now practically radiates - making it easier for someone special to understand you better. And that means that you can find true love more easily because you know what is true for you. If you are attached, your evolving self will either mesh with the one you love or you will outgrow some aspects of your relationship. That doesn't mean your current partner is wrong for you; it just means that you can work together to grow in greater alignment, but that is a choice of course. If you can get on the same page with respect to what you want from this relationship, you will surely grow even closer and you will make a better team in every way.\n \nFamily\n\"Familiarity breeds contempt.\" That line from Aesop's fable entitled \"The Fox and the Lion\" may have had great relevance for you last year, Virgo. You have come to know a certain circle of family members in a way that has shown you their darker aspects in recent years. You have come to dislike these people in some way, but at the same time, you are devoted to your family and you endure the anxiety they tend to produce in you. As 2017 begins, you will have chances to smooth over any rough spots in your relationships, and you will come to see the balance between their vices and their virtues. This is good because it will help you to value the family connections that you have, and to be more tolerant and enduring of the people in your life who drive you crazy at times. Even so, you may have to make concessions and meet certain family members halfway if you are to get along as you want to. Someone you grew closer to last year may surprise you by their astounding growth, for which you can take quite a lot of credit. Your direct help or your leadership by example has helped this person to evolve and grow in many aspects, and that evolution will continue. Another family member - perhaps a sibling or a close cousin - may come to you for guidance in a similar way around March, and this is likely to involve an interest or a hobby of yours that you both share or will share. This should be quite a beneficial union for both you and the other family member, and you are advised to welcome this opportunity with open arms.\n \nCareer\nLucky you, Virgo! No matter how much disappointment or difficulty or trouble you experienced in your business life last year, this year will be immeasurably happy and fulfilling. Last year there was a time when you paid your dues and began to build a foundation for what is to come - even if you didn't realize it at the time. The rough knocks you may have had to deal with last year will be transformed into an experience that is priceless, and that will come in handy in 2017. You can pretty much write your own story where your career is concerned - whether you work for yourself or someone else. You may have played the role of mentor to someone last year, and that relationship will continue in the same form this year. However, this person could surprise you with connections you never would have dreamed of in the year ahead. Some day you may even be involved with this individual in a business venture. In 2017, make sure to play it safe with any opportunities that seem too good to be true, because they probably are. You are headed for success, but it may take longer than you would have liked. The key is to learn as much and enjoy as much of your experiences as possible. In October, some sort of transition or branching out of some kind may come up as a surprise opportunity, but it should fit perfectly into your plans for the future."
  }
}
