{
  "aries": {
    "content": "You are the first sign of the zodiac, Aries, and that could very well be because you deemed it so! That's not true of course, but it is in your makeup to always strive to be first. You have an assertive and sometimes boisterous personality, and you always strive to succeed. Your fiery heart is often reflected in your equally fiery personality. You don't get along with everyone, but then again not everyone gets along with you - if you want to take that perspective. But those who understand your goodness and your depth - those who are worth your while - will always stick around to enjoy your many stellar qualities. You are straightforward, loyal, fearless, and a natural born leader. Your many wonderful qualities draw in those who are strong enough to handle you.\n\nLove\nAh, love. In love, Aries often has a hard time settling in. Your spontaneous, unpredictable nature requires a very confident, go-with-the-flow kind of a mate. When you choose a partner wisely, your life is better, richer, and stable for it. But when you choose someone for the wrong reasons, and you wind up with the wrong kind of person beside you, your love life can be filled with fireworks - and not always of the good kind. You are very opinionated and ultra-competitive, and although you are not usually the one to start an argument, once you become engaged in one, it is no holds barred. When you argue, you are out to win, and that is not conducive to a love life that is particularly quiet. Last year may have been somewhat shaky and volatile where your love life was concerned. You probably fell into a more level state of mind, but you may not have been happy with the state of things, romantically speaking. In 2019, you have the power to turn that around, but it will require some adaption on your part. You are deeply sensitive, but you sometimes hide that part of yourself. This year, if you let your inner light shine more brightly, you will naturally gravitate to compromise, to giving in, and to letting go for the sake of a relationship. If you are attached, that will translate to letting your loved one know that softer, tamer side of yourself, and allowing yourself to be more vulnerable. That will be an excellent way to grow closer and to firm up the foundation of your love. If you are single, you need to open yourself up to allow a new romantic partner to see you, flaws and all, and to let them know what you truly want out of life and out of a relationship. In other words, don't play games. If you play hard to get, you won't get got! You have so many great qualities that a romantic partner can cherish. Allow yourself to shine and let your golden heart lead the way.\n\nFamily\nWhen it comes to family matters, Aries, you are either all in or you want to avoid them altogether. It depends on your mood, on the issue at hand, and on the people involved. There are certain family members you feel especially close to, and then there are others you would like to stay as far away from as possible. That may be true with many people, but with you, it is especially pronounced. Last year, you may have experienced a fractured relationship or two. This year, you can mend whatever rifts began last year, and you can maintain a certain peace. Even if there are particular loved ones with whom you will never see eye to eye, you can create a peaceful existence that will enhance the rest of your family relationships. You are extremely loyal, and that works strongly in your favor where family is concerned. You are centered enough to recognize how very important family bonds are to you, and you will never let any argument go so far that it separates you permanently from anyone who is important to you. Carry on in your relationships with that always in mind, and you will do fine.\n\nCareer\nYours is one of the most ambitious signs of the zodiac. You are driven and determined to make your goals and your dreams come true. You won't exactly plow over someone to make your way to the top, but you can be quite assertive and hard pressing in the pursuit of what you want if you let yourself. This year, there may be an opportunity that places you in a position of competition with someone you know, and that could get a bit hairy where your relationship is concerned. Since you can be very forceful when pursuing your goals, you don't always stop to think about the delicate balance of your relationships that can be influenced by these actions. This year work harder at being more aware and more sensitive to co-workers, team members, and yes - even your competitors. You are in the process of building a stronger relationship in general now, and this will set a new precedent for what you expect of yourself. The more self-control you possess, Aries, the more empowered you will be to pursue any of your dreams with greater vigor and focus. This year could bring some very interesting and lucrative possibilities if you can display a more controlled, focused, even-tempered side of yourself. The sky really is the limit for you this year."
  },
  "taurus": {
    "content": "You have an eye for beauty, mighty Taurus, and this year many beautiful things will make their way to you. This doesn't necessarily mean things like art and other luxuries, but it could. More likely it will be that you can discern the beauty in everything that surrounds you - from people to places to learning experiences and more. You should enter 2019 in a generous mindset focusing on the loveliness that surrounds you and gravitating to the bright and hopeful. By itself, that state of mind will bode well for you, ushering you into an enhanced place of abundance and good fortune. And with the many blessings that should be showered on you by the universe, this will indeed be a year to look forward to. In addition to your gravitational pull to all things beautiful, you are also dependable, generous, patient, independent, and surprisingly down-to-earth considering your love of beauty and luxury. All of these traits will benefit you this year.\n\nLove\nAlthough your love of beauty may draw you to a person romantically, it is not what will keep you there. While you can appreciate a lovely outward appearance, you are even more drawn to a person's soul and good qualities. Your love life last year may not have been terrible, Taurus, but it may not have lived up to the stellar expectations you had in mind. This year, you can have that grand dream you have been nurturing, but it will require working through certain problems and understanding yourself better. You need to understand patterns you have in relationships and start working on those things that have caused you problems repeatedly. If you do that, you can improve both yourself and your love life at the same time. If you are single, you may choose to play the field early in the year, and perhaps through to the middle of the year. At that point, there's a good chance someone will appear who really captures your attention and your imagination. Or it could be that someone you already met will show new facets of themselves that will fascinate you. If you pursue this, take it slow. If you aren't sure, you may want to continue to play the field. Don't rush into anything. Take it slow and steady. If you are attached, there may be some hurdles to deal with, but you are capable of navigating over them if you are open and honest with your significant other. Instead of walking away from troubles as you encounter them, sit down and have a heart-to-heart until you are both happy or at least accepting of the outcome. You can build a very strong base in your love life this year if you care enough to do so.\n\nFamily\nFor a long time now, Taurus, you may have felt estranged from some of your family members - particularly one or two who are very important to you. In fact, you may have often felt left out over the years, and this year - at the beginning of the year at first - this may seem especially poignant. But don't be sad. It would help if you could express what you feel, and if there is a problem between you and someone else, work through it. Then again, it might just be that your interpretation is not accurate. People with busy lives often get sidetracked and distracted, and they don't intend to leave anyone out. That is more likely the case with you. An important family get-together this year could show you, in a grand way, that you really are loved and appreciated. Cling to that feeling when you start to doubt someone's love for you. You are loved. A family matter that may be connected to business or to money may come up later in the year. Be patient, as fears and anger could escalate if there are misunderstandings. A family member may confide in you this year on a matter that surprises you. This person may just need to vent, or they may see you as someone with the experience and wisdom to give excellent advice. Don't be afraid to say what you think. It will be important that everyone who is involved is honest, open, and forgiving. With forgiveness, this year can take you to another level of closeness to family and to everyone in your life.\n\nCareer\nYou should be feeling far more confident with your career aspirations this year, Taurus. Last year, although the pace may have been slower, you made a good name for yourself and contributed to your stellar reputation. You are known for being responsible, reliable, and hard-working. You can also be quite ambitious. This year, the pace may pick up a bit with more projects and more opportunities. Around the first third of the year, you may either decide to change workplaces, your responsibilities or even change careers altogether. The stars favor any move like this that you want to make this year, and you should find that things will fall into place as you need them. Later in the year, the pace may pick up even more, to the point where you may even request assistance. You will have the chance to impress people who could be instrumental in furthering your career. If you have considered starting a business of your own, as perhaps you have in the past, just be sure that your knowledge about any prospects is accurate and thorough, or you could wind up in a predicament. If you are cautious, you can handle anything that comes your way."
  },
  "gemini": {
    "content": "You are a mysterious person, dear Gemini, even to the people who know and love you best. This is not intentional. You were born with a dual nature, often going in opposite directions at the same time. It can be hard to keep up with you - both physically and intellectually. You are brilliant, lively, and unpredictable. You are the one everyone wants to invite to their party because you are so interesting and entertaining. You can run hot and cold at the same time. And you can love someone deeply, and yet be very harsh and critical. In many ways, you are a study in contradictions. You are very insightful, and you can pick up a lot about someone just by watching them. This year, these traits could help you to achieve new heights and add to the depth of the mysterious air that surrounds you. But there will certainly be some interesting people who will want to take the time to get closer to you and figure you out.\n\nLove\nAhh, Gemini, your love life is sometimes the stuff of soap operas. You can love deeply, and you might swear that you can be faithful and deeply romantic; but you can turn on a dime, so your lovers often don't know what to make of you. You are hard to figure out, and to some that's intriguing, but to others, it's a sign to stay away. Because you are such a contradiction, you are often attracted to those who don't love you back, but that is changing. This year, you may be more aware of this tendency, and you may be seeking out qualities in a potential lover that will stabilize you and offer you a beautiful romantic storyline. You are gravitating toward harmony and away from instability. You are more intrigued this year by honesty and depth. You are surer of what you need now. You are growing in many ways now - spiritually, ethically, and in your interest in the world around you. As a romantic partner, you may have more of a craving this year for harmony than for excitement. These realizations will be very good for your love life in 2019. While your love life may have gone off the rails at times in 2018, this year it will bring you more of what you really need. If you have a significant other, dear Gemini, the energy of this year will be excellent for both of you. You should have many opportunities to grow closer and to enjoy a richer, deeper connection. You may have many opportunities to get off by yourselves this year. And even a trip to a historic site or a museum can be romantic and interesting, so say yes to as many of those bonding times as possible. If you are single, you will have a year when you can choose someone more for the qualities and the character they possess, rather than for the excitement they can bring. Because of this, you draw in and meet people who will actually be good for you, bringing out your better qualities and making your life more even-keeled and steady. And believe it or not, Gemini, this new way will actually be exciting for you. There can be great joy and excitement in a harmonious love life.\n \nFamily\nYour fickle nature often means that your emotions and behavior run hot and cold in general, and especially so with family. After all, no one knows you better, and you can feel more at ease in how you relate. Unfortunately, that can also mean that you aren't as careful about sparing someone's feelings or speaking your mind aggressively - even when you know it could start an argument. The year may begin with a series of conflicts between you and one or more of your family members. This may stem from differences in your beliefs in values, but it could easily escalate into a conflict of personalities that will be harder to resolve. Keep any such discussions in check, though, and you should be fine. Try to be more nurturing of those you love this year, and you will be surprised by the grand way you are received. Since this may be unexpected of you, others will have a greater appreciation for your kindness and thoughtfulness, Gemini. And when you experience that kind of a reaction, it can help you to evolve further to become even more naturally nurturing. An important development within your family toward the middle of the year may be quite exciting and could change the dynamic for the better in some of your most important family relationships. This news could also affect you financially in some positive way.\n \nCareer\nYour mercurial nature sometimes causes you troubles at work. You are independent and that means you do not like deferring to someone who can dictate what you do or who breathes over your shoulder. For those reasons, you are someone who would do well running your own business and being your own boss. Then again, with the right dynamic, Gemini, you can be a great team player. You do aim to please, and you do appreciate being acknowledged and recognized for your efforts; and in the right environment, you really can thrive when you work for another person or a large company. This year, you may find that chances come to you throughout the year for a wide variety of work roles, and you may appreciate each chance to learn something new. It would be good for you to explore any new opportunities that can teach you something you didn't know, which can broaden your reach and give you greater potential in your career. If you do choose to go into business for yourself, this can be a tricky but successful year as long as you remain focused and driven to succeed. If you let anything slip, you might have a harder time than usual catching up. But the more momentum you build, the more you will get an intoxicating taste for success. Your work this year could involve some travel, even if it is just frequent travel to locations nearby. You may also expand on what you do or come up with new ideas that your bosses or clients are quite thrilled about. Overall this can be a year of great growth in your career."
  },
  "cancer": {
    "content": "You may have wondered often throughout 2018 why those things that were most important to you were not working out as you had envisioned. You may have pondered if your expectations were too high, if you weren't being realistic in your pursuits, or even if you simply were not meant to have those special things in your life. But in 2019, when you least expect it, dear Cancer, life will begin to turn around for you. If you are reading this forecast early in the year, you may be very skeptical of this message. Right now, it seems too much to believe that some of your dreams actually could come true, but you will see that many wonderful things are possible for you in 2019. Your home-loving nature will be significantly settled and happily tucked in to a place you have envisioned for your life at some point this year. That means that the home life you have dreamt of is now within reach. Your tenacity, fiery determination, passion, and hard work will bring that dream to you in 2019, and it will feel just as you imagined it would. You are soft and sentimental, creative and imaginative, and you are a spiritual searcher. All of these characteristics will be further enhanced this year, and your involvement in exploring these aspects of yourself will lead you to paths you had never dreamed of. Don't be afraid to transcend beyond former boundaries or get to know people that you might not ordinarily want to know. While the year may comprise a lot of mystery for you, that sense of mystery will keep you learning, growing, and evolving.\n\nLove\nMany people of your sign experienced a love life that was less than satisfying last year. You may have thought it was going in the right direction, only to awaken to realizations that things were not as they seemed. Romance and loyalty are incredibly important to you, and if you don't have that in your mate - the one who should be closest to you and should have your back - you are not a happy person. And if you discover that someone you love is not someone you can trust, you are not afraid to walk away and either look for someone new or find a way to be happy alone. Although you may have developed a skeptical, cynical attitude about love in recent months or even years, events of this year may be able to change your outlook and give you hope again for the fairy tale you dream of. If you are attached, this will mean a chance to see your lover in a new way, plumbing the depths of the experiences you have shared, and recognizing that this person really does believe in you. Your best bet will be to maintain a list of reasons you love this individual and turn to those notes each time you experience a setback. Reminding yourself of the reasons you fell in love in the first place will be instrumental in keeping your union strong and flourishing. If you are single, your love life should begin to thrive early in the year. Even if you had a lengthy dry spell where your love life was concerned last year, this year you should experience restoration of your faith in love and enjoyment that relationships can bring. If you had a disappointing relationship last year, it may have put you off even bothering to look for love, but someone may come along this year who will make you rethink all of that cynicism and questioning. If you do find this person, don't hesitate to commit and to work at making it the best romance ever.\n\nFamily\nYour sign represents the epitome of family. You are anchored by your parental instinct. Even if you don't have children, you are someone that other people turn to for guidance and nurturing. You may play a parental role in many areas of your life - including with your own family. You may even be able to take on a guiding role with your own parents in certain ways! You are wise and encouraging; you are gentle and generous, and you are unfailingly reliable and loyal. These are traits everyone has - or wishes they had - in their parents. Despite all of your amazing qualities, though, you may have had more than your fair share of family drama in the last year, Cancer. There may be one long-standing grudge (or simply a lack of affection) between you and one critical family member. You may think this simply can't change, but it can. This year, events that occur could push you closer to this person, and at first, you may wonder why, but the purpose will become clear. Stay upbeat and hopeful, and you could gain a new ally in this family member. There could also be some huge transition connected to your family this year. Someone you are quite close to may choose to move far away or fall out of your life in another way or simply change something that you have gotten used to in a dramatic way. But there is nothing stopping you from joining them if you choose. While the first half of the year may be filled with small troubles connected to family, the second half will be unifying, and for someone as family oriented as you are, this will be a very welcome thing.\n\nCareer\nYour career may have been a source of uncertainty, instability, and diminished confidence over the last year or perhaps even longer. Although you are a loyal hard worker, someone in a position of power either did not recognize your talents and dedication, or they had a high level of jealousy for you. This person may have blocked good things from happening in your career, but that experience can no longer affect you. This year, Cancer, your career is on the upswing and on many levels. If you work for someone else, your unique abilities are sure to be broadly recognized, and the opportunity to grow and to influence the success of those you work for will be ever-present. You may see a dramatic increase in your income or at least the prospect of that in the near future. If you work for yourself, you may make connections this year that will catapult you to a steeper level of success. You could make friends with people in higher places this year, and these connections could be just what you need to help you reach another echelon of success. You may even be able to mentor or guide someone who puts you on a pedestal. If you have a creative goal of your own, this could be the year you get your big break. And if you do, it could be extraordinarily big."
  },
  "leo": {
    "content": "There is an air of loyalty about you, mighty Leo. There always has been, and there always will be. You are the king or the queen of your world, and you have a gift for seeing what is beautiful in everything. You love to be loved and admired, and you are never more at home than when you are in the spotlight. Other people notice this about you right away, and they gravitate to your magnetic presence. You are straightforward, and you can quickly recognize a person's vices and virtues. Even so, you are warm and kind-hearted to everyone, no matter their weaknesses or problems. You can find something interesting about anyone. You are energetic and optimistic, generous to a fault, and unfailingly loyal. And while you have many, many virtuous traits, Leo, you also have a few characteristics that can hold you back if you aren't careful. You can be impatient, harsh, and critical - but usually, this is because you care so much about those you criticize, and you only want the best for them. You can be possessive and arrogant at times, but that's because your heart is so big and your passion is so boundless. In 2019, there will be a focus on possibilities that will help you soften some of your harder qualities and expand on some of your greatest virtues. These will come through seemingly random chances that you should, however, be able to recognize as golden opportunities.\n\nLove\nYour lust for a happy love life is as big as your lust for life itself. You are a romantic at heart, Leo, and you would do almost anything for the object of your affection. You are the kind of person who will sweep someone off their feet in a dramatic way, and your entire relationship will be marked by memorable moments of romance. But it isn't always hearts and flowers with you. At times your roaring temper gets in the way, and you can easily alienate those you love the most. Your passion is so intense at times, that you get carried away and say or do something in the heat of the moment that can lead to conflict or hurt feelings. This year, you will have the chance to focus more on harmony than on being \"right,\" and on expressing yourself rather than allowing dark feelings to fester. If you soften your approach to love, and you can still maintain the deep passion you feel, you will be the ideal mate. If you are a single lion, you should have your pick of mates in your kingdom this year. There may be many interesting love interests to choose from, but you are only looking for one. Look from the heart rather than with your eyes, and you could meet someone incredibly, extraordinarily special this year. And if you do, it could also lead to a very quick commitment. If you are attached, this year you could learn a lot more about your mate. These could be things you hadn't taken notice of before, but when you do, it could awaken a new level of passion in your romance. You may even experience such a rich level of love between you and your mate this year that it might be greater than anything you have experienced in all of your time together.\n\nFamily\nYou are most likely the leader of the pack when it comes to family. You are the star others gravitate to and the one everyone turns to for advice and guidance. Your approval is often sought in big decisions, and your counsel is also sought when someone makes a mistake or needs solace. This can sometimes be a heavy role to play, and it often brings a great burden to your shoulders. You are certainly capable of handling it, Leo, but it's nice now and then to see things go smoothly and happily without your intervention. This year, you should have more peaceful moments than you have had in quite some time, as your influence has led to greater harmony in your family life. Others look up to you, and you have led by example. You may play a big role in helping out an ailing family member this year. This may be someone who is experiencing hard times in some way, and you will be instrumental in inspiring, motivating, and encouraging this person to rise above their problems and excel and thrive. You may also finally receive the expressions of gratitude and recognition that means so much to you but has been lacking in recent years.\n\nCareer\nYou are a dynamo at work, Leo. You are driven to succeed, and even when you aren't motivated solely by money, you are intensely interested in what you do. You like to know what makes things tick, and you are good at understanding what you do from the foundation up. This makes you a very valuable worker, and your intensity is appreciated for anyone lucky enough to work with you. There could be numerous opportunities this year to grow in your role at work because you have been noticed frequently over the last year. If you wish to move ahead, you will be able to. If you hope to make your money, that should also be possible. If you want to change careers, open a business, or even turn to a creative outlet as a career, you should be able to accomplish that. In other words, you can write your own story this way, Leo. So, make it a good one. Use your insight to figure out what you really want, because it is likely that anything you begin this year with will be with you for quite some time. That's good news if you make good choices because it means a path ahead filled with wonderful adventures and lucrative rewards."
  },
  "virgo": {
    "content": "Your analytical, precise way of doing things often hides your sweet, kind nature. When people meet you, they don't always see how incredibly strong and generous you can be. Although you may appear straight-laced, prudish, and extremely discriminating, you can be deeply passionate, affectionate, and giving when you reach the point of truly caring about someone. You are highly self-motivated, and you play strictly by the rules. This sometimes rubs people the wrong way, but it helps you differentiate between those you can and can't trust. And that, by the way, is something you are exceptionally good at. You can unmistakably detect a trustworthy person pretty much every time, and you can immediately recognize someone who may be underhanded or have ulterior motives. This gives you an edge in business and in personal relationships. Even when someone tries to impress you or get in good with you through demonstrative acts of courteousness or gallantry, you can see right through it. This is a valuable gift to have. Sometimes your deep need to study and evaluate everything before you get involved causes you to miss out on opportunities. You aren't usually satisfied until you have weighed and measured every aspect of an opportunity. This year, that trait may be softened through experience, still leaving the valuable ability to see through a façade as the main gift you use to further your life and your career.\n\nLove\nIn love, dear Virgo, you are not often the one who makes the first move. Even when you find someone especially appealing, you will hesitate and worry and wonder, not feeling secure enough to make your approach. That means that you sometimes miss out on meeting the people you find appealing. Someone who is interested in you will have to be fairly obvious in their affection for you, or you may not feel sure enough to come closer. Those who impress you most are usually very practical and predictable and can demonstrate their proficiency in something that interests you. You are not usually attracted to people who are unconventional or impulsive, and you sometimes can miss out on some really intriguing people because of this. If you are single, this year someone who does fit that description may compel you to come closer in order to get to know them. This might open a door to a whole new world for you, Virgo, and although you may feel shy about it at first, getting to know this person could be immensely rewarding. This person may want to move more quickly in the relationship than you are capable of, but if you continue to validate your attraction for them and your desire to learn and grow together, this could work. If you are attached, your partner may express the desire for a bit more excitement in your love life. You are most comfortable falling into a predictable pattern, but there are certainly ways you can spice up your romantic life without going over the edge. Work at it to create a more rewarding, more exciting connection. \n\nFamily\nYou are the straight thinker and the problem solver of your family group, Virgo. You are the one someone turns to when there is a complex matter that no one else can make sense of. You have a way of distilling the facts down to a reasonable conclusion, making a complicated problem seem easily resolvable. You rarely express how you are feeling, which can cause a sense of distance between you and your family members. This year, someone's deeply emotional experience may bring you out of your shell and force you to deal with your own internal combustion. On the outside, you are calm and even; but on the inside, your emotions are often roiling. This experience could allow you to tap into your inner world in a way that will awaken more of your emotions, leading you to greater well-being. You can sometimes be a bit controlling when you feel a family member is not doing something in the right way or is on a path that you don't think will end well. This tendency may create strife between you and a younger family member this year, but if you can express some of your concern in a more emotional way, you may cause this person to see the logic and strength in your guidance.\n\nCareer\nVirgo people are very intelligent and very intense when it comes to their work. You have a keen intellect and an excellent memory. When faced with a business problem, you have the ability to pull it apart like a puzzle, analyze all of the pieces, and put it back together for a more perfect fit. Your rational way of thinking helps you to deal with problems at work that sometimes puts co-workers at odds with each other. Your knack for getting people on the same page makes you an excellent manager. This year, your gifts at leadership will not go unnoticed. If you work for someone other than yourself, people with influence will notice your gifts, and they may turn to you for brainstorming and leadership. You may be involved in expanding a business or in making choices that could influence the success of the company. If you work for yourself, your reputation may draw in new business that could be quite rewarding this year. You may even branch out into something related to your main work, but with differences that are quite unique and interesting. New contracts or the expansion into a new industry could mean new streams of revenue for you this year as well. Overall, you could gain momentum very quickly reaching heights you have only imagined."
  },
  "libra": {
    "content": "The scales of justice are the symbol of your sign because you represent fairness and balance. You are an honorable person who fights for what is right. And since your ruling planet is Venus, the planet of beauty and love, you have a visually appealing quality that can be somewhat intoxicating. You are also a true romantic. You are a great mediator in every area of life - from settling disputes between friends or family members to negotiating agreements among groups of people at work or in your neighborhood. You are often very focused on your appearance and at times you might be considered vain, but it is your love of beauty that makes you fashionable and always eager to look your best. You are tactful, refined, and responsible, and you put a lot of energy into helping others. Last year, it may have seemed that you were not recognized the way you should have been for your many wonderful qualities, especially by those you did the most for. This year the tone should change to one where your exceptional talents and characteristics will be better appreciated and rewarded. And not only will you be able to revel in all the adoration, Libra, there could also be quite substantial benefits to all that recognition. Your star is shining brightly this year. You should have more opportunities than usual. It will be up to you to make the most of those chances, of course, but you are at your best now so that should not present any problems. Love and luck are on your side, and things will be going your way. The year ahead promises to be interesting, rich in experience and in relationships, and very satisfying on many levels.\n\nLove\nMuch of your life is focused on love and on relationships, Libra. You are definitely a lover, not a fighter, but last year you may have had your fair share of battles when it came to love and romance. That may have been because you were struggling with some personal issues that left you feeling a bit out of sorts, which translated to a rocky road through love. This year, you are back on track and have found the balance you are so well known for. There is a light emanating from you this year, so whether you are single or attached, your love life should be filled with romantic moments and memorable times. Even when you have faced difficult times in your past, you have always been a fair and sensitive romantic partner. That means that even those relationships that have not worked out, have been generally amicable even when they ended - or at least you tried to end them amicably. Those qualities that make you stand out as a good partner could attract \"the one\" this year if you are single and looking. All that is good about you and all your best qualities are enhanced and glaringly obvious this year, so if you are out and about you are likely to run into someone who gets and appreciates you. If you are attached, your partner will find you even more alluring than usual, and your love life could heat up considerably this year as you share deep thoughts and grow closer. This would be a good year to deepen your romantic connection or start a new one. Overall, 2019 should be a good year for love for you, Libra.\n\nFamily\nYou are often seen as the family mediator, Libra, and that talent you have for bringing others onto the same page may get a real workout this year. It isn't that your family members are at war with each other, but you may find yourself in the center of several issues that come up this year. The good news is that you will be able to bring everyone together in a peaceful, loving way, and best of all, you will help them find real understanding. You should also gain a deep sense of accomplishment and a feel-good vibration that lasts for a good, long time. There may be ups and downs in your family life this year from the beginning to the end. Even though nothing may turn out to be all that dramatic in the end, it could be quite a ride as you navigate from one surprise to the next, but it should be interesting. There may be a family member this year who will seek you out for guidance on a business or career-related matter. You may be hesitant to help because you will not want to be responsible for things if they don't work out, but ultimately you could do this person a lot of good. In fact, you might even find your calling on some level as you counsel this person on their best options. A younger family member may also turn to you this year in search of moral support and encouragement in some endeavor that no one but you will understand.\n\nCareer\nYour incredible charm will play a huge role in the opportunities that come your way in 2019, dear Libra. When coupled with your natural likeability and your innate trustworthy countenance, you should have your choice of options in your career this year. And if you have been thinking about starting your own business, this year would be a great time to do it or at least make the first step. It may seem that just as you think of something you want or need to further your career or business goals, that resource will arrive in an unexpected and unusual way. It's as if the stars are conspiring to help you succeed. Last year, since your hard work and creative efforts were not as recognized as they should have been, you did not soar in the way you should have. But this year you are going to be in the spotlight, and your most dazzling features and talents will become incredibly obvious. Those who are seeking out your talents will know you are the one who can change everything for the better, and you should be in big demand. You may find that many of the best chances seem to come out of the blue and at the last minute when you have little time to prepare or figure out a strategy. But you are often at your best when you are challenged or under pressure in this way, therefore you will shine brightly. Don't worry about your performance; just concentrate on enjoying your efforts and the way you present yourself, and you will be extremely impressive."
  },
  "scorpio": {
    "content": "Sexy, sassy Scorpio, you will strut into 2019 with style, finesse, and incredible charm, and your grand entrance will set the tone for the entire year. You are traditionally a person of few words, conveying your emotions more through body language and countenance than through what you have to say. This year, though, you may become a bit more talkative, coming out of your secret shell to reveal just a little bit more about yourself than you usually would. This could open you up to new friendships, closer relationships, and a greater number of opportunities. You pride yourself on being knowledgeable and accomplished in the goals and interests you choose to pursue, but when you come upon something you don't know, you tend to remain silent about it rather than reaching out to learn. But staying silent won't expand your knowledge as much as asking questions could. This year, you will need to get over that feeling of vulnerability that comes with hiding aspects of yourself. Doing so will enhance your connection to the world. This year, your innate sexiness combined with your enhanced level of vulnerability will make you even more magnetic and charismatic than usual. Those who felt they could not get close to you, will be more inclined to try this year, which will in many ways make your life richer.\n\nLove\nIn love this year, Scorpio, it seems to be an all or nothing proposition, but the choices will be yours. The way you navigate through those choices in your love life will determine the way things go for you in 2019. Because there is a heightened emotional aspect to the year, you could easily become involved in conflicts and arguments. Although these can actually help you work things out if you fight fairly, stay reasonable, and in control, the opposite is also true if you don't fight fairly and/or lose control. Do your best to listen at least as much as you speak, and be open and compassionate, sending out loving vibrations no matter how agitated or angry you get. This really will make a difference. For single Scorpio people, this year may offer you a chance at love in the late spring or early summer. This may start out as a chemical attraction - as so many Scorpio relationships do - but it could quickly evolve into something very special. If you are already involved in a committed relationship, it could heat up significantly this year, even if it is already extremely passionate. Because of the propensity for disagreements, there could be many chances to kiss and make up if you handle those interactions carefully and thoughtfully. Scorpio people could experience an expansion in their family this year too - either through the birth of a child or a marriage where families are combined to form one larger but happy family.\n\nFamily\nAs noted above, Scorpio people have the ability to grow closer to the people they love this year, and of course, this relates to family members as well. And no matter how old you are, and no matter how often you spend time with your relatives, you could actually begin to learn more about them this year and develop much closer connections. An old estrangement may even become easier to approach and deal with, and even though it might not happen all at once, there could be a slow reconciliation between you and someone you are separated from. This will make the entire tone of family relations even better. A legal or contractual matter that is somehow connected to the family could be a touchy subject, but you have the potential to handle it with grace. Just try to see things from the other side's point of view, and consider what will be best for the greater good. There could also be an instance where a family member may have to come live with you because of some need or unfortunate event. This could work out better than expected if you are supporting and remain patient and considerate.\n\nCareer\nThere could be a lot of change and drama in your work life this year, Scorpio, but it's all good. Even if it seems stressful or frustrating in the moment, the way you react and the choices you make could be instrumental in furthering your career quite considerably. This is a year to expand your horizons on the work front and to explore new roles and possibilities at work. If you strive to bring in new business or expand what exists, you will be looked on very favorably by partners or by those in charge. The harder you work, obviously, the further you will get. But you also need to work smart, not just hard. And if you successfully maintain your admirable work ethic, the year should go very well for you career-wise. There could be lucrative rewards to this too. If you improve your finances through your work efforts, you might want to choose to also work at whittling down any debt you may have, and if you can go beyond that, you might want to think about making some shrewd investments that could pad your bank account and ensure a more secure future. You are always someone who gives it your best effort, and this year you will have more time in the spotlight than ever. Your work will be noticed and rewarded, so put your best foot forward and walk steadily through 2019."
  },
  "sagittarius": {
    "content": "There is nothing dull or boring about you, dear Sagittarius. You enjoy life in the fast lane - whatever that means to you personally - and you have the energy and the love of life to make your dreams come true. This year, your life can be as exciting and as fast-paced as you'd want it to be. This will be a great year for pursuing those dreams and ensuring you have no regrets. Many paths will be open to you, and your adventurous spirit might compel you to travel down a few that are rather unorthodox in 2019. You should be feeling bold and brave and ready to try things you didn't have confidence for in years past. You are fun-loving and very sociable, and this year you may have quite a number of reasons to have a party or to celebrate moments of happiness in your own unique way. In the past, you were often held back by indecision and impatience, but you have overcome some of the reasons for that recently. Part of your reason for being impatient in the past was that you have little tolerance for boredom or the dull moments in life, but you have managed to rein in yourself in that respect and you are now more \"mature\" and wiser in your approach to your goals. This will benefit you enormously this year. This could be a very lucky year for people born under the sign of the Archer, so stay aware of the opportunities that are coming your way and choose the targets for your arrows wisely.\n\nLove\nYour social life should be especially enjoyable this year, Sagittarius, and many of those memorable moments could form a lovely backdrop to your love life. For single people of your sign, your social life may be the source of meeting someone very special this year. But before you do, you may meet a range of interesting characters. When you meet a unique individual who draws you in as no one has in the past, you will know instantly that this is someone you really want to get to know. If you already have a significant other, your social life will offer a variety of bonding experiences that will bring you two closer together in a very fun-loving way. You may have some rough spots where your love life is concerned around the middle of the year. There could be a disagreement about your home life - from where you live to what you want to do with your living space. There could also be some conflict over money or over some material luxury purchase that you can't agree on. But these are small things that will be easy to overcome if you don't take yourself too seriously and if you try to be as flexible and loving as possible throughout any disagreement. Once you rise above these and other minor skirmishes, you should enjoy a very sweet and poignant romantic life throughout the balance of 2019.\n\nFamily\nYou have a very strong and assertive personality, Sagittarius. Naturally, when there are family members you clash with, those encounters can be fraught with drama and heartache. There may be someone in your family that you find especially difficult to get along with. Last year there may have been moments of improvement within this relationship, and you may have briefly held hope that it could get better - but that may not have happened. This year you will have a chance at a do-over, and you would be wise to take it too. There may be awkward moments, and there may be times when you just want to give up on this forever, but if you dig in and really try to embrace this person - despite your many differences - the relationship will offer you a future filled with love and joy. That's much better than feeling alienated and alone. There are happy family events on the horizon like an engagement or marriage or a birth event that can be especially joyful for you in 2019. You may even have some involvement in the planning of the event, contributing your talents to the festivities in some way.\n\nCareer\nYour outstanding social skills will carve out a lucrative path for you in your career and finances this year, Sagittarius. You are quite the \"people person\" when you want to be, and your charm and likeability with the right people will open doors and pave the way for great success. You are the author of your story here, and you can accomplish whatever you want. You may meet someone in a social capacity who could have coveted connections for you. You may also find yourself in the role of contributing to business-connected social events. You may also find yourself on the receiving end of some wonderfully fortunate tips and advice for enhancing your finances. There could be either a beneficial job change or a promotion at some point this year - more likely in the second half of the year. This could be something very different from what you have done in the past, but it will be quite interesting and very appealing to you to the point where it feels more like play than work. There would be a learning curve, of course, but you will sail through it easily. For those of you who are contemplating your own business, this is a great year to strike out on your own. Throughout the year, your momentum will build, and this could be a great time to increase your financial security and your standing within the world of your career."
  },
  "capricorn": {
    "content": "You are a go-getter, Capricorn. That's for sure. Ambition is a hallmark of your sign, and like the goat that is the symbol of your sign, you are able to scale challenges easily and overcome obstacles quickly as you pursue success. You have an agile mind and a tireless spirit, which enhances your ability to win at any challenge you take on. This year, there could be many exciting possibilities that will not only challenge your intellect but will also intrigue you in other ways as well. When you want something, nothing stops you. Even when you don't have the resources or the connections that would usually stop other people in their tracks, you keep going - making difficult endeavors seem easy. Although you are kind and quite generous, you are also materialistic. This year, you may set your goals very high with the main purpose of acquiring a more luxurious lifestyle, and you can certainly succeed at this if you maintain your usual work ethic. Good luck will also play a role in your good fortune. Even when you experience a failure you are able to move forward with great dedication. Don't let failure erode your self-confidence, and don't allow disappointments to depress you or slow you down. Your self-assurance inspires confidence in others, and you are often a great source of inspiration for the people who look up to you - and there are more than you think.\n\nLove\nAlthough you sometimes have a tendency to appear detached, aloof, and uninterested, your passion runs deep, Capricorn. It may take a little while for you to trust a romantic partner, but once you do, you are loyal, loving, and affectionate. You make a great romantic partner because you are dedicated, trustworthy, and dependable. A romantic partner can usually rest assured that a life with a Capricorn will be peaceful and fulfilling. This year, your love life should be quite stable and enjoyable. You thrive best in a loving home, and you make that a priority. This instills trust and harmony between you and your mate, and that, of course, leads to a satisfying romantic life. If you are single, you may have a hard time finding someone early in the year who reflects the values that are so important to you. Although you could meet someone quite interesting and charming in the first half of the year, your initial impression may be based on appearances rather than values. Discovering that you are not on the same page in that way may be a disappointment, but you'll recover from it quickly. You should soon after meet someone who does seem to be the epitome of what you are looking for in a mate. If, however, you are already attached, this should be an especially rich and rewarding year for you. The investment you have made in your partnership will bring good times, a strong communion and camaraderie, and really all of the rewards that a good relationship can bring to your life. You should consider taking a long trip this year and just relax with your significant other in a way that you find most soothing and enjoyable. You don't have to go to museums if all you want to do is lie at the beach and vice versa.\n\nFamily\nYou are devoted to your family, Capricorn. Your family comes first in every way. Likewise, you have lifelong friends who over time may become like family members to you, and you treat them with loyalty and devotion as well. Even though your complete devotion to your friends and family is deep, you don't always show how much you care with demonstrations of your love in other ways. But when someone needs you, you come through immediately. This year, you may have to support and encourage a family member who is at odds with something you believe in or who you disagree with on an important matter. This person may need you as they work through a complicated situation, and if you can set aside your differences, you can be extremely helpful to this person. Later in the year, a family member may express interest in doing something with you as a partnership in business or finance. Even though you may recognize how much this person needs a helping hand, and you may be able to see how a partnership could help out, this might not be the wisest thing to do. Your innate ambition may clash quite hard with your dedication to your family. Getting involved in this way could create a serious conflict. Instead, try to find other ways to help this person up and out of their predicament if you find yourself in such a situation.\n\nCareer\nYou come off as quite knowledgeable, capable and driven, which validates the trust others have in you. And your keen sense of humor is always great for lightening difficult situations and making yourself more endearing to decision makers and powerful people. Even when someone first meets you, you give a trustworthy impression. There is just something so reliable and solid about you. This is all great for business. You are a realist, but you are also a dreamer. So, when you come up with a goal - no matter how lofty - it is usually grounded in realistic hopes and expectations. If you work for someone else, you want to be recognized for the great job you do, and you want your efforts to be rewarded through monetary means. This year, you may feel that a superior is not giving you the attention or the credit you deserve, which could prompt you to go over their head to make the situation known. Although this might seem like a very practical approach to you, beware because it could backfire. Instead, consider doing what you do best, and you will ultimately be noticed by someone in authority. If you are in business for yourself, you may need to cultivate closer social connections and be more amiable in your dealings, even though that may seem counterintuitive to you."
  },
  "aquarius": {
    "content": "You may be one of the most eccentric signs of the zodiac, dear Aquarius. And because you are also so independent, not a lot of people are able to get to know you fully. This may lead to talk that you are offbeat or unusual, even though you are quite a logical and practical person. Sometimes your aloof demeanor puts people off, but you may just seem distracted so frequently because you are so gifted intellectually. Your mind is very curious, and your wheels are always turning. You are a study in contrasts, Aquarius. You like to have a strong plan and know where you are going in life at all times, but you can also be quite spontaneous and you love surprises. You are a hard one to figure out for a lot of people, which often keeps certain people at arm's length. But for those who get to know you, you can be a delightful companion. Your brilliant mind is intriguing, and your values and morals are stellar. Still, you often feel misunderstood, and in all truth, you often are. But it should not matter to you what \"most\" people think. You need to cultivate and pour your energy only into those who are the most meaningful to you. In 2019, you will find that your relationships grow closer, your dreams crystallize, and the path to making them true becomes more obvious. You like to move quickly once you make up your mind about where you want to go and what you want to do, so don't despair if the year gets off to a slow start. The pace will pick up rapidly.\n\nLove\nLove is often a tricky area of your life, Aquarius. Although you long for companionship with someone who truly understands you, it can be difficult to find the perfect mate. You have a deep desire to find someone who is your intellectual equal and who gets your eccentric ways, yet your aloof style and sometimes distant demeanor make it difficult to form close bonds. You have very high standards too, and if one small thing turns you off, you are not likely to take the time to further explore and get to know someone new. For those born under your sign who are single, this year might present a challenge in terms of finding what you want in a mate. You may be extra-introspective at the beginning of the year, even though you may have a powerful goal to find that someone special. You will have to come out of your shell and allow yourself to be more vulnerable if you really want to be in a relationship. If you are attached, you will need to work extra hard at developing intimacy with your romantic partner. That may mean revealing a deeper part of yourself that you sometimes keep hidden. Showing richer glimpses of yourself will make you more endearing and will deepen your connection with your significant other.\n\nFamily\nAlthough you may not be the most demonstrative member of the family, and although you may not verbally tout your love for your family members, you are very devoted to your family. When someone needs you, Aquarius, you are there for them - whether it's to help out with something, to offer advice, or simply to be a shoulder to cry on. However, because you can be distant at times, and you don't always keep your loved ones up to your activities and changes in your life, there can be misunderstandings and conflicts. If you make a point of staying connected, though, these kinds of disagreements can be avoided. But despite any recent conflicts, you can expect very positive relations with your family in 2019. There should be harmony, tranquility, and peaceful interactions. There should also be a lot of family related social activities this year as well. This will bring you closer and should enhance the existing bonds, making them deeper and stronger. This year, you may make a connection through a family member that could turn out to be extremely rewarding and enjoyable on both personal and professional level. You may also be inspired by a family member to make a major change in your life that could take you off toward exciting new horizons.\n\nCareer\nThere is great potential for Aquarius people to have a very stable, rewarding year where career, business, and finances are concerned. This is due in no small part to your dedication to your goals in the past and to your painstaking approach to building a stellar reputation. Because you are a visionary, there are many who look up to you and turn to you for inspiration. If you have the chance of being a mentor to someone this year, take it. It will be a mutually beneficial relationship where you both will have the chance to learn and grow. You may build momentum quickly this year, and there may be a temptation to spend big as well; but that should be avoided - at least until you know for sure you can definitely afford this at the moment. Once your finances stabilize, you can always get back to this. You may find that you will need funds for something important, and you want to be able to count on your financial security. This will not be anything that could seriously drag you down, but if you are careful, you will have added peace of mind, which will certainly enhance your ventures. Investments are favored this year, as long as you do the proper research and you don't leave any stone unturned in seeking information so that you know what you are getting into. This is the way to avoid surprises and to feel secure about planning and strategizing. Overall, this should be a very auspicious year that will solidify your good reputation and underscore your skills and talents."
  },
  "pisces": {
    "content": "You are a highly emotional, sincerely sweet, extraordinarily creative individual, Pisces. Your intuition leads you through life, and your heart is always in the right place. You have a loving outlook on the world in general, which makes you very appealing and engaging. Because your kindness is so obvious, you often draw in people who are desperately in need of a friend, and you are there to offer encouragement and support to anyone who needs it. But because of your kind and loving nature, there are those who take advantage of you at times. This year, there will be an extra-powerful force field (if you wish) protecting you against those who might try to take advantage of you. You are meant to do some very special things in 2019, and nothing can hold you back. Although the year may begin on a down note due to some challenge you are struggling through, the tone of the year should quickly change before spring when a sense of beautiful rejuvenation and a new lease on life takes hold. This year should be filled with warm new relationships, financially rewarding opportunities that may involve one or more of your talents, and many chances to find a greater purpose in your life. Much of this may have seemed impossible not long ago, but once again, you will become a believer that you are destined for great things. Enjoy the ride, taking the time to stop and smell the roses at every chance, to build new friendships, to come closer to family, and to reach for your dreams.\n\nLove\nYour love life may have been somewhat tumultuous last year, Pisces, and you may still be getting over it. If you experienced negative happenings in romance, you may still be afraid to trust and to love again. But if you begin the year with fear rather than with hope in your heart, your eyes will not be fully open to the possibilities - and there will be many chances to love and to be happy. Sometimes, because you are very warm and sociable, you long to have someone by your side, and you might tolerate others who may treat you less respectfully than what you deserve. If you have been this way, this year you will need to recognize your own value and refuse to let anyone take advantage of you or take you for granted. The more self-esteem you build, the better your chances will be for a really great romantic life this year. Whether you are single or attached, you need to stick to your values and principles and demand that you are treated fairly and that your lover recognizes your many special qualities. For single Pisces people, a recent tempestuous connection may have left you with a sour taste in your mouth, and you may be afraid to get involved again. Or, you might have the opposite reaction, rushing into the arms of someone who is wrong for you just because you crave the connection. But if you are hopeful and you use common sense, this could actually be quite a magical year for you romantically. Demand what you deserve, and you shall have it. If you are attached, let your partner know that you value yourself. This strong stance will show that you are serious about not being taken for granted. You can enjoy a fabulous love life with your partner this year if you put yourself first for a change and demand the affection and attention you deserve.\n\nFamily\nYou may have felt disrespected by certain members of your family in the past. Or maybe this is an ongoing pattern. Has someone been treating you unjustly, as though you are below them, and you have allowed it because you didn't want to ruffle any feathers? In 2019, you would have the strength you need to make a change in that relationship if you demand respect in the same way you are urged to do in your love life. Someone who is insecure might treat someone they love disrespectfully because they don't feel respected by others, and it becomes a vicious cycle. But if you stand up to this individual, they could turn their behavior around. Disagreements among family members are bound to occur this year, but they can be easily derailed with a peaceful, loving approach to reconciliation. Your family is a great source of strength for you, and this year you can rely on them to provide you with encouragement and inspiration, leading to a stronger sense of self and the desire to fulfill your purpose here on earth more fully.\n\nCareer\nYour career, together with your finances may have seen your share of ups and downs, but in 2019 you are on the upswing. You may have lost confidence in yourself, a little bit perhaps, but there will be several events this year that will serve to build your confidence back up and show you what you are made of, Pisces. At the beginning of the year, you will have to be cautious and frugal about the choices you make in work or business as well as financially. Move slowly, think things through thoroughly, and only make commitments when things feel right. If you make a clear financial plan for yourself at the beginning of the year, and you follow it stringently, you will have more flexibility in what you choose to do career-wise. Having that room to grow and learn will also help to make you more confident, and it will open up a wider range of possibilities for you to choose from. Although you need stability, there is nothing to say that you can't find that stability in a work effort that is close to your heart. If you would love to find a career path that involves using your talents and creativity, that will definitely be possible this year. Learn as much as you can, perhaps taking classes and seeking out a mentor who can guide you. If you play it smart this year, you could build momentum and find yourself in a far more powerful position before the end of the year, both financially and in your career."
  }
}
